{
  "id": "1029210189",
  "title": "2024-5-13 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 トモノカイ様より 【仕様確認とご相談】 ①clientにおける担当者のパスワード再設定について ▼前提 担当者によっては、同一のメールアドレスで複数の企業アカウントを持っている場合がある。 例）FC企業と本部企業を跨いで登録している担当者。正社員とアルバイトのアカウントを見ている担当者。 ▼問題 上記の担当者が現仕様のパスワード再設定機能でパスワードを再設定しようとした際に、 送付されるパスワード再設定リンクは、どのアカウントに紐づくものなのか判定できていない可能がある。 複数アカウントで同一のメールアドレスで登録してパスワードを再設定したところ、すべてのアカウントのパスワードが変わりました。 こちらは意図した仕様という認識で良いでしょうか。 ▼要望案 運営部としては、どの企業アカウントのパスワードが変わったか、担当者が認知できば問題ないので、 パスワード再設定完了メールに、対象の企業コードの一覧を出力していただれば問題なさそう。 &rarr;GIG：承知しました、追加します。 Adminから企業担当者を招待して登録した際に、招待された人が企業コードがわからないので、わかる様にしたい。案としては、現状送信されていない登録完了メールを送信することにしてそこに企業コードを含めるか、招待メールに企業コードを追記するか、のいずれでも良い。 &rarr;GIG：承知しました、 【レビュー中】クライアント企業管理者招待メール に追加します。（パッケージ内外かはGIG内で確認必要） ②マスタの出力依頼 Google広告に取り込むURL一覧の作成のため、下記のデータを頂くことは可能でしょうか。 ・駅データ（駅名、駅コード ※URLに使うID） ・路線データ（路線名、路線コード ※URLに使うID） ・市区町村データ（市区町村名、市区町村コード ※URLに使うID） &rarr;トモノカイ様よりいただいたマスターデータ通りであるため、元のデータをそのまま参照いただく。 ★&rarr;URLとコードが対応しているか確認 また、下記の特徴ページの対応表はいつごろ作成して頂く予定か確認しても良いでしょうか。 https://docs.google.com/spreadsheets/d/1NBbn6IefE8-b3KVgVkV6r89LlZ705IAn6Oy5rsIOM44/edit#gid=682118696&amp;range=C3:C12 ★&rarr;GIG：明日までに提示する。 ③管理画面（admin）の縮尺について 前回、管理画面を表示する際に、デバイスによって表示される項目が一画面で収まらない場合、 横スクロールのコンポーネントが表示される仕様になっているのをやめて欲しい。というご依頼をしました。 現在対応いただいて、デフォルトの表示サイズは修正されているようですが、 ブラウザのサイズを半分した際に横スクールのコンポーネントがまだ出ているので、念のためお伝えしておきます。 ※テキストだと伝わりずらい動作についての話なので、画面見ながら補足させてください。 &rarr;一覧テーブル上にもマウスハンドラをつける手間を開発に伺い、大きくなければ対応する ④大学名の登録方法について再確認。（表記ゆれマスタの実装をどうするか） 前々回で議論点になったいた上記の件ですが、その後いかがでしょうか。 管理画面（admin）の会員検索機能の受け入れ作業を行っておりますが、そちらにも影響がある内容かなと思い、再度確認したいです。 &rarr;実装のスピードを優先し、設定ファイルで実装を着手するが、後々DBに移行する予定 ★&rarr;現時点で頂いているファイルで開発は進めて良いが、17日ごろに新しい内容のファイルを頂くので、最終的にはそれで実装するように オファー系のUATは時間を要するため、3営業日で終わらず週明けごろまでかかる見込み。 GIGより データ移行の移行データ管理表（ https://docs.google.com/spreadsheets/d/1rQJgwVjZ0G8nY2-bkCmEDVsdUqUNffK9FN0IAa8q1hs/edit#gid=1501569978 ）にて今後授受の依頼と、完了ステータスを管理していく。 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1029210189/2024-5-13",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-13T06:29:34.430Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 トモノカイ様より 【仕様確認とご相談】 ①clientにおける担当者のパスワード再設定について ▼前提 担当者によっては、同一のメールアドレスで複数の企業アカウントを持っている場合がある。 例）FC企業と本部企業を..."
}