{
  "id": "1124990978",
  "title": "2024-7-17 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正をメインで進めており データの操作等も並行して対応中 そのほか Slackのやりとりがある場合、参考としてチケットにもリンクを添付するご相談 保守フェーズの契約書案について、江尻が病欠のため明日以降にお渡しの予定 先日のサイトダウンへの対応のご説明 福井県のページへのアクセスがたくさんあったのは、ボットなどか？ 除外すべきアクセス元リスト集を頂けるとありがたい 【速度改善について】 ・大きな要因はアプリケーション側の処理（ここで4秒かかっている） ・デバッグコードを本日差し込んで原因特定する &rarr;開発で対応中 ・スロークエリについてはインフラ側で確認中 &rarr;金曜日にご報告 &rarr;売上に直結する内容で、半減近くになっているので最優先で対応すべき 【請求の承認について】 ・デバッグコードを差し込んでもらって本番反映完了済み ・開発にて確認 契約データのお渡しは（16日ではなく）目処立ち次第頂く トモノカイ様より ■確認① 採用確認の課題進捗について、ご共有お願いいたします。 &rarr;研修初日に未定という値を追加する相談 &rarr;★UI上、研修初日が空欄での表示をなくし、未定という表示をするようにする &rarr;在籍確認の選択肢の制限の方を優先する &rarr;金曜日にクライアント側でリリースが希望 ■相談① 昨日slackでご相談した「求人一覧ページの読込スピード」についてです。 &rarr;もし口コミクエリが遅ければ、星評価も非表示、またはキャッシュにしてOK 詳細は下記を参照していただき、求人一覧ページの読込速度の改善について議論できればと思います。 https://gig-inc.slack.com/archives/C04E48QPVC0/p1721120423544019 CTJ-4101 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ■相談② 前回、ご相談していた「自動オファーの配信ロジック」について、旧環境のロジックについてヒアリングしました。 下記、アピリッツ社からいただいた回答です。 こちらですが、曜日による企業の振り分けは行っておりませんでした。 以下のように企業IDの下1桁で、送信の振り分けを行っております。 「0-9」の中から、連続した数値を3つ選択します。（数値の選択時、前回の送信対象と被らないように「前回の選択数値の最後の要素 + 1」から開始します） 選択された数値と企業IDの下1桁がマッチする企業が、その日の自動オファー送信の対象となります。 上記のロジックにすることで、一人当たりの配信数をコントロールできていたようなので、 特に複雑なロジックは用意せず、前回ご提案いただいた「idによる振り分け」で問題なさそうです。 &rarr;★チケット起票する ■確認 前回、本番環境でのadmin/client採用確認ページのアクセス許可をして欲しいというご依頼をしましたが、こちらのご対応状況いかがでしょうか。 トモノカイのIPアドレスか、特定の企業コード（B0000530）での解除をお願いいたします。 &rarr;★明日までに対応 ■共有 課題の優先度について調整かけたので、共有になります。 jira側の変更を行う前に、こちらシートで認識の擦り合わせできればと思います。 調整後Highestが18件まで縮小することができました。 18件の中でも応募周りの改善を優先して着手していただけますでしょうか。 フリーワード検索の対象削減が必要であればトモノカイ様に相談する T-newsの本番修正反映を行い、ファイル作成しお渡しする（バッチは再開しない） ▼共有 自動オファーのロジック変更の件ですが、弊社でチケットを発行してないですが、 こちらもHIghest案件で対応をお願いいたします。 月200件程度の応募ボリュームがあり、一日でも早く復旧させたい次第です。 ▼質問 現在、ユーザー画面でログインすると、すべてTOPページに遷移する仕様になっており、 ログインする前のページに戻れない状態になっております。 こちら、ログインした場合は、直前のページにリダイレクトがかかるような仕様にしたいのですが、 実装するとした場合、どのくらい工数かかりますでしょうか。 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1124990978/2024-7-17",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-23T05:36:18.595Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正をメインで進めており データの操作等も並行して対応中 そのほか Slackのやりとりがある場合、参考としてチケットにもリンクを添付するご相談 保守フェーズの契約書案について、江尻が病欠のため明日..."
}