{
  "id": "1125089281",
  "title": "2024-7-3 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正を進行中 速度改善の状況 口コミのクエリを修正したものの、やはり処理が重いことが原因 こちらも処理を軽くするよう修正中 クエリの修正はステージングで行い、直った後に本番反映することで本番修正するフローは無理か？&rarr;本番の挙動は本番でしか確認できないので、フローは固定。ただしその結果本番が遅くなるようなら差し戻し、その処理を行わないようにする。 そのほか GIGより 本番反映のフロー 現在の反映の仕方は、STGへ反映させた内容を複数件まとめて本番へ反映することになる。 フェーズ５の検討時期のすり合わせ（開始時期、スコープ） 今後の予定・目標 9月までにリニューアル前の状態に持っていく 12月までに情報局などフェーズ5も完了する トモノカイ様より ■相談① ▼問題（事象） 現在、既存会員が求人応募しようとしたときに応募条件を満たしていなかった場合、「 応募条件を満たさないため応募できません 」というようなエラーだけ出て、 実際にどの項目が満たせていないから応募できないかが分からない仕様になっております。 上記が要因で既存会員の応募率が減少しており、早急に改善が必要な状況です。※学歴情報が正しく引き継げていない会員もおり、影響範囲が大きいです。 以上を踏まえて、修正できないかと考えておりますが、下記仕様の場合開発工数はどのくらいになりそうでしょうか。 ▼仕様想定 既存会員の応募でも、応募兼会員登録時に使用している応募フォームを表示し、会員の場合は登録されている情報が自動入力されている状態にする。 そのうえで、応募条件を満たしていない場合、満たしていない項目にエラーを表示する。 例）応募条件が「大卒」求人の場合、学年項目部分に「こちらの求人は学年が「卒業」の方しか応募できません。」というようなエラーを表示する。 &rarr;入力された内容はプロフィール上も更新される仕様で良い。 &rarr;★チケットを起票し対応する。 ■相談② ▼問題（事象） 現在、教室の教室プランを決定するロジックが「教室が作成されたときの契約情報に基づいて教室プランを決定する」というものになっております。 こちらの定義だと、プラン商品の契約が終了した場合や途中でプラン商品を契約した場合、教室プランが変更できない問題が発生しております。 上記を解決するために、教室プランについてもどこかしらのタイミング変更できる機能が必要になります。 3つパターンを考えているのですが、開発工数が少なく済むものは、どちらになりますでしょうか。 ▼仕様想定 パターン① 教室プランについては、毎日1回最新の契約情報を参照して、上書きをするようにする。&rarr;今あるバッチ処理を修正する パターン② 教室基本情報の「教室プラン」を編集可能にする。※オペレーションで上書きする。 パターン③ 新しく契約を作成（更新も含む）した際は、必ずその配下の教室プランが最新化されるようにする。&rarr;バグがないか確認し、仕様通りになるよう修正 &nbsp; ■相談③ ▼問題（事象） 現在、口コミページの口コミが正しく表示されていない（テキストがない、カテゴリが正しくない、UIが悪い）状態が続いており、ユーザーの離脱要因であったり、企業様からも複数お問い合わせを頂いている状況です。 上記を踏まえて、しばらくの間口コミの導線の非表示化と口コミ自体の閲覧をできないようにするような対応をしたいです。 ※すぐに解消できるのならいいのですが、現状口コミのデータインポートにも問題がある可能性があり、解決に時間を要する可能性が高いです。 ▼仕様想定 ★すでに課題で起票しているものもありますが、全体TOP、求人一覧、求人詳細、ヘッダー（PCのみ）の口コミ導線を一律非表示化する。&rarr;URLからのアクセスは残す、ステージングでは導線を残してもOK オファー機能は今週中に修正予定 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1125089281/2024-7-3",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-03T06:45:03.961Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正を進行中 速度改善の状況 口コミのクエリを修正したものの、やはり処理が重いことが原因 こちらも処理を軽くするよう修正中 クエリの修正はステージングで行い、直った後に本番反映することで本番修正するフローは無理か..."
}