{
  "id": "1125089319",
  "title": "2024-7-26 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 GIGより MTGの時間について 当面変更後の時間にて実施する 採用確認バッチ STGで毎時回す形へ変更済み。 フェーズ4.5の契約 トモノカイ様の全員をメンションして連絡する ★サーバー費用 現状では4,700USD＝70万＋くらい DBスペックを下げると3300USD＝50万円くらい スペックダウンの影響はDBの反応速度 以前のアピリッツ社では30万〜40万円くらい 安くすべく、オンデマンドではなく インスタンスごと買う 形式に変更も検討できる T-news ライトプランでの契約は現在あるか？&rarr;現時点でなし ★全体トップの求人数表示の数字が正しいか、再確認。 参考：ステーションの教室数が25000くらい 【トモノカイ記入】 旧環境ではサービス種別問わず選択できたが、現環境ではサービス種別によっては選択できなくなる項目のデータについて ※「大卒以上」や「学生不可」 旧環境から値がそのまま引き継がれており、画面上表示もされないため編集も行えない という状態に陥っています。(DB上には値保持されているが、どこからも値を変更する術が存在しない) 質問事項 これらの求人データはバッチ等含む該当項目で条件指定を行った場合、それらは適用されてしまう状態になっている という認識でよろしいでしょうか？ ★問題：ステーションの求人に「大卒以上」や「学生不可」のデータが入ってしまっているが、編集ができない状態になってしまっており、編集したい T-newsバッチ処理で、本当は含めたい求人がこの条件にひっかかってはじかれているのではないか？ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/744554649/813_+FIX+t-news+CSV?focusedCommentId=1164935321 の通り対応 フリーワード検索のバグ／仕様について相談 SP版でフリーワードを入力した後、「検索」ボタンではなく、キーボードの検索を押して、検索結果を表示すると「&amp;working_period_min=&amp;work_time%5B%5D=」というパラメーターが挿入されて検索結果が０件になる事象が発生している。 上記の影響でフリーワード検索以外のエリアや指導形態、給与などの項目を選択した状態でフリーワードを追加して検索すると、それまで入力していた、エリア／指導形態／給与の条件が自動で外れてしまう事象が発生している。 最優先案件の調整と確認 ユーザー画面対象ページ：構造化データマークアップの適用 GoogleFontが毎回DLされていることによる読み込み遅延の解消対応 自動オファーバッチロジックの修正 ユーザー画面：LazyLordの実装 検索機能：フリーワード検索の対象範囲を調整 ※前述したバグについて合わせて解消して欲しい。 求人一覧：SP版の検索コンポーネントにフリーワード検索を表示する Highest案件が徐々に消化しつつあるので、8月2週目以降に着手して欲しい課題の調整を行います。 火曜日までに部内で調整するので、水曜日の定例で共有させていただきます。 契約更新のデータを本日頂く 請求データのアップロード後の調整についての要件を頂く &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1125089319/2024-7-26",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-26T05:13:32.001Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 GIGより MTGの時間について 当面変更後の時間にて実施する 採用確認バッチ STGで毎時回す形へ変更済み。 フェーズ4.5の契約 トモノカイ様の全員をメンションして連絡する ★サーバー費用 現状では4,..."
}