{
  "id": "1125122049",
  "title": "2024-7-10 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正を進めております そのほか 本番環境での反映フロー見直しに伴う開発サーバー設立のご相談 立ててOK 早くて来週から再来週にかけて構築する Highestの採用確認のチケットの進捗をご共有する &rarr;期限超過周りの対処も併せてお願いしたい。バッチ周りの確認も今後行うので、チケット増える可能性あり。 ご共有：日本時間の営業時間ベースで完了目処を考える運用を進める トモノカイ様より ■相談① フリーワード検索コンポーネントの仕様変更についてご相談。 ▼背景 部内調査の結果、リニューアル後フリーワード検索の利用者が減少しており、フリーワードの検索コンポーネントを求人一覧画面から見えなくしたことが影響しているようです。 フリーワード検索を利用したユーザーは、未利用ユーザーと比べてCVRが高いことから、そちらのユーザーが減少したことによって、サイト全体のCVRが下がっていることが考えられます。 &rarr;★全文検索は要求ヒアリングの段階で落とした経緯がなかったか確認。現時点の検索範囲を確認。対応すると検索エンジンを追加し追加費用がかかる。 ▼対策 ★求人一覧ページにフリーワード検索のコンポーネントの表示をお願いします。 フリーワード検索の検索対象範囲の調整も合わせてお願いいたします。 CTJ-4029 0f376871-0459-35fc-b139-2a34c915ec22 System Jira &nbsp; ■相談② adminのオファー新規作成機能がそもそも要件定義から漏れており、開発自体行われていない認識です。 こちら実装するとしたら、どのくらいの工数見積もりになりますでしょうか。 &rarr;Adminの企業管理からアクセスでき、実装済み。 ■確認① 「応募通知メール」と「応募管理」の管理画面上での応募者の生年月日が1日ずれている（管理画面上では応募通知メールの生年月日の1日前になる ┗client採用確認情報CSV、応募情報CSVでも、生年月日は会員情報より1日前になっている ┗admin採用確認画面では、応募通知メールと日にちのずれは生じない ※通知メール内の生年月日が正しそう&rArr;応募管理画面の詳細画面での生年月日表示が誤り。 サンプル）応募番号1001781：TEST TEST ┗メール上：生年月日2000年01月01日 ┗応募管理：1999年12月31日 ┗会員情報：2000年01月01日 ★調査する &nbsp; ■確認② adminの教室情報アップロード機能についての質問。 上記機能を利用して、新規の教室を登録しようとすると「教室IDを入力してください」というエラーが出て表示できませんでした。 要件定義書 を確認したところ、教室IＤは自動でシステムで附番される定義なのですが、こちらは実装が漏れているという認識でよろしいでしょうか。 ★とりあえず、調査をお願いしても良いでしょうか。（実装するかは別の判断） ■今後、Highest案件の中でも優先して対応して頂きたい案件の共有 ※採用確認は除く &rarr;★Highestのうち、下リスト以外のHighに落としても構わないものをHighにして頂く 会員の退会処理が正しく動作していない 応募採用管理(client)：応募詳細画面の職業・学歴の項目が表示されない 求人一覧：口コミへの導線の非表示化（一時的な対応） ※残りスマホの一部のみ 検索機能：フリーワード検索の対象範囲を調整 ユーザー画面：LazyLordの実装 NaviPlusCSV：エリア情報が出力されていない、非掲載の教室もデータに含まれている 全体TOP：口コミの導線を非表示化（一時的な対応） 求人詳細：口コミ導線の非表示化（一時的な対応） 会員管理(admin)：希望条件の勤務地、指導経験の項目が必須になっているので修正 求人一覧閲覧：駅（/station）のページ構成が正しくないものがある 求人一覧閲覧：「塾ブランドごとにまとめて表示」の仕様変更 ユーザー画面対象ページ：構造化データマークアップの適用 ※jobpostingのみ優先 ■確認 &nbsp; ①オファー商品のアップロードについて こちら要件等如何でしょうか。。できれば今週中に実施したいです。要件のご指定等ありましたらお教えください。 &nbsp; ② 請求周りの改修と請求明細のアップについて 7月請求はadminで送りたいと考えています。手順としては、 ┝請求データをアップロード（弊社からデータお渡しし貴社に実施頂く） ┝PDF一括作成、承認 ★で行きたいと考えています。そのために、下記改修リリース可能でしょうか？ 最重要7/19まで希望： CTJ-3981 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 次点7/19まで希望： CTJ-4078 0f376871-0459-35fc-b139-2a34c915ec22 System Jira &nbsp; また、請求明細データの要件をお渡し、調整が完了次第、下記2点考えておりますが、期日感は現実的でしょうか。 ┝7/19までに動作確認のために6月明細のアップロード（7/16までには弊社からデータをお渡し）&rarr;可能 ┝8/1にデータ譲渡、8/2にアップロード（7月分本実行）&rarr;可能 ※形式はリリース時に鈴木からご依頼させて頂いた明細の形式に合わせる ※明細データ追加ではなく上書き想定（おそらく微妙に作られている請求データがあるはずでそれを上書きしたい） &rarr;全体としては、採用確認機能を正常化することが優先 &nbsp; ③請求データの作成システムの挙動の整合性を確認したいですが、できるタイミングお伺いしたいです。 急募をアップロードで入れていたり、諸々イレギュラーがあるため、その整合性を確認できるのが、 だいぶあとな認識をしています。急募や契約などリリースされたら確認でき、早くて9月請求分からかな、と思っていますが、ご所感いかがでしょうか。 ■確認 500エラーのインポートの件 https://gig-inc.slack.com/archives/C04E48QPVC0/p1720590690308729?thread_ts=1720425182.383739&amp;cid=C04E48QPVC0 &rarr;トモノカイ様に、事象が確認できる企業コードをスラックでご提供頂く ■オファー周り残案件確認 オファー管理(client)：送信履歴に表示されている「応募数」のカウントが正しくないので修正 オファー管理(client)：公開設定が「非公開」の教室がパーソナルオファーの送信対象として選べないので修正 オファー管理(client)：パーソナルオファーのオリジナル文面の「塾の特徴」の文字数上限を300文字に修正 パーソナルオファーメール通知テンプレ：オリジナル文面のテキストに「/n」改行コードが入っているので修正 オファーの対象者抽出ロジックの変更 &rarr;最終ログイン日時も過去5年以内のみ対象とする、または登録日時が過去5年以内のみ対象とする ★送信履歴のエラーがエラーとして表示されていない不具合は、オファー再開時のSESダウンに影響するか？ &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1125122049/2024-7-10",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-16T10:12:59.502Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 不具合の修正を進めております そのほか 本番環境での反映フロー見直しに伴う開発サーバー設立のご相談 立ててOK 早くて来週から再来週にかけて構築する Highestの採用確認のチケットの進捗をご共有する &..."
}