{
  "id": "1266417685",
  "title": "2024-11-29 フェーズ5に関するミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、平山様、原口様 GIG： 資料 https://docs.google.com/spreadsheets/d/1-Xmse1cr-U3wJK6rMTI9NBYPvgQuOZDezzIumo74pww/edit?gid=1154879342#gid=1154879342 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 17 17 complete 情報局の現状のアクセス数情報を共有する。（平山様）（ ） 18 18 complete 記事の現状の編集頻度（1日平均）を共有する。（平山様）（ ） 19 19 complete フリーワード検索数を共有する。（平山様）（ ） 20 20 complete （アクセス数・編集頻度を受領後）情報局を追加した場合（全文検索パターン、タイトルのみ検索パターン）のDBの構成変化パターン、概算増加金額を共有する。 進捗確認 デザイン：FIX 実装：進行中 アドミン-記事管理のテスト/修正対応が若干伸びていますが、概ねスケジュール通りに進行中 そのほか 1回目のデータ移行の準備のお願い（GIG小竹） 来週中に こちら のシートに記載の形式でデータのご準備をお願いいたします。 DBインスタンスの構成パターンについて（GIG小竹） ご共有いたただいた資料は こちら 【ご共有いただいたデータから推測できること】 現状のアクセス数、検索数であれば現状の構成で問題ない見込みです。 しかし今回採用するUIでは、TOPページに検索窓がある形で検索数の増加が見込まれます。 現状のUIで25万アクセスでアクセス数と同等の検索回数の可能性あり 【提案】 DBは分ける方針が良いかと考えております。 分ける理由： 全文検索またはタイトルのみの検索（中間一致など）の場合は現状のDBインスタンスだと落ちる可能性があるため 塾ステーションで使用しているDBインスタンスと切り分けた方が塾ステーションで起こっている問題と区別できるため 全文検索の場合 手法： フルテキストインデックス（フルテキストサーチ）（MySQLの全文検索） レコード数的にはこの実装方法で問題ない想定です。 懸念点はDBのインスタンスサイズを絞っていることで、落ちる可能性が少しあること。 構成： 分けた場合 スモールサイズの購入 増加金額：月額：44.86 USD（約6,808円）増加する見込み 詳細は こちら です。 （ミディアムの場合はおよそ2万円程度） 分けない場合 変動なし タイトルのみの検索の場合 手法： 前方一致 この場合は既存のDBを利用する それ以外（中間一致など） 構成： 分けた場合 スモールサイズの購入 増加金額：月額：44.86 USD（約6,808円）増加する見込み 分けない場合 変動なし トモノカイ様テストについて（GIG小竹） 来週月曜日を目処にアドミン-記事管理-新規登録のテストのご依頼をする予定です。 現在、画像系の修正に時間の対応をしているため、その箇所については修正対応中ということでお渡しする想定です。 その他確認（江尻） データ移行関連 旧システムのテーブルのレコードのIDの最大値確認（新システムのDBの開始番号決定のため） 記事画像、記事バージョン created_byの値（レコード作成者）（ご指定可能であれば） &rarr;管理者ID：12（トモノカイ） Adminの記事詳細ページ を本文の配置を上にする案 &rarr;閲覧の優先度により、バージョン履歴の下にする。 &nbsp;アクション事項 （原口様）1回目のデータ移行のデータ用意 こちら の記載のドライブのフォルダにアップロードお願いいたします。 対応期間： から &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: 7537aca2-9e76-4f75-b3c2-14769adc8edf 25de24eb-64a1-43ca-a27d-5903bb842cd1 DECIDED DBインスタンスの構成は全文検索でDBを分ける（スモールサイズのRDSを購入する形）で決定 ※リリース後に様子を見てDBサイズをミディアムなどに変更する必要があれば検討する DBインスタンスの構成は全文検索でDBを分ける（スモールサイズのRDSを購入する形）で決定 ※リリース後に様子を見てDBサイズをミディアムなどに変更する必要があれば検討する",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1266417685/2024-11-29+5",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-11-29T04:31:19.182Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、平山様、原口様 GIG： 資料 https://docs.google.com/spreadsheets/d/1-Xmse1cr-U3wJK6rMTI9NBYPvgQuOZDezzIumo74pww/edit?gid=1154879342#gid=1154879342 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ..."
}