{
  "id": "1266417665",
  "title": "2024-11-22 フェーズ5に関するミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、平山様、原口様 GIG： 資料 https://docs.google.com/spreadsheets/d/1-Xmse1cr-U3wJK6rMTI9NBYPvgQuOZDezzIumo74pww/edit?gid=1154879342#gid=1154879342 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 17 17 complete （トモノカイ様池田様）元のロゴデータの確認 18 18 complete （GIG小竹）決定した方針でのスケジュールの再調整 進捗確認 現在は、スケジュールに則りデザイン初稿FB、実装も進行中 概ねスケジュール通りに進行中 そのほか 遅らせる機能の中での優先度の確認（GIG小竹） 質問1：着手優先度は下記の通りで問題ないでしょうか？ &rarr;問題ない。 プレビュー機能 差分機能 記事削除機能 質問2：遅らせる機能の中でできたもの順から検証/修正を進め、リリースする想定で問題ないでしょうか？ &rarr;問題ない。 情報局の開発にあたっての質問：DBサーバを情報局と塾ステーションで分割するか、同じDBサーバを使うかを検討にするために、情報局へのアクセス数（PV数）+記事の編集頻度 + フリーワード検索数をご教示ください。 -&gt;後日平山様からご回答いただける こちら の全文検索について（GIG小竹） 全文検索の実装により、DBインスタンスの負荷に影響が出る可能性があります 対処法：その場合追加でインスタンスの購入または容量アップをする必要がある可能性があります。 -&gt;GIGで調査し検討した結果、再度ご提案する。 質問：タイトル検索の場合の実装方法とその実装方法での金額感について 全文検索とは負荷が変わる 全文検索、タイトル検索のパターンの2つ 全文検索の実装方法が変わる可能性がありますので現状の実装方針をご共有いたします。 現状の実装方針 フルテキストインデックス（フルテキストサーチ）（MySQLの全文検索） レコード数的にはこの実装方法で問題ない想定です。 懸念点はDBのインスタンスサイズを絞っていることで、落ちる可能性が少しあること。 AWS Cloud Search 料金が追加でかかります。 アクセスが多い場合はこちらで実装予定です 現在見積もりしている工数よりも増える フェーズ5のトモノカイ様テストについて（GIG小竹） フェーズ4までのテストと流れは こちら に記載の流れと同じになります。 テスト開始時期について こちらのスケジュールの通り最初のテストはアドミンの記事管理の新規作成を予定しておりますが、開発が若干伸びている状況ですのでトモノカイ様の新規作成のテストも来週金曜日から再来週にずれ込む想定です。申し訳ござません。開発/GIGテストが進みお渡しできる日が分かり次第スケジュール更新し、ご連絡いたします。 最初に依頼予定の記事管理_新規作成について お渡しするときにコメントいたしますが、新規作成ページをテストする際に登録した記事の確認はまだできないになります。ですので登録画面のみの検証をしていただき、正しく登録されたかはDBを確認する形になります。 最初のテスト時には要求事項全てを確認できないことはご容赦ください。 採用お祝い 来年の4月から法律変わり禁止になる 採用お祝い金の表記の削除やamazonギフトの発行の停止など影響範囲が大きそう このあたりが保守運用に影響する &nbsp;アクション事項 16 16 complete 情報局の現状のアクセス数情報を共有する。（平山様）（ ） 19 19 complete 記事の現状の編集頻度（1日平均）を共有する。（平山様）（ ） 20 20 complete フリーワード検索数を共有する。（平山様）（ ） 21 21 complete （アクセス数・編集頻度を受領後）情報局を追加した場合（全文検索パターン、タイトルのみ検索パターン）のDBの構成変化パターン、概算増加金額を共有する。 &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b1244d0b-cbeb-474d-9f20-7843aa833bab 719fef88-924d-4306-9e94-15509022c508 DECIDED テストの進捗の遅れは機能単位で見てその間で吸収できるか判断を行う。できなければ、全体に影響出るか判断する形で進める テストの進捗の遅れは機能単位で見てその間で吸収できるか判断を行う。できなければ、全体に影響出るか判断する形で進める",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1266417665/2024-11-22+5",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-11-28T01:46:59.847Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、平山様、原口様 GIG： 資料 https://docs.google.com/spreadsheets/d/1-Xmse1cr-U3wJK6rMTI9NBYPvgQuOZDezzIumo74pww/edit?gid=1154879342#gid=1154879342 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ..."
}