{
  "id": "1276739586",
  "title": "338_【FIX】記事バージョン差分確認機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】記事バージョン に登録済みのデータの差分を比較するための機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、ゲスト管理者、記事管理者、記事担当者が本機能を利用することができる。 本機能で選択、表示する 【FIX】記事バージョン は、保存された 【FIX】記事バージョン のうち、タイトル、要約、本文、において更新があったレコードのみとする。 改訂履歴一覧ページ 改訂履歴のバージョンの一覧を更新日時の降順で 上位100件ををテーブル形式で表示 する。テーブルの列の項目は下記の通りとする。 「バージョン」には、 【FIX】記事バージョン に保存されている値を表示する。 「 更新者 」には、 【FIX】記事バージョン に保存されている 【FIX】全体管理者登録情報 の値を表示する。 「バージョン管理メモ」には、 【FIX】記事バージョン に保存されている値を表示する。 「 更新日時 」には、 【FIX】記事バージョン に保存されている値を表示する。 「タイトル」「抜粋（要約）」「本文」には、 【FIX】記事バージョン に保存されている 値を 変更フラグの値から、変更ありであればチェックとして 表示する。 「比較対象」には、チェックボックスを設置する。 最新のverはでデフォルトでチェック入っている状態とする。 最大2つまで選択可能で、2つ選択したあとは他のチェックボックスは選択できない（非活性）仕様とする。 「復元」には、復元アイコンを表示する。 そのアイコンを押下することで、そのverの「タイトル」「抜粋（要約）」「本文」 が復元された状態の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 に 遷移する。詳細は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 の記載に従う。 テーブルの上下に「差分を見る」 ボタンを表示 する。ただし、「比較対象」のチェックボックスが２つ選択されていない時は、ボタンを非活性とする。 「差分を見る」ボタンを押下するとブラウザの新規タブで確認ページが開かれる。 確認ページ 改訂履歴一覧ページにて、選択した2つのverの「タイトル」「抜粋（要約）」「本文」を下記に示すタブ形式で確認できる。 差分タブ 選択した2つのverの「タイトル」「抜粋（要約）」「本文」の差分が確認できるタブ 変更後タブ 選択した2つのうち更新日時が最新のverの「タイトル」「抜粋（要約）」「本文」が確認できるタブ 変更後タブ 選択した2つのうち更新日時が2番目に新しいverの「タイトル」「抜粋（要約）」「本文」が確認できるタブ タブを切り替えることで各内容を確認することができる。 差分タブ 差分の表示は、 選択した2つのverの「タイトル」「抜粋（要約）」「本文」 のテキストの変化がわかるように差分を可視化し、スタイルの変化については差分として表示しない。 差分の表示の単位は下記のとおりである。 h2、h3、h4、 h5、h6、 通常テキストは文字列単位で差分を表示する。 h2、h3、h4 、 h5、h6、 通常テキスト以外はその要素自体の追加/削除/変更があった場合にその要素全体の差分を表示する。 例えば、表の中の値を変更した場合の差分表示は変更前の表と変更後の表の並べて差分を表示をする。 可視化方法は下記である。 追加した部分を緑の背景色で表示 削除した部分を赤の背景色で表示かつ打ち消し線で表示 「改訂履歴に戻る」ボタンを表示し、押下すると改訂履歴一覧ページに遷移する。 変更前タブ 選択した2つのうち更新日時が最新のverの「タイトル」「抜粋（要約）」 「本文」 をスタイルが維持されている状態で表示する。 「改訂履歴に戻る」ボタンを表示し、押下すると改訂履歴一覧ページに遷移する。 「復元する」ボタンを表示し、押下するとそのverの「タイトル」「抜粋（要約）」「本文」 が復元された状態の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 に 遷移する。詳細は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 の記載に従う。 変更後タブ 選択した2つのうち更新日時が2番目に新しいverの「タイトル」「抜粋（要約）」「 本文 」をスタイルが維持されている状態で表示する。 「改訂履歴に戻る」ボタンを表示し、押下すると改訂履歴一覧ページに遷移する。 「復元する」ボタンを表示し、押下するとそのverの「タイトル」「抜粋（要約）」「本文」 が復元された状態の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 に 遷移する。詳細は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610650 の記載に従う。 3.1. 権限 要求事項の記載と同じ 3.2. 帳票 概要の記載と同じ 3.2.1. 本機能 【FIX】記事登録・公開・非公開・削除フロー 3.2.2. 関連 【FIX】ピックアップ記事選定フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 4.1.1.改訂履歴一覧ページ https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=190754-27091&amp;t=DZuuiuEMNM9JT9y8-4 4.1.2. 4.1.2.確認ページ（差分タブ） https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=191504-27140&amp;t=DZuuiuEMNM9JT9y8-4 4.1.3. 4.1.3.確認ページ（変更前タブ） https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=191504-27280&amp;t=DZuuiuEMNM9JT9y8-4 4.1.4. 4.1.4.確認ページ（変更後タブ） https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=191504-27419&amp;t=DZuuiuEMNM9JT9y8-4 4.2. 入力（作成中） 変数名、説明、バリデーションは 、 【FIX】記事バージョン の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. 改訂履歴一覧ページ 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 記事番号 &nbsp; URLパラメータ 履歴を閲覧する記事を一意に指定するための番号 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.2.2. 確認ページ 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 記事番号 &nbsp; URLパラメータ 閲覧する記事の履歴を一意に指定するための番号 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 2 選択したバージョン（比較対象） URLパラメータ 記事内容/差分を確認するために、比較するバージョンを指定するための 2つの 番号 どちらか１つでも入力がない 、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力（作成中） 説明は、 【FIX】記事バージョン の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 改訂履歴一覧ページ 下記のいずれかを満たす（OR条件で満たす）レコードのみ抽出して表示する。 タイトル更新フラグが「true」（更新あり） 要約更新フラグが「true」（更新あり） 本文更新フラグが「true」（更新あり） 項目名 出力先 説明 1 記事番号 画面 HTMLエスケープ処理をして出力する。 2 タイトル 画面 HTMLエスケープ処理をして出力する。 3 記事情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した記事レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「記事情報：」プレフィックスで始まる出力項目として説明する。 4 記事情報：バージョン 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン の「バージョン」を表示する。 5 記事情報：更新者 画面 保存された値が指し示す 【FIX】全体管理者登録情報 の情報を「[氏名]（[ニックネーム]）」形式で出力する。 6 記事情報：バージョン管理メモ 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン の「バージョン管理メモ」を表示する。 7 記事情報：更新日時 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン の「更新日時」をyyyy/mm/dd hh:mm形式で表示する。 8 記事情報：タイトル更新フラグ 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン のタイトル更新フラグがTrueの場合に画面上にてチェックの形式で表示する。 9 記事情報：要約更新フラグ 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン の要約更新フラグがTrueの場合に画面上にてチェックの形式で表示する。 10 記事情報：本文更新フラグ 画面 データベースから取得した記事情報1レコードの 【FIX】記事バージョン の本文更新フラグがTrueの場合に画面上にてチェックの形式で表示する。 4.3.2. 確認ページ（差分タブ） 項目名 出力先 説明 1 タイトル 画面 選択した2つのverの「タイトル」 のテキストの変化がわかるように差分を可視化する。 2 要約 画面 選択した2つのverの「抜粋（要約）」 のテキストの変化がわかるように差分を可視化する。 3 本文 画面 選択した2つのverの「本文」 のテキストの変化がわかるように差分を可視化する。 4.3.3. 確認ページ（変更前タブ/変更後タブ） 項目名 出力先 説明 1 タイトル 画面 HTMLエスケープ処理をして出力する。 2 要約 画面 HTMLエスケープ処理をして出力する。 3 本文 画面 CSSをあてた状態のHTMLを出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件のデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして更新日時の降順に並べて、データをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. ログ 改訂履歴ページ画面 を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read article revision history . article _id={記事番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 確認ページを表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read article comparison . article _id={記事番号} compare_number={バージョン番号},{バージョン番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 差分表示する際に、スタイルの変更があった場合 はスタイルの 差分として 表示しない。",
  "parentId": "703496344",
  "parentTitle": "330_■記事管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1276739586/338_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-13T04:30:07.589Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】記事バージョン に登録済みのデータの差分を比較するための機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、ゲスト管理者、記事管理者、記事担当者が本機能を利用することができる。 本機能で選択、表示する 【FIX】記事バージョン は、保存された 【FIX】記事バージョン のうち、タイトル、要約、本文、にお..."
}