{
  "id": "674234399",
  "title": "【FIX】オファー・応募・選考・採用フロー",
  "content": "概要 クライアント企業管理者が、必要に応じて会員へオファーを送信し、会員が応募をするまでの流れ。および、クライアント企業が応募した会員の選考を行い、採用するまでの流れ。 ※事前に https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674332719#%E6%95%99%E5%AE%A4%EF%BC%8F%E6%B1%82%E4%BA%BA%E9%96%A2%E9%80%A3%E6%83%85%E5%A0%B1%E7%99%BB%E9%8C%B2%E3%83%BB%E5%85%AC%E9%96%8B%E3%83%95%E3%83%AD%E3%83%BC が存在する。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 オファーフロー（パーソナルオファー） 順序 内容 誰が 1 クライアント企業向け管理画面にて、パーソナルオファーを選択し、オファーを送信したい会員の条件を 【レビュー中】オファー候補会員検索条件（パーソナルオファー） として登録する。 クライアント企業管理者 2 登録された時点で、 【レビュー中】オファー候補会員検索条件（パーソナルオファー） および 521_オファー機能利用条件 の両方に合致する会員を抽出する。 本システム 3 【レビュー中】オファー候補会員検索条件（パーソナルオファー） 前ステップで抽出した会員に対して、 【作成中】オファーメッセージテンプレート（パーソナルオファー） および 【レビュー中】オファー履歴 を登録することでオファーメッセージを送信する。 ただし、抽出した会員の合計数が 521_オファー機能利用条件 で定める配信可能数を超えていた場合は、オファーメッセージは送信せずに、その旨をクライアント企業管理画面で表示して、本フローを終了する。 本システム 4 送信した結果を 【レビュー中】オファー履歴 として記録する。 本システム オファーフロー（自動オファー） 順序 内容 誰が 1 クライアント企業向け管理画面にて、自動オファーを選択し、オファーを送信したい会員の条件を 【レビュー中】オファー設定情報（自動オファー） として登録する。 クライアント企業管理者 2 毎日5:05時点で、 【レビュー中】オファー設定情報（自動オファー） および 521_オファー機能利用条件 の両方に合致する会員を抽出する。 本システム 3 毎日10:00に、前ステップで抽出した会員に対して、 自動オファーメッセージ定型文（会員宛） および 【レビュー中】オファー履歴 を登録することでオファーメッセージを送信する。 本システム 4 送信した結果を 【レビュー中】オファー履歴 として記録する。 本システム 応募フロー ※事前に https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399#%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%E3%83%95%E3%83%AD%E3%83%BC%EF%BC%88%E3%83%91%E3%83%BC%E3%82%BD%E3%83%8A%E3%83%AB%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%EF%BC%89 または https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399#%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%E3%83%95%E3%83%AD%E3%83%BC%EF%BC%88%E8%87%AA%E5%8B%95%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%EF%BC%89 が存在する場合がある。 順序 内容 誰が 1 クライアント企業管理画面にて、任意の設定として、会員が応募する際に回答が必要な項目の追加と、応募時に会員へ自動返信する 応募完了メール（会員宛） の文面の追加を行う。 クライアント企業管理者 2 サービスサイトにおいて、下記手段によって表示・閲覧した求人ページの中で、 関心のある求人に対して、 必要な 【レビュー中】応募情報 を入力して応募を行う。 サービスサイト内の検索機能を利用して求人ページを表示する マイページの、キープリストや最近見た求人の一覧から、求人ページを表示する https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399#%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%E3%83%95%E3%83%AD%E3%83%BC%EF%BC%88%E3%83%91%E3%83%BC%E3%82%BD%E3%83%8A%E3%83%AB%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%EF%BC%89 または https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399#%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%E3%83%95%E3%83%AD%E3%83%BC%EF%BC%88%E8%87%AA%E5%8B%95%E3%82%AA%E3%83%95%E3%82%A1%E3%83%BC%EF%BC%89 によってマイページに届いたオファーメッセージのリンクから求人ページを表示する 会員 3 登録された 【レビュー中】応募情報 の採用ステータスは「未登録」に設定し、クライアント企業向け管理画面および会員のマイページにて対象の 【レビュー中】応募情報 を閲覧可能とする。 応募した会員に対して、 応募完了メール（会員宛） を送信する。 また、 対象の求人に紐づくクライアント企業管理者全員に対して 、 応募完了メール（クライアント企業管理者向け） を送信する。 本システム 選考・採用フロー 順序 内容 誰が 1 クライアント企業向け管理画面にて、 【レビュー中】応募情報 を確認し、 【作成中】応募メッセージ情報 を登録することで、応募した会員への質問・連絡事項や、面接日時調整のための候補日時などの連絡を行う。 クライアント企業管理者 2 クライアント企業管理者から会員へ 【作成中】応募メッセージ情報 が送信されたら、対象の会員へ メッセージ受信通知メール（会員宛） を送信する。 ※以降のステップでも、 【作成中】応募メッセージ情報 を利用した場合のメール送信は同じのため記載は省略する。 本システム 3 受信した メッセージ受信通知メール（会員宛） のリンクから、サービスサイトの 【作成中】応募メッセージ情報 のページを表示し、応募した企業からの 【作成中】応募メッセージ情報 を確認し、質問や面接日時の回答を行い、面接日程を回答する。 会員 4 会員から 【作成中】応募メッセージ情報 が送信されたら、対象のクライアント企業管理者の 【レビュー中】教室：応募情報転送連絡先／応募後連絡先電話番号 に登録されているメールアドレスの宛先 全員 へ メッセージ受信通知メール（クライアント企業管理者宛） を送信する。 ※以降のステップでも、 【作成中】応募メッセージ情報 を利用した場合のメール送信は同じのため記載は省略する。 本システム 5 必要に応じてここまでのプロセスを繰り返し行い、応募した会員とクライアント企業管理者の間で、面接日程を合意する。 - 6 受信した メッセージ受信通知メール（クライアント企業管理者宛） のリンクから、クライアント企業向け 管理画面にて対象の応募情報のページを開き、 合意した面接日程を登録する。 クライアント企業管理者 7 面接日程が登録された直後 、その旨の連絡のため、 面接日程決定通知メール（会員宛） を会員へ送信する。 本システム 8 面接日の前日10:00に、面接日程を確認するための 面接日程リマインドメール（会員宛） を会員へ送る。 本システム 9 クライアント企業の面接担当者に対して、応募した会員や面接の情報を共有する。 クライアント企業管理者 10 予め両者間で定めた方法で面接を行う。 クライアント企業 会員 11 面接結果を踏まえて、採用判断を行い、クライアント企業管理者に対して、面接結果を踏まえた採用判断結果を連絡する。また、「採用」とする場合は、研修初日の日付も併せて決定し連絡する。 クライアント企業 12 対象の会員に対して、 【作成中】応募メッセージ情報 を用いて採用判断結果を連絡する。また、「採用」の場合は、研修初日の日付を併せて連絡する。 クライアント企業管理者 13 採用判断結果がに応じて、クライアント企業向け管理画面にて、対象の 【レビュー中】応募情報 の 採用ステータス をそれぞれ下記の内容に設定する。 採用する場合：「採用」に変更する。 不合格の場合：「不採用」に変更する。 また、本プロセスの途中で下記の状態になった場合は、それぞれ記載の内容に設定する。 応募した会員と連絡が取れなくなった場合：「連絡取れず」に変更する。 過去6ヶ月以内に、本サイトの同じ教室に紐づく別の求人や、本サイト外の連絡手段により応募があった場合：「応募重複」に変更する。 何らかの理由により保留にする場合：「保留」に変更する。 クライアント企業管理者 14 採用ステータスが「採用」「不採用」「辞退」「欠席」「連絡取れず」のいずれかに変更された場合、変更された直後に、会員に対して、変更した内容に相違がないか確認をするための 採用ステータス通知メール（会員宛） を 送信する。 本システム 15 受信した 採用ステータス通知メール（会員宛） にて採用ステータスを確認する。 通知された採用ステータスによらず、対象の会員は自身の認識が「採用」「不採用」「辞退」のいずれかである場合、マイページへログインして、対象の応募ステータスを、自身が認識しているステータスに変更する。 採用ステータスが「採用」以外の場合は、ここで本フローは終了する。 会員 16 対象の 【レビュー中】応募情報 に紐づく 【統合により削除】採用状況管理 - 応募配下に移動 情報を登録 する。 本システム 17 クライアント企業向け管理画面にて、対象の 【レビュー中】応募情報 に紐づく 【統合により削除】採用状況管理 - 応募配下に移動 情報に、研修初日の日付、および、その後の引き継ぎ情報のメモを登録する。 クライアント企業管理者 18 登録された研修初日情報の確認のために、研修初日の日付を記載した 研修初日日付通知メール（会員宛） を会員へ送信する。 本システム 19 受信した 研修初日日付通知メール（会員宛） の文面にて、研修初日の日付を確認する。 会員 - この後、下記のフローが行われる。 【FIX】採用後在籍確認フロー 【FIX】採用お祝い/口コミ確認・公開フロー 【ページ統合により削除】口コミ登録・確認・公開フロー 【FIX】クライアント企業への請求・支払いフロー ー 関連資料 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E5%85%A8%E4%BD%93%E3%83%95%E3%83%AD%E3%83%BC https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E3%83%90%E3%83%83%E3%83%81%E4%B8%80%E8%A6%A7",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674234399/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-04-28T13:10:50.254Z",
  "author": "ejiri_yusuke",
  "excerpt": "概要 クライアント企業管理者が、必要に応じて会員へオファーを送信し、会員が応募をするまでの流れ。および、クライアント企業が応募した会員の選考を行い、採用するまでの流れ。 ※事前に https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674332719#%E6%95%99%E5%AE%A4%EF%BC%8F%E6%B1%82%E4%BA..."
}