{
  "id": "674594849",
  "title": "【FIX】ユーザー登録・退会フロー",
  "content": "1. 概要 エンドユーザーがサービスサイトに会員登録し、会員専用機能を利用可能とするまでの流れ。および、退会するまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 2. ユーザー登録フロー（会員登録フォームから行う場合） 順序 内容 誰が 1 会員登録ページでメールアドレス・パスワードを入力し、利用規約/個人情報保護方針に同意した上で「新規登録する」ボタンを押下する。 エンドユーザー 2 https://giginc.atlassian.net/l/cp/A96sE5ug をエンドユーザーに送信し、 https://giginc.atlassian.net/l/cp/A96sE5ug 送信完了及び会員仮登録完了ページに遷移させる。 本システム 3 届いた https://giginc.atlassian.net/l/cp/A96sE5ug にあるトークン付きのURLをクリックすることで会員登録が完了する。 この時同時にログインが行われ、 https://giginc.atlassian.net/l/cp/CLXQ1TVX も記録される。 エンドユーザー 4 会員登録と同時に、会員登録完了の旨を記載した 会員登録完了通知メール（サイト運営者宛） をサイト運営者にも送信する。 本システム 5 会員登録完了後はプロフィール登録ページに遷移し、 【FIX】会員：アカウント情報 および紐づく会員情報 を登録する。 入力内容に問題がある場合、エラーが表示されるため、エラー内容に従って情報を修正する。 入力内容に問題がない場合、ユーザー基本プロフィール登録完了画面に遷移する。 会員 6 順序5で正しく入力完了された 【FIX】会員：アカウント情報 および紐づく会員情報を保存する。 本システム 3. ユーザー登録フロー（求人応募完了時に、同時に会員登録される場合） ※本フローは部分的に https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399#%E5%BF%9C%E5%8B%9F%E3%83%95%E3%83%AD%E3%83%BC を参照しています。 順序 内容 誰が 1 サービスサイトにおいて、下記手段によって求人ページを表示する。 求人検索機能を利用して遷移する 急募・新着・人気の求人一覧から遷移する 最近閲覧した求人一覧から遷移する 指導形態などの特徴一覧から遷移する エンドユーザー 2 関心のある求人に対して、必要な 【レビュー中】応募情報 、 【FIX】会員：アカウント情報 および紐づく会員情報 を入力して応募を行う。 エンドユーザー 3 応募情報に入力した 【レビュー中】応募情報 、 【FIX】会員：アカウント情報 および紐づく会員情報 を保存して会員仮登録を行う。 本システム 3 応募完了と同時に、 応募完了メール（会員宛） と https://giginc.atlassian.net/l/cp/A96sE5ug を エンドユーザーに送信する。 本システム 4 登録された 【レビュー中】応募情報 情報の採用ステータスは「未登録」に設定し、クライアント企業向け管理画面および会員のマイページにて対象の 【レビュー中】応募情報 情報を閲覧可能とする。 本システム 5 対象の求人に紐づくクライアント企業管理者全員に対して、 応募完了メール（クライアント企業管理者向け） を送信する。 （※サイト運営者に対して、会員仮登録完了メールは送信しない。） 本システム 6 https://giginc.atlassian.net/l/cp/A96sE5ug の送信及び会員仮登録と求人応募が完了した旨を記載したページに遷移する。 エンドユーザー 7 届いた 会員登録用URL通知メール（会員宛） にあるトークン付きのURLをクリックすることで会員本登録が完了する。 この時同時にログインが行われ、 https://giginc.atlassian.net/l/cp/CLXQ1TVX も記録される。 エンドユーザー 5 会員登録完了と同時に、対象ユーザーの会員登録が完了した旨を記載した、 会員登録完了通知メール（サイト運営者宛） をサイト運営者に送信する。 本システム 6 会員登録完了後は、会員登録完了ページに遷移する。 会員 4. ユーザー退会フロー 番号 内容 誰が 1 サービスサイトにログインを行い、退会画面に遷移する。 会員 2 退会理由を入力し、退会への同意を行なった上で退会用ボタンを押下する。 入力内容に問題がある場合、エラーが表示されるため、エラーに従って入力内容を修正する。 入力内容に問題がない場合、ログアウト状態で退会完了画面に遷移すると同時に、退会が完了する。 会員 3 退会完了した旨の 退会完了通知メール（会員宛） をエンドユーザーに送信する。 本システム 5. 制作内部用備考 ※以下パッケージを参照しました。 https://giginc.atlassian.net/wiki/spaces/UFCMN/pages/387449249?atlOrigin=eyJpIjoiYmIxZWI4MjU1YjExNDNhYTk4ZTlkNjUwNzBmMWZmMTkiLCJwIjoiYyJ9 https://giginc.atlassian.net/wiki/spaces/UFCMN/pages/402948101?atlOrigin=eyJpIjoiZmNiYjZkOGY5ZTE5NDNlN2E3N2FhZDIxODFhYjk3ZjIiLCJwIjoiYyJ9 https://giginc.atlassian.net/l/cp/0HFhrA2a",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674594849/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-09T10:25:50.075Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 エンドユーザーがサービスサイトに会員登録し、会員専用機能を利用可能とするまでの流れ。および、退会するまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 2. ユーザー登録フロー（会員登録フォームから行う場合） 順序 内容 誰が 1 会員登録ページでメールアドレス・パスワードを入力し、利用規約/個人情報保護方針に同意した上で「新規登録する」ボタンを..."
}