{
  "id": "674660389",
  "title": "【FIX】オシゴトQ＆A登録・回答・公開・編集・非公開・評価フロー",
  "content": "1 7 1. 概要 サービスサイトに掲載されている求人に関して会員が質問を行い、それに対する回答と確認が完了するまでの流れ。 また、公開された質問および回答がエンドユーザーによって評価される流れも合わせて記載する。 ※クライアント企業管理画面/全体管理画面でできる操作は同じだが、ここでは主な業務フローを記載している 2. オシゴトQ＆A登録・回答・公開フロー(クライアント企業管理者) 内容 誰が 1 サービスサイトにログインを行う。 会員 2 質問対象の求人ページから質問内容の登録を行う。 会員 3 会員から質問があったことをクライアント企業管理者に メールで通知 する。 本システム 4 メールでの通知を受け、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 5 クライアント企業向け管理画面のオシゴトQ&amp;A管理ページにアクセスし、「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 クライアント企業管理者 6 質問詳細ページから、質問に対して回答者種別と質問への回答、ステータス（公開設定）を入力し保存ボタンを押下する。 「公開(質問先教室のみ)」「 公開(全教室)」以外を選択した場合はここで、オシゴト Q＆A登録・回答・公開が完了 する。 クライアント企業管理者 7 回答のステータス（公開設定）が「公開(質問先教室のみ)」「 公開(全教室)」だった場合、質問者へのメール通知可否を選択し、保存ボタンを押下する。 クライアント企業管理者 8 サービスサイト内の質問対象の求人ページに回答を表示する。 本システム 9 質問者へのメール通知可を選択した場合、質問を行なった会員に対して回答があったことをメールで通知する。 本システム 10 質問を投稿した会員がオシゴトQ＆Aの回答と公開が完了したことのメール通知を受けてサービスサイト内の 対象の求人 に本文内のURLからアクセスし、対象の求人のオシゴトQ＆A内容を確認する。 これにより、オシゴト Q＆A登録・回答・公開が完了 する。 会員 3. オシゴトQ＆A登録・回答・公開フロー(全体管理者) 内容 誰が 1 サービスサイトにログインを行う。 会員 2 質問対象の求人ページから質問内容の登録を行う。 会員 3 不定期にオシゴトQ&amp;Aの確認のため、全体管理画面にログインを行う。 全体管理者 4 全体管理画面のオシゴトQ&amp;A管理ページにアクセスし、「教室名」「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 全体管理者 5 質問詳細ページから、質問に対して回答者種別と質問への回答、ステータス（公開設定）を入力し保存ボタンを押下する。 「公開(質問先教室のみ)」「 公開(全教室)」以外を選択した場合はここで、オシゴト Q＆A登録・回答・公開が完了 する。 全体管理者 6 回答のステータス（公開設定）が「公開」だった場合、質問者へのメール通知可否を選択し、保存ボタンを押下する。 全体管理者 7 サービスサイト内の質問対象の求人ページに回答を表示する。 本システム 8 質問者へのメール通知可を選択した場合、質問を行なった会員に対して回答があったことをメールで通知する。 本システム 9 質問を投稿した会員がオシゴトQ＆Aの回答と公開が完了したことのメール通知を受けてサービスサイト内の 対象の求人 に本文内のURLからアクセスし、対象の求人のオシゴトQ＆A内容を確認する。 これにより、オシゴト Q＆A登録・回答・公開が完了 する。 会員 ※CSVダウンロード機能は管理者が公開すべき内容かのチェックをする場合に使用する。 4. オシゴトQ＆A編集フロー(クライアント企業管理者) 内容 誰が 1 既に保存済みの回答に修正が必要となった場合、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 2 クライアント企業向け管理画面のオシゴトQ&amp;A管理ページにアクセスし、「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 クライアント企業管理者 3 質問詳細ページから、回答者種別と質問への回答、ステータス（公開設定）を編集し保存ボタンを押下する。 「公開(質問先教室のみ)」「 公開(全教室)」以外を選択した場合はここで、オシゴトQ＆A編集フローが完了する。 クライアント企業管理者 4 回答のステータス（公開設定）が「公開」だった場合、質問者へのメール通知可否を選択し、保存ボタンを押下する。 クライアント企業管理者 5 ステータスが公開を選択されている時に、通知可否のチェックボックスを表示する。 通知するにチェックが入っている場合は通知メールが送り、通知するにチェックが入っていない場合は、通知メールは送らない。 本システム 6 サービスサイト内の質問対象の求人ページに回答を表示する。 本システム 7 質問を投稿した会員がオシゴトQ＆Aの回答と公開が完了したことのメール通知を受けてサービスサイト内の対象の求人に本文内のURLからアクセスし、対象の求人のオシゴトQ＆A内容を確認する。 これにより、オシゴトQ＆A編集フローが完了する。 会員 5. オシゴトQ＆A編集フロー(全体管理者) 内容 誰が 1 既に保存済みの回答に修正が必要となった場合、全体管理画面にログインを行う。 全体管理者 2 全体管理画面のオシゴトQ&amp;A管理ページにアクセスし、「教室名」「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 全体管理者 3 質問詳細ページから、回答者種別と質問への回答、ステータス（公開設定）を編集し保存ボタンを押下する。 「公開(質問先教室のみ)」「 公開(全教室)」以外を選択した場合はここで、オシゴトQ＆A編集フロー が完了 する。 全体管理者 4 回答のステータス（公開設定）が「公開」だった場合、質問者へのメール通知可否を選択し、保存ボタンを押下する。 全体管理者 5 ステータスが公開を選択されている時に、通知可否のチェックボックスを表示する。 通知するにチェックが入っている場合は通知メールが送り、通知するにチェックが入っていない場合は、通知メールは送らない。 本システム 6 サービスサイト内の質問対象の求人ページに回答を表示する。 本システム 7 質問を投稿した会員がオシゴトQ＆Aの回答と公開が完了したことのメール通知を受けてサービスサイト内の対象の求人に本文内のURLからアクセスし、対象の求人のオシゴトQ＆A内容を確認する。 これにより、オシゴトQ＆A編集フローが完了する。 会員 6. オシゴトQ＆A非公開フロー(クライアント企業管理者) 内容 誰が 1 既に保存済みの回答に非公開が必要となった場合、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 2 クライアント企業向け管理画面のオシゴトQ&amp;A管理ページにアクセスし、「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 クライアント企業管理者 3 質問詳細ページから、ステータス（公開設定）を非公開を選択し保存ボタンを押下する。 クライアント企業管理者 4 サービスサイト内の質問対象求人ページの回答を非表示にする。 ここで、オシゴトQ＆A非公開フローが完了する。 本システム 7. オシゴトQ＆A非公開フロー(全体管理者) 内容 誰が 1 既に公開済みの回答で、非公開にすべき内容がないかチェックが必要となった場合、全体管理画面にログインを行う。 ※基本的には任意の期間を空けて、該当期間分をまとめてチェックする。 全体管理者 2 全体管理画面のオシゴトQ&amp;A管理ページにアクセスし、「投稿日時」を指定し、検索を行う。 全体管理者 3 絞り込まれた結果をCSVダウンロードボタンを押下し、CSVファイルをダウンロードする。 全体管理者 4 ダウンロードしたCSVファイルを目視で確認し、非公開対象の質問を見つける 全体管理者 5 全体管理画面のオシゴトQ&amp;A管理ページにアクセスし、「教室名」「対応状況」「ステータス」を指定し検索を行なった上で対象の質問を探す。 全体管理者 6 質問詳細ページから、ステータス（公開設定）を非公開に変更し保存ボタンを押下する。 全体管理者 7 サービスサイト内の質問対象求人ページの回答を非表示にする。 オシゴトQ＆A非公開フロー が完了 する。 本システム 8. オシゴトQ＆A評価フロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674660389#%E3%82%AA%E3%82%B7%E3%82%B4%E3%83%88Q%EF%BC%86A%E7%99%BB%E9%8C%B2%E3%83%BB%E5%9B%9E%E7%AD%94%E3%83%BB%E5%85%AC%E9%96%8B%E3%83%95%E3%83%AD%E3%83%BC を経たことを前提とする。 内容 誰が 1 求人検索等のサイト回遊を行う中で、任意の求人のオシゴトQ＆A内容を確認する。 エンドユーザー 2 回答が有用に感じた場合、ログイン状態は問わず「参考になった」ボタンを押下する。 cookieによる個人特定を行っている非ログイン状態でも押せる仕様とします。cookie削除したら何回でも押せる状態にはなる。 reCAPTCHAを導入し、botの対策を行う。 本操作はログイン状態に問わず 行うことができる。 エンドユーザー 9. 帳票 【作成中】オシゴトQ＆A 【作成中】オシゴトQ＆A評価 10. 関連用語 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E7%AE%A1%E7%90%86%E8%80%85 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E5%90%91%E3%81%91%E7%AE%A1%E7%90%86%E7%94%BB%E9%9D%A2 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%A8%E3%83%B3%E3%83%89%E3%83%A6%E3%83%BC%E3%82%B6%E3%83%BC https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E3%82%B5%E3%82%A4%E3%83%88 11. メール オシゴトQ＆A質問通知メール（クライアント企業管理者宛） オシゴトQ＆A回答通知メール（会員宛） 12. 関連チケット CTJ-220 0f376871-0459-35fc-b139-2a34c915ec22 System JIRA",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674660389/FIX+Q+A",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-16T04:52:53.627Z",
  "author": "ejiri_yusuke",
  "excerpt": "1 7 1. 概要 サービスサイトに掲載されている求人に関して会員が質問を行い、それに対する回答と確認が完了するまでの流れ。 また、公開された質問および回答がエンドユーザーによって評価される流れも合わせて記載する。 ※クライアント企業管理画面/全体管理画面でできる操作は同じだが、ここでは主な業務フローを記載している 2. オシゴトQ＆A登録・回答・公開フロー(クライアント企業管理者) 内容 誰が ..."
}