{
  "id": "681214046",
  "title": "【FIX】応募情報",
  "content": "概要 会員が求人へ応募するために入力する応募情報、および、クライアント企業管理者、全体管理者が応募情報の状況を管理するために登録する採用ステータスやメモなどの管理情報。 ワークフロー 【FIX】ユーザー登録・退会フロー 【FIX】オファー・応募・選考・採用フロー 【FIX】採用お祝い/口コミ確認・公開フロー 詳細 入力項目 変数名 値の形式 制限 説明 1 応募番号 数値 自然数 本システムが自動で発行する本帳票情報で一意の連番。 2 ユーザー番号 数値 自然数 指定した番号の 【FIX】会員：アカウント情報 が存在すること。 本システムが自動で入力する応募者本人の 【FIX】会員：アカウント情報 の番号 3 求人番号 文字列 指定した番号の 【FIX】求人：基本情報 が存在すること。 本システムが応募作成時に自動で入力する 【FIX】求人：基本情報 と紐付ける 4 成果報酬商品番号 数値 指定した番号の 【FIX】商品マスタ（統合版） の「商品種別」が 「課金形態」 であること 本応募が 発生した時（応募課金）または、 採用になった時 （採用課金） に発生する成果報酬の金額を示す商品番号 応募した時点（雇用形態/短期長期でも決まるが変わる場合はあり：要検討）の、採用で発生する成果報酬の商品番号をシステムで自動で入力 対象の 【FIX】商品マスタ（統合版） は下記の順に情報を紐づけて特定する。 【FIX】求人：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室グループ 【FIX】契約情報（統合版） 【FIX】商品マスタ（統合版） 5 請求書明細番号 数値 指定した番号の 【FIX】請求：請求明細 が存在すること。 6 勤務希望：勤務可能期間 単一選択 会員が応募時に入力する 「1ヶ月以内」「3ヶ月以内」「6ヶ月以内」「6ヶ月以上」「1年未満」「1年以上 未定」から選択する。 7 質問1 応募時点での 【FIX】求人：基本情報 の質問1をコピーしてもつ。 8 塾からの質問への回答 ：質問1 文字列 1,000文字以下 会員が応募時に入力する 紐づく 【FIX】求人：基本情報 の「質問1」が登録されていない場合、登録不可能。 9 質問2 応募時点での 【FIX】求人：基本情報 の質問2をコピーしてもつ。 10 塾からの質問への回答：質問2 文字列 1,000文字以下 会員が応募時に入力する 紐づく 【FIX】求人：基本情報 の「質問2」が登録されていない場合、登録不可能。 11 質問3 応募時点での 【FIX】求人：基本情報 の質問3をコピーしてもつ。 12 塾からの質問への回答：質問3 文字列 1,000文字以下 会員が応募時に入力する 紐づく 【FIX】求人：基本情報 の「質問2」が登録されていない場合、登録不可能。 13 応募時プラン 単一選択 応募時点の求人に紐づく企業に適用されているプランを保存する。 選択肢は 【FIX】商品マスタ（統合版） の「付与プラン」と同じとする。 DBレコードを出力して分析用に使用するため、画面表示はなし。 14 急募応募 真偽値 急募対象の求人への応募かどうかを保存する。 急募対象の求人への応募の場合に「真」とする。 DBレコードを出力して分析用に使用するため、画面表示はなし。 15 オファー応募 単一選択 オファーを見て応募をしたかどうかと、そのオファーの種類を保存する。 応募時に、応募より前にオファーを受領して開封していたかどうかで判定する。 「オファーなし」「パーソナルオファー」「自動オファー」「パーソナルオファー＆自動オファー」から選択する。 16 求人群 応募時点の求人の群情報を保存する。 17 応募経路 単一選択 「応募」「応募兼会員登録」から選択する。 18 応募時会員情報 JSON 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：指導可能科目 【FIX】会員：指導経験 【FIX】会員：設定情報（オファー・メール） 【レビュー中】会員：設定情報（希望条件） を除いた の帳票の、応募時点の情報をコピーとして JSONで保存する。 19 応募時求人情報 JSON 【FIX】求人：基本情報 を含め、これ配下の各帳票の情報を、応募時点の情報をコピーとしてJSONで保存する。 20 選考状況 selection_stage 単一選択 クライアント企業管理者が入力する。 「書類選考」「一次面接」「二次面接」「最終面接」「条件面談」「内定」「入社」 から選択する 。 21 採用ステータス（会員） 単一選択 会員が入力する 「応募中」「採用」「不採用」「辞退」から選択する。 22 採用ステータス（クライアント企業） &nbsp; 単一選択 &nbsp; クライアント企業管理者が入力する。 「未登録」 「採用」 「不合格」「連絡取れず」「辞退」「欠席」「応募重複」「対象外」「保留」 から選択する 。 23 採用された教室番号 数値 自然数 応募者が採用された場合 、採用された 【FIX】教室：基本情報／所在地 の教室番号 24 面接日時 日時 25 面接日時補足 文字列 200文字以下 26 面接日リマインドメール送信日時 日時 27 採用決定日 年月日 「採用ステータス（クライアント企業）」を「採用」とした年月日が自動で設定される 28 研修初日 &nbsp; 年月日 「採用ステータス（クライアント企業）」が「採用」であること。 クライアント企業管理者が入力する研修初日の年月日 「採用ステータス」「採用」を選択したら「未定」が自動で設定される 「未定」の値は「1900/1/1」が設定される 29 研修初日回答済みフラグ 真偽値 研修初日の入力に対して回答したかどうかを保存する。（日付は設定はしていないが、「未定」含めて回答はしたという解釈） 研修初日が「未定」、「日付あり」の場合に「True」とする。 30 在籍確認 &nbsp; 単一選択 「採用ステータス（クライアント企業）」が「採用」、且つ、「研修初日」が登録されていること。 本当に採用されて在籍しているかを確認するための項目 クライアント企業管理者が入力する 「◯」「&times;： １ヶ月未満で辞退 すでに退職済み 」から選択する。 「◯」に関しては、 「研修初日」の翌月から選択可能となる。 課金形態に応じて即時、1ヶ月後の末日、3ヶ月後の末日以降に選択可能になる。 31 在籍確認：日付 年月日 「在籍確認」を「◯」と設定した年月日が自動で設定される 32 追加確認理由 単一選択 以下から選ぶ 退職日時未記入 採用お祝い不一致 応募重複確認 その他 33 提出ステータス 単一選択 未提出、提出中、差し戻し、完了の4つのステータスが存在する。 デフォルトは「未提出」とする。 34 最終提出日時 日時 提出ステータスが「提出中」になるたびに、その時間を上書きで登録・更新する。 35 提出期限 年月日 36 確認完了 真偽値 37 請求確定日 年月日 下記条件をすべて満たした場合に設定する。 ステータス：採用 研修初日が登録されている。 在籍確認：⚪︎ 38 提出期限超過月数 数値 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/744718525 で値を更新する。 39 保留月数 数値 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/744718525 で値を更新する。 40 管理者用メモ 文字列 1,000文字以下 全体管理者が編集、閲覧するメモ 41 メモ &nbsp; 文字列 1,000文字以下 採用ステータスがどの状態であれ、登録可能となる。 クライアント企業管理者が入力するこの応募に対する採用状況のメモ 42 管理者確認フラグ 真偽値 真偽値 確認完了にチェックを入れた場合にTrueを設定する 43 管理者確認日時 日時 確認完了にチェックを入れて更新した日時を挿入する 44 【作成中】帳票共通項目 で定める項目を持つ。 45 【作成中】帳票共通項目 で定める項目を持つ。 46 【作成中】帳票共通項目 で定める項目を持つ。 47 【作成中】帳票共通項目 で定める項目を持つ。 48 【作成中】帳票共通項目 で定める項目を持つ。 49 【作成中】帳票共通項目 で定める項目を持つ。 関連資料 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E5%BF%9C%E5%8B%9F%E3%83%95%E3%82%A9%E3%83%BC%E3%83%A0%E3%81%AB%E9%96%A2%E3%81%99%E3%82%8B%E8%A6%81%E6%B1%82%E4%BA%8B%E9%A0%85",
  "parentId": "698122319",
  "parentTitle": "■求人・応募・採用",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/681214046/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-04-15T01:25:54.210Z",
  "author": "ejiri_yusuke",
  "excerpt": "概要 会員が求人へ応募するために入力する応募情報、および、クライアント企業管理者、全体管理者が応募情報の状況を管理するために登録する採用ステータスやメモなどの管理情報。 ワークフロー 【FIX】ユーザー登録・退会フロー 【FIX】オファー・応募・選考・採用フロー 【FIX】採用お祝い/口コミ確認・公開フロー 詳細 入力項目 変数名 値の形式 制限 説明 1 応募番号 数値 自然数 本システムが自動..."
}