{
  "id": "681869336",
  "title": "契約更新促進メール（クライアント企業管理者宛）",
  "content": "ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー メールテンプレート 項目 内容 メール件名 【塾講師ステーション】契約更新手続きのお願い Fromアドレス メール共通要件 の定義に従う From名前 メール共通要件 の定義に従う Toアドレス 企業登録フォームで入力したメールアドレス To名前 なし Cc(カンマ区切り） なし 本文 ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 塾講師ステーション 契約更新手続きのお願い ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ※こちらのアドレスは送信専用となっております。 &lt;$ company.name $&gt; ご担当者 様 塾講師ステーション運営部です。 契約番号：$契約番号$ 契約終了日時：$契約終了日時（例：2025/4/18 00:00:00）$ &lt;$ 25日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと25日となりました。 本日より、管理画面から契約更新のお手続きが可能となります。 &lt;$ 14日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと14日となりました。 契約満了になると、求人記事の掲載が停止します。 &lt;$ 7日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと7日となりました。 契約更新のお手続きをお忘れではないでしょうか。 契約満了になると、求人記事の掲載が停止します。 &lt;$ 5日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと5日となりました。 契約満了になると、求人記事の掲載が停止します。 お手続きでお悩みのことはございませんか？ 契約更新に際して、採用活動がうまくいっていない、 塾講師ステーション機能の活用方法が分からない等、 お困りの場合には、ぜひ塾講師ステーション運営部までご相談ください。 &lt;$ 3日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと3日となっています。 契約満了になると、求人記事の掲載が停止します。 お手続きでご不明点がある場合、塾講師ステーション運営部までご連絡ください。 &lt;$ 2日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと 3日 2日 となっています。 契約満了になると、求人記事の掲載が停止します。 お手続きでご不明点がある場合、塾講師ステーション運営部までご連絡ください。 &lt;$ 1日前の場合 $&gt; 現在のアカウントの契約満了日まで、あと1日となっています。 契約満了になると、求人記事の掲載が停止します。 お手続きでご不明点がある場合、塾講師ステーション運営部までご連絡ください。 &lt;$ 0日前（＝当日）の場合 $&gt; 本日をもちまして、アカウントが契約満了となります。 契約更新 を されない場合、掲載中の求人 記事 は本日をもって掲載が停止します。 契約の継続をご希望される場合は、本日中にお手続きください。 ====================== ■契約更新をされる場合 管理画面からお手続きにお進みください。 ▼契約更新管理（塾講師ステーション管理画面） &lt;$ 契約更新管理URL $&gt; ※操作方法が不明な方：「契約更新管理マニュアル」 https://www.jukust-support.jp/?p=1092 ※要注意：契約更新申込の取り消しはできません。 最終確認の画面で、よくご確認のうえ、お手続きください。 ====================== ■契約更新を希望されない場合 契約更新画面右上の「契約更新をしない場合」ボタンから、 「更新しない」を選択してください。 &nbsp; ▼契約更新管理（塾講師ステーション管理画面） &lt;$ 契約更新管理URL $&gt; &nbsp; ※「更新しない」をご登録いただくと、塾講師ステーションから 契約更新に関するご案内は停止されます。 ※「更新しない」をご登録いただかなくても、契約は自動的に更新されませんのでご安心ください。 契約更新の実施は不要です。 そのまま契約期間満了までご利用ください。 管理画面から「更新無し」の登録をお願いいたします。 差し支えなければ、その理由もご登録ください。 今後のサービスの参考とさせていただきます。 ▼契約更新管理（塾講師ステーション管理画面） &lt;$ 契約更新管理URL $&gt; ※ 「更新無し」 をご登録いただくと、塾講師ステーションから 契約更新に関するご案内が停止されます。 ※「更新無し」を登録しなくても、自動では更新されませんのでご安心ください。 ====================== ------------ こちらのアドレスは送信専用です。本メールにご返信頂いても担当者には届きません。 ------------ 株式会社トモノカイ 塾講師ステーション運営部 ◯万が一、こちらのメールにお心当たりがない場合やご質問がある場合などは、下記までご連絡をお願いします。 ＄問い合わせ先URL＄",
  "parentId": "698351709",
  "parentTitle": "■契約・オプション",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/681869336",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-04-28T01:31:24.301Z",
  "author": "ejiri_yusuke",
  "excerpt": "ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー メールテンプレート 項目 内容 メール件名 【塾講師ステーション】契約更新手続きのお願い Fromアドレス メール共通要件 の定義に従う From名前 メール共通要件 の定義に従う Toアドレス 企業登録フォームで入力したメールアドレス To名前 なし Cc(カンマ区切り） なし 本文 ━━━━━━━━━━━━━━━━━━━..."
}