{
  "id": "685309953",
  "title": "2023-02-07 ミーティング議事録（管理画面レクチャー）",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、前橋様（営業。システム周りも） GIG： 資料 ミーティング録画 &nbsp;議題 項目 プレゼンター メモ 営業 ■新規取引の流れ 新規お問い合わせ サービスサイトの企業向けページ 問い合わせフォーム（Hubspot） Hubspotで担当営業をアサイン・管理 申込書を渡す GMOsign メールテンプレート（申込書のフォームへのURLあり） 申込書記入 GMOsign 0.【営業】申込書類受領 ◇申込書：GMOsign、PDF ◇フォーマット送付：Excel（申込書受領後に送付） （営業管理：hubspot） データを誤って削除してしまった際のバックアップとして保管している 初回のトモノカイ様側で登録を行うのは、データ作成のサービス的側面がある 申込書は新規契約時のみ 求人契約書 新規契約のみ 契約期間は3ヶ月、12ヶ月のプランと特殊なプランがある（契約更新時は複数のプランを選択可能） 鈴木さんより エクセルの入力フォーマットは、企業様の情報と、求人掲載をしたい求人の情報(教室の情報、募集要項、連絡先など)を入力して頂いてます。 初回に教室登録を行なっているのは、バックアップ情報の意味合いもありますが、求人掲載をスムーズに開始する事が可能なためです (作らないと、いつまでも掲載開始にならない企業様が割と多いため※ITリテラシーがあまり高くない方がこの業界多いです・・・) 1.【掲載】申込書類情報の社内DB、システム登録 ◇社内DB（ファイルメーカー）登録 企業・教室と、商品（例：◯ヶ月契約、プラン）の紐付けをファイルメーカーで行なっている。 ◇システム（admin管理画面）登録 ・アカウント作成 &rarr;企業管理 &rarr;企業管理内：担当者登録 &rarr;（オファー設定） &rarr;社内DBにアカウント情報転記 ※この段階ではアカウント作成は通知されず、システム外で別途連絡する 鈴木さんより なお、一番下のトモノカイ となっているアカウントはadmin専用の管理アカウントになってます(client画面のユーザー管理に表示されないアカウント) 招待メールを送信してログインを本人が行うようなフローにすることは可能か？（GIGパッケージを利用することで工数削減できる） そのようにできるとありがたいが、社内DB（ファイルメーカー）と連携していないため転機作業が必要。 ・教室・求人情報登録 &rarr;教室グループ登録（教室の屋号登録） &rarr;教室情報 新規登録 &rarr;教室情報内 求人情報登録 公開と掲載の違い 大元の教室掲載をオフにすると求人掲載もオフになる 求人の中でもこの求人だけを非掲載にしたい、という場合は求人単位でオフにすることができる 教室 非公開：サイト上の導線が消える（検索でも表示されない）が、ページ自体は閲覧できる。 非掲載：ページ自体が閲覧できなくなる。 求人 非公開：サイト上の導線が消える（検索でも表示されない）が、ページ自体は閲覧できる。 ※保護者に求人募集していることを見られたくないというニーズがある（学生講師を採用していること、人手が足りていないことなどを隠したい） 非掲載：ページ自体が閲覧できなくなる。 求人（非公開求人含む）自動送信 オファー機能：教室と送信先会員を指定して求人を送ることができる レコメンド？（非公開求人は対象外） 鈴木さんより 公開&rarr;サイト内検索でHITする 非公開&rarr;サイト内検索でHITしない ※非公開は教室のURLに直接アクセスすれば閲覧可能 基本的には「オファー」や「メルマガ」からの募集がメインとなります 2.【掲載】顧客へアカウント情報送付（メール） ◇ウェブメーラ（メールディーラー）より送付 &rarr;テンプレ有 3.【顧客】プレビューにて登録内容確認、掲載開始設定 4.【掲載】テスト応募実施、社内DBに契約登録、システム契約期間設定 ◇テスト応募 &rarr;運営部の会員アカウントでログインし応募 ◇システム（admin管理画面）設定 ・契約期間設定 &rarr;契約更新管理 &rarr;初回契約時は掲載開始月の翌月1日を契約開始日を設定しそこから3ヶ月 （契約継続時は顧客の登録した内容に準拠） その他 商品マスタ 商品マスタの情報（カラムとカラムの情報）をいただきたい 過去の商品も登録する必要があるか 必要なものだけリスト化していただく★ 商品マスタのプラン変更の頻度 不定期（多くて数年に1度くらい） 成果報酬の値上げをする、新しいオプションを作成する時など 管理画面上にマスタを設ける必要はあるか 現時点では設けた方が無難と考えているが、運用次第 請求まわりでのイレギュラー対応は請求管理側で行う（商品マスタ管理画面では対応しない） 求人 依頼されれば、管理者側でも更新を行うこともある。クライアント側でやり方が分からない、数が多くて大変、など。 大量に更新する場合は、admin画面でCSVで一括更新もできる。 （フランチャイズ契約の場合など）企業側では企業を跨いだコピーができない／管理画面側ではグループ内であればコピーが可能 請求 基本は１企業１請求 イレギュラーケース 請求用アカウント（ファイルメーカー上の管理ID）で紐付け。 契約終了時に手動で何か行うことはあるか システムで自動的に処理されるだけなので、手動で何かをやることはない。 契約終了の意思表示した企業には契約更新のリマインドメールが飛ばなくなる &nbsp;アクション事項 16 incomplete 商品マスタに関する情報提供（カラム情報／必要なレコードをリスト化して提示） false System JIRA 0f376871-0459-35fc-b139-2a34c915ec22 CTJ-227 17 complete 管理画面上にマスタの編集機能を設ける必要はあるか確認していただく false System JIRA 0f376871-0459-35fc-b139-2a34c915ec22 CTJ-228 &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 DECIDED 7113baef-b9fe-4a11-a28f-9518f6a1b72a",
  "parentId": "1235746832",
  "parentTitle": "議事録_2023年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/685309953/2023-02-07",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-03-02T08:29:39.580Z",
  "author": "ejiri_yusuke",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、前橋様（営業。システム周りも） GIG： 資料 ミーティング録画 &nbsp;議題 項目 プレゼンター メモ 営業 ■新規取引の流れ 新規お問い合わせ サービスサイトの企業向けページ 問い合わせフォーム（Hubspot） Hubspotで担当営業をアサイン・管理 申込書を渡す GMOsign メールテンプレート（申込書のフォームへのU..."
}