{
  "id": "692092953",
  "title": "【FIX】オファー履歴",
  "content": "1. 概要 クライアント企業向け管理画面にて、クライアント企業が会員に対して送信した パーソナルオファーと自動オファー の 履歴情報 。 本レコード数は、年間数十万件規模になる可能性があるので、その性能に耐えるよう設計・実装する必要がある。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 帳票 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 オファー履歴番号 offer_number 数値 自然数 新規生成時にシステムが自動で付与する連番 2 オファー履歴グループ番号 数値 自然数 指定した https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=990085121&amp;draftShareId=72df2e20-625c-400a-8861-09807d973dea が存在すること 新規生成時にシステムが自動で付与する連番 同じ送信タイミングで送信した 【FIX】オファー履歴 をグルーピングするために同じ番号を設定する。 3 企業番号 数値 自然数 指定の番号の 【FIX】企業：基本情報 が存在すること オファーを送信する企業 オファー送信時に教室情報を紐付ける。 4 教室番号 &nbsp; 数値 自然数 指定の番号の 【FIX】教室：基本情報／所在地 が存在すること オファー種別が「パーソナルオファー」の場合のみ設定 オファー対象の教室 オファー送信時に教室情報を紐付ける。 5 ユーザー番号：会員 数値 自然数 指定の番号の 【FIX】会員：アカウント情報 が存在すること オファー送信先の会員 オファー送信時に会員アカウント情報を紐付ける。 6 オファーメッセージ：テンプレート番号 数値 自然数 指定の番号の 【FIX】オファーメッセージテンプレート（パーソナルオファー） が存在すること オファー種別が「パーソナルオファー」の場合のみ設定可能 オファー送信時に使用したテンプレート情報 オファー送信時にオファーメッセージテンプレート情報を紐付ける。 7 オファーメッセージ：件名 文字列 テキストボックス 50文字以下 オファー種別が「パーソナルオファー」の場合のみ 管理画面（全体、クライアント）から設定可能 オファー種別が「自動オファー」の場合はシステムで自動で設定される。 オファー送信時のメッセージ内容 パーソナルオファーの場合： オファー送信時点の情報を 【FIX】オファーメッセージテンプレート（パーソナルオファー） からコピーして保存する。 自動オファーの場合： オファー送信時点で、送信対象者の市区町村または都道府県で募集中の求人の内、最も求人番号が若い求人に紐づく 【FIX】求人：PR情報 の「教室PRタイトル」を自動で設定する。 8 オファーメッセージ：本文：冒頭文章 文字列 テキストエリア 200文字以下 オファー種別が「パーソナルオファー」の場合のみ 管理画面（全体、クライアント）から 設定 オファー種別が「自動オファー」の場合はシステムで自動で設定される。 オファー送信時のメッセージ内容 オファー送信時点の情報を 【FIX】オファーメッセージテンプレート（パーソナルオファー） からコピーして保存する。 9 オファーメッセージ：本文：オファー内容 文字列 ー システムで自動で設定される パーソナルオファーの場合は、スカウト求人内容として記載される求人情報を、自動オファーの場合はマッチした企業として記載される企業および求人情報を保存する。 オファー送信時点の情報が自動で設定される。 10 オファーメッセージ：本文：塾からのメッセージ 文字列 テキストエリア 300文字以下 オファー種別が「パーソナルオファー」の場合のみ設定 オファー送信時のメッセージ内容 オファー送信時点の情報を 【FIX】オファーメッセージテンプレート（パーソナルオファー） からコピーして保存する。 11 対象サイト 単一選択 オファー種別が「パーソナルオファー」の場合、紐づく 【FIX】教室：基本情報／所在地 の対象サイトが自動で設定される。 オファー種別が「自動オファー」の場合は、送信時に指定した内容が設定される。 「ステーション」「キャリア」から選択する。 12 オファー 種別 単一選択 「自動オファー」「パーソナルオファー」から選択する。 13 対象求人リスト JSON ー 求人番号を自然数で指定する。 指定の番号の 【FIX】求人：基本情報 が存在すること オファー対象の求人のリスト オファー送信時に紐付ける。 オファー種別が自動オファーの場合には市区町村IDと都道府県IDも併せて保持する。（オファー後にユーザーの住所が変更になってもオファー時点と同じ情報を表示するため） 14 開封日時 日時 オファーを受信した会員がオファー閲覧ページで詳細を初めて開いたときに登録される。 15 非表示日時 日時 オファーを受信した会員が、オファー一覧で削除ボタンを押して一覧から非表示化した時に登録される。 16 【作成中】帳票共通項目 で定める項目を持つ。 17 【作成中】帳票共通項目 で定める項目を持つ。 18 【作成中】帳票共通項目 で定める項目を持つ。 19 【作成中】帳票共通項目 で定める項目を持つ。 20 【作成中】帳票共通項目 で定める項目を持つ。 21 【作成中】帳票共通項目 で定める項目を持つ。 4. 関連要件定義 本帳票が利用（作成、更新、参照、削除）される要件定義ページへのリンクです。 5. 関連チケット 本帳票の定義に関する議論や経緯を確認するためのJiraチケットへのリンクです。",
  "parentId": "698581058",
  "parentTitle": "■オファー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/692092953/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-25T08:12:21.450Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 クライアント企業向け管理画面にて、クライアント企業が会員に対して送信した パーソナルオファーと自動オファー の 履歴情報 。 本レコード数は、年間数十万件規模になる可能性があるので、その性能に耐えるよう設計・実装する必要がある。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 帳票 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレース..."
}