{
  "id": "697827329",
  "title": "【FIX】オファー設定情報（自動オファー）",
  "content": "1 7 1. 概要 クライアント企業向け管理画面にて、自動オファーの送信条件として設定したオファー設定情報。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 詳細 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 自動オファー設定情報番号 auto_offer_condition_number 数値 &nbsp; 自然数 変更不可 新規登録時に、システムで一意に発行する連番。 2 企業番号 &nbsp; 数値 自然数 指定の番号の 【FIX】企業：基本情報 が存在すること 自動オファー設定作成時に企業情報を紐付ける。 3 送信設定 &nbsp; 真偽値 ラジオボタン 自動設定を実施したい場合は「送信設定」をONにする。 4 対象サイト 単一選択 セレクトボックス 「ステーション」「キャリア」のいずれか 5 エリア１ ：都道府県 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う。 6 エリア１：市区町村 複数選択 チェックボックス 共通要件 の定義に従う。 7 エリア２ ：都道府県 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う。 8 エリア２：市区町村 複数選択 チェックボックス 共通要件 の定義に従う。 9 エリア３ ：都道府県 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う。 10 エリア３：市区町村 複数選択 チェックボックス 共通要件 の定義に従う。 11 エリア４ ：都道府県 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う。 12 エリア４：市区町村 複数選択 チェックボックス 共通要件 の定義に従う。 13 年齢：最少年齢 数値 セレクトボックス 自然数 16 ~ 70 14 年齢：最高年齢 数値 セレクトボックス 自然数 16 ~ 70 15 性別 単一選択 セレクトボックス 【FIX】会員：プロフィール情報 を参照する。 「男性」「女性」から選択する。 16 現在の職業 複数選択 チェックボックス 現在の職業 を参照する。 共通要件 の定義に従う。 17 最終ログイン日時 単一選択 セレクトボックス 「 6ヶ月以内（180日） 」「3ヶ月以内（90日）」「2ヶ月以内（60日）」「1ヶ月以内（30日）」「2週間以内（14日）」「1週間以内（7日）」から選択する。 18 大学情報：文理 単一選択 セレクトボックス 【FIX】会員：学歴情報 を参照する。 「文系」「理系」「その他」から選択する。 19 大学情報：入試区分 単一選択 セレクトボックス 【FIX】会員：学歴情報 を参照する。 「一般入試」「指定校推薦」「一般推薦」「AO受験」「その他」から選択する。 20 大学情報：所在地 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う 21 大学情報：学校名 文字列 テキストボックス 50文字以下 共通要件 の定義に従う 単一指定 22 大学情報：学年 複数選択 チェックボックス 【FIX】会員：学歴情報 を参照する。 「学部1年生」「学部2年生」「学部3年生」「学部4年生」「学部5年生」「学部6年生」「修士1年生」「修士2年生」「博士1年生」「博士2年生」「博士3年生」「中退」「卒業」から選択する。 23 学歴：その他：高校受験経験 真偽値 チェックボックス 24 学歴：その他：中学受験経験 真偽値 チェックボックス 25 指導可能科目：小学生 複数選択 チェックボックス 指導可能科目 を参照する。 26 指導可能科目：中学生 複数選択 チェックボックス 指導可能科目 を参照する。 27 指導可能科目：高校生 複数選択 チェックボックス 指導可能科目 を参照する。 28 指導可能科目：その他 複数選択 チェックボックス 指導可能科目 を参照する。 29 【作成中】帳票共通項目 で定める項目を持つ。 30 【作成中】帳票共通項目 で定める項目を持つ。 31 【作成中】帳票共通項目 で定める項目を持つ。 32 【作成中】帳票共通項目 で定める項目を持つ。 33 【作成中】帳票共通項目 で定める項目を持つ。 34 【作成中】帳票共通項目 で定める項目を持つ。 4. 関連要件定義 本帳票が利用（作成、更新、参照、削除）される要件定義ページへのリンクです。 5. 関連チケット 本帳票の定義に関する議論や経緯を確認するためのJiraチケットへのリンクです。",
  "parentId": "698581058",
  "parentTitle": "■オファー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/697827329/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-26T05:22:14.754Z",
  "author": "ejiri_yusuke",
  "excerpt": "1 7 1. 概要 クライアント企業向け管理画面にて、自動オファーの送信条件として設定したオファー設定情報。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 詳細 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 自動オファー設定情報番号 auto_offer_condition_number 数値 &nbsp; 自然数 変更不可..."
}