{
  "id": "703824108",
  "title": "681_【FIX】クライアント企業ログイン・ログアウト機能",
  "content": "1. 目次 2. 概要 クライアント企業管理者が、クライアント企業管理画面にログイン/ログアウトするための機能。 3. 要求事項 ログイン機能 メールアドレス、パスワード、企業コードを入力し登録済み情報と一致すれば、ログインに成功し、クライアント企業管理画面のTOPページへ遷移する。 「パスワードを忘れた」ボタンを押下すると 682_【FIX】パスワード再設定機能 に遷移する。 メールアドレス、パスワードの入力・登録規制は 【FIX】クライアント企業管理者 に記載の内容 に準ずる。 メールアドレスやパスワード、企業コードの入力値に誤りがあった場合、エラーメッセージに具体的な箇所や内容は表示せず、メールアドレス、パスワード、企業コードに何らかの誤りがある旨のみを表示する。（攻撃者にヒントを与えないための対応） 一定回数パスワードを間違えてログインに失敗したら、対象のメールアドレスで作成されているアカウントはログインできないようにする。これをアカウントロック機能と呼ぶ。 アカウントロックが発生するログイン失敗回数は、10回以上とする。 アカウントがロックされてから30分経過するとロックは自動的に解除される。 ロックされているアカウントでパスワード再設定機能（ 682_【FIX】パスワード再設定機能 ）を利用してパスワードをリセットした場合は、対象のアカウントのロック状態を解除する。 アカウントがロックされたことを攻撃者にはわからないようにするため、アカウントがロックされた旨のエラーメッセージは画面に表示しない。 アカウントがロックされたことを、アカウント所持者に メール （ 【FIX】クライアント企業管理者アカウントロック通知メール（クライアント企業管理者宛） ）で通知する。 アカウントがロックされた場合、以下の情報が入ったログを出力する。 日時、メールアドレスの冒頭3文字、アクセス元IPアドレス、ユーザーエージェント、アクション（ロック） ログインセッションの有効期限は最終操作から1週間とする。ログインセッションが切れた状態でマイページ内の操作を行なった場合、ログイン画面に遷移し再度ログインを求める。ログイン不要なページ内での操作を行なった場合、ログアウト状態の表示に切り替え、画面遷移は行わない。 クライアント企業管理者がログインに成功または失敗した場合、以下の情報が入ったログを出力する。 成功時：日時、クライアント企業管理者のユーザー番号、企業コード、アクセス元IPアドレス、ユーザーエージェント 失敗時：日時、メールアドレスの冒頭3文字、アクセス元IPアドレス、ユーザーエージェント ログアウト機能 クライアント企業管理画面にログインしているクライアント企業管理者が、ヘッダーのアカウント名（名前）を押下して表示されるログアウトメニューをクリックすることで、ログアウトすることができる。 複数のブラウザや端末でログインしている状態で、1つのブラウザや端末でログアウトした場合、他のブラウザ・端末でもログアウトされる。 ログアウト後はログインページへ遷移する。 3.1. 権限 クライアント企業管理画面にログインすることができるクライアント企業管理者のみが、本機能を利用することができる。 3.2. 帳票 680_■アカウント管理機能 の記載に従う。 3.3. メールテンプレート 【FIX】クライアント企業管理者アカウントロック通知メール（クライアント企業管理者宛） 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース （画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=31408-46388&amp;mode=design&amp;t=kRlT0eE26KNe9wyP-4 4.2. 入力 4.2.1. ログイン 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 メールアドレス email 入力フォーム 必須 2 パスワード password 入力フォーム 必須 3 企業コード 入力フォーム 必須 4 ログイン失敗回数 &nbsp; キャッシュ 5 アカウントロックするログイン失敗回数 &nbsp; 設定ファイル 設定ファイルに記述した、アカウントロックする場合のログイン失敗回数。 設定可能な値は1-100の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を10として処理する。 &nbsp; 6 アカウントロック継続時間 &nbsp; 設定ファイル 設定ファイルに記述した、アカウントロックの継続時間（分）。 設定可能な値は1-1440の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を30として処理する。 4.2.2. ログアウト 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 クライアント企業担当者のユーザー番号：クライアント企業管理者 データベース 認証アカウントを基に、クライアント企業管理者テーブルから取得する 必須 4.3. 出力 4.3.1. ログイン 出力項目 出力先 説明 1 アカウントロック通知 メール 入力で取得したログイン失敗回数が、アカウントロックするログイン失敗回数に達していた場合に、アカウントロック通知メールテンプレートを元に必要な変数を差込変換して送信する。 2 ログイン失敗回数 データベース ログインに成功した場合は何もしない。 ログインに失敗した場合、 ログイン失敗回数の保存時間内であれば、入力で取得したログイン失敗回数を１増加して保存する。 ログイン失敗回数の保存時間をすぎていた場合は1にして保存する。 4.3.2. ログアウト 出力項目 出力先 説明 1 セッション情報 データベース 該当ユーザのセッション情報を破棄し、全ての端末をログアウト状態にする。 4.4. 処理 4.4.1. ログイン処理 設定ファイルから、入力欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703824108#4.2.1.-%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3 ）で入力元が設定ファイルと定められている項目を取得し、値が取得できなかった場合、もしくは、値が不正だった場合はデフォルト値を利用するようにする。 入力されたアカウントのレコードを取得する。 アカウントが存在しなかった場合、メールアドレス、パスワード、企業コードに何らかの誤りがある旨のみを表示する。（攻撃者にヒントを与えないための対応） 対象のアカウントのログイン失敗回数をキャッシュから取得する。キャッシュが存在しなかった場合は、ログイン失敗回数を0とみなして以降の処理を継続する。 対象レコードのログイン失敗回数の最終更新日時が存在する場合に、ログイン失敗回数の保存時間の時間内であり、かつ、アカウントロックするログイン失敗回数に達していたら、以下のログイン処理をスキップしログインフォームを表示する。 対象のメールアドレスおよび企業コードのアカウントに設定されたパスワードと照合する。 パスワードが一致した場合は、以下の処理を行い、ログイン完了し、ログイン後ページに遷移する。 対象アカウントの最終ログイン日時をデータベースに保存する。 ログイン失敗回数のキャッシュが存在する場合、キャッシュを削除する。 パスワードが一致しなかった場合、以下3つのいずれかの処理を行う。 ログイン失敗回数のキャッシュが存在しない場合は、失敗回数を1としてキャッシュを作成する。 ログイン失敗回数のキャッシュが存在する場合、ログイン失敗回数を１増加してキャッシュに保存する。ログイン失敗回数の増加した結果の値が、アカウントロックするログイン失敗回数に達していた場合は、該当ユーザのセッション情報を破棄してログアウトし、アカウントロック通知（ 【FIX】クライアント企業管理者アカウントロック通知メール（クライアント企業管理者宛） ）を送信する。 パスワードが一致しなかった場合、エラーメッセージとともにログインフォームを表示する。 4.4.2. ログアウト処理 ログイン済みでないクライアント企業管理者はログイン画面に遷移する。 認証トークンを基にログイン済みのクライアント企業管理者のユーザー番号を取得する。 クライアント企業管理者のユーザー番号を基にセッションテーブルから該当ユーザーのセッション情報を破棄して他のブラウザ・端末でもログアウトし、ログイン画面に遷移する。 4.5. エラー処理 アカウントが存在しなかった場合、攻撃者にはわからないようにするためメールアドレス、パスワード、企業コードに何らかの誤りがある旨のみのエラーメッセージを表示する。 アカウントがロックされたことを攻撃者にはわからないようにするため、アカウントがロックされた旨のエラーメッセージは画面に表示しない。 ログイン失敗回数の更新に失敗した場合のエラー及び例外はハンドリングしない。Laravelのエラー・例外処理に任せる。 設定ファイルが存在しない、データベースにテーブル・フィールドが存在しない、メールテンプレートファイルが存在しない場合はプログラム上で特別な処理を行わず、Laravelの例外出力に任せる。 4.6. ログ 4.6.1. ログイン ログインに成功した場合に下記フォーマットでログ出力を実行する。 User {クライアント企業担当者のユーザー番号：クライアント企業管理者} logged in. company_number={企業番号} company_code={企業コード} {日時} {アクセス元IPアドレス} {ユーザーエージェント} ログインに失敗した場合に下記フォーマットでログ出力を実行する。 User {匿名化したメールアドレス} failed to log in. company_number={企業番号} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 4.6.2. ログアウト ログアウトに成功した場合に下記フォーマットでログ出力を実行する。 User {クライアント企業担当者のユーザー番号：クライアント企業管理者} logged out. company_number={企業番号} company_code={企業コード} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 4.6.3. アカウントロック アカウントロックが発生した場合に、下記フォーマットでログを出力する。 User {クライアント企業担当者のユーザー番号：クライアント企業管理者} has locked, as the user failed to login {ログイン失敗回数} times. company_number={企業番号} company_code={企業コード} {日時} {アクセス元IPアドレス} {ユーザーエージェント} アカウントロックされたメールアドレスでログインしようとした場合に、下記フォーマットでログを出力する。 Locked user {クライアント企業担当者のユーザー番号：クライアント企業管理者} failed to log in. company_number={企業番号} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 ログイン時の2要素認証は行わない。（ CTJ-1091 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） SNSやシングルサインオン（SSO）など外部ツールによるログイン認証は行わない。 アカウントロック機能 アカウントロックの時間・回数についてはクライアント企業管理画面から設定変更できない。 アカウントがロックされているかどうかをクライアント企業管理画面で確認できる機能は提供しない。 ユーザーを指定してアカウントロックをクライアント企業管理画面から解除できる機能は提供しない。 ログイン・ログアウトに成功した際、登録されているメールアドレスに通知は行わない。 関連チケット CTJ-1091 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "720699991",
  "parentTitle": "680_■アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/703824108/681_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-25T09:52:52.347Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 クライアント企業管理者が、クライアント企業管理画面にログイン/ログアウトするための機能。 3. 要求事項 ログイン機能 メールアドレス、パスワード、企業コードを入力し登録済み情報と一致すれば、ログインに成功し、クライアント企業管理画面のTOPページへ遷移する。 「パスワードを忘れた」ボタンを押下すると 682_【FIX】パスワード再設定機能 に遷移する。 メールアドレス、パ..."
}