{
  "id": "703889475",
  "title": "042_【FIX】会員ログイン・ログアウト機能",
  "content": "1. 目次 2. 概要 会員がサービスサイトにて ログイン、ログアウト を行うための機能です。 3. 要求事項 3.1.1. ログイン機能 メールアドレスとパスワードを入力し、登録済み情報と一致すればログインすることができる。 メールアドレスの入力規制は 共通要件 に記載の内容に準ずる。 パスワードは以下の入力規制を設ける。 8文字以上50 文字以下であること。（セキュリティの観点からログイン時の入力は文字数チェックだけとし、 書式チェックは行わない。 ） 入力可能な文字種は、 共通要件 に記載の内容に準ずる。 メールアドレスやパスワードの入力値に誤りがあった場合、エラーメッセージに具体的な箇所や内容は表示せず、メールアドレスかパスワードに何らかの誤りがある旨のみを表示する。（攻撃者にヒントを与えないための対応） 一定回数パスワードを間違えてログインに失敗したら、対象のメールアドレスで作成されているアカウントはログインできないようにする。これをアカウントロック機能と呼ぶ。 アカウントロックが発生するログイン失敗回数は、10回以上とする。 アカウントがロックされてから30分経過するとロックは自動的に解除される。 ロックされているアカウントで https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703594590 を利用してパスワードをリセットした場合は、対象のアカウントのロック状態を解除する。 アカウントがロックされたことを攻撃者にはわからないようにするため、アカウントがロックされた旨の エラーメッセージは画面に表示しない。 アカウントがロックされたことを、 アカウント所持者に 【FIX】アカウントロック通知メール（会員宛） を送信する。 送信したメールは、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704545131 で管理できるよう、送信履歴として保存する。 アカウントがロックされた場合、以下の情報が入ったログを出力する。 日時、メールアドレスの冒頭3文字、アクセス元IPアドレス、ユーザーエージェント ログインセッションの有効期限は最終操作から1週間とする。ログインセッションが切れた状態でマイページ内の操作を行なった場合、ログイン画面に遷移し再度ログインを求める。ログイン不要なページ内での操作を行なった場合、ログアウト状態の表示に切り替え、画面遷移は行わない。 画面内にはパスワードお忘れの方はこちら」ボタンを設置し、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703594590 に遷移する、また「初めてご利用になる方はこちら」ボタンを設置し https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/702906392 に遷移する。 会員がログインに成功した場合、条件に応じて下記の通りの処理を行う。条件判定は上から優先的に判定されて処理されるものとする。 応募兼会員登録画面（ 014-1_【FIX】求人応募兼会員登録機能 ）の「会員の方はこちら」ボタンを押下して本画面（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703889475 ）に遷移してきていた場合 遷移元と同じ求人に対する応募ページ（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703463606 ）に遷移する。 「学年更新ステータス」が「2」の場合 プロフィール編集画面の学歴情報タブ（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/832929990/043_1?atlOrigin=eyJpIjoiYTUxNzQ3ZDJhMTcxNGJlMmE2MDYzZDMwMDAzMThlOTkiLCJwIjoiYyJ9 ）へリダイレクトする。 会員がログインに成功または失敗した場合、以下の情報が入ったログを出力する。 成功時：日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント 失敗時：日時、メールアドレスの冒頭3文字、アクセス元IPアドレス、ユーザーエージェント 3.1.2. ログアウト機能 会員向け画面にログインしている会員が、 SPではハンバーガーメニュー内 、PCはヘッダー内にあるログアウトボタンを クリック することで、ログアウトすることができる。 ログアウト後はトップページへ遷移する。 会員がログアウトに成功または失敗した場合、以下の情報が入ったログを出力する。 成功時：日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント 失敗時：日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 サービスサイトにログインできる会員のみ。 3.2. 帳票 【FIX】会員：アカウント情報 3.3. メールテンプレート 【FIX】アカウントロック通知メール（会員宛） 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. ログイン画面（PC） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=3376-34389&amp;mode=design&amp;t=VTu5IRcFTbHUXT8V-4 4.1.2. ログアウト画面（ハンバーガーメニュー）（SP） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=4590-59243&amp;mode=design&amp;t=ryYPSZK7zU6NGoSq-4 4.1.3. ログアウト画面（共通ヘッダー）（PC） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=4590-59242&amp;mode=design&amp;t=ryYPSZK7zU6NGoSq-4 4.2. 入力 変数名、説明、バリデーションは、 【FIX】会員：アカウント情報 の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. ログイン機能 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 メールアドレス フォーム ユーザが登録したメールアドレス 必須 2 パスワード フォーム ユーザ固有のパスワード文字列 必須 3 アカウントロック通知メールテンプレート &nbsp; ファイル アカウントロックが発生した時のみ、ファイルから取得する。 【FIX】アカウントロック通知メール（会員宛） とする。 文字列長及び書式チェックはプログラムにおいては行わない。メールに記載する内容は、本表以下に記載する。 &nbsp; 4 ログイン失敗回数 &nbsp; キャッシュ 対象アカウントの1時間以内のログイン失敗回数をキャッシュから取得する。 &nbsp; 5 アカウントロックするログイン失敗回数 &nbsp; 設定ファイル 設定ファイルに記述した、アカウントロックする場合のログイン失敗回数。 設定可能な値は1-100の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を10として処理する。 &nbsp; 6 アカウントロック継続時間 &nbsp; 設定ファイル 設定ファイルに記述した、アカウントロックの継続時間（分）。 設定可能な値は1-1440の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、 デフォルト値を15 として処理する。 &nbsp; 4.2.2. ログアウト機能 1 入力項目 変数名 入力方式 説明 バリデーション 2 認証トークン &nbsp; Cookie Laravelの機能に準拠 &nbsp; 4.3. 出力 変数名、説明、バリデーションは、 【FIX】会員：アカウント情報 の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. ログイン機能 4.3.1.1. 画面表示処理 出力項目 出力先 説明 1 メールアドレス 画面 ログイン失敗時やエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力。 2 パスワード 画面 ログイン失敗時やエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力。 4.3.1.2. アカウントロック処理 出力項目 出力先 説明 1 アカウントロック通知 メール 入力で取得したログイン失敗回数が、アカウントロックするログイン失敗回数に達していた場合に 【FIX】アカウントロック通知メール（会員宛） を元に必要な変数を差込変換して送信する。 2 氏名 メール アカウントロック対象のユーザの氏名をデータベースから取り出し出力する。 3 ログイン失敗回数 データベース ログインに成功した場合は何もしない。 ログインに失敗した場合、 ログイン失敗回数の保存時間内であれば、入力で取得したログイン失敗回数を１増加して保存する。 ログイン失敗回数の保存時間をすぎていた場合は1にして保存する。 4 セッション情報 データベース アカウントロックが発生した場合、 該当ユーザの該当端末のセッション情報を破棄し、 ログアウト状態にする。 4.3.2. ログアウト機能 1 出力項目 出力方式 説明 2 セッション情報 データベース ログアウト処理が実行された場合、 該当ユーザの該当端末のセッション情報を破棄し、 ログアウト状態にする。 4.4. 処理 4.4.1. ログイン処理 設定ファイルから、入力欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703889475#4.2.1.-%E3%83%AD%E3%82%B0%E3%82%A4%E3%83%B3%E6%A9%9F%E8%83%BD ）で入力元が設定ファイルと定められている項目を取得し、値が取得できなかった場合、もしくは、値が不正だった場合はデフォルト値を利用するようにする。 入力されたアカウントのレコードを取得する。 アカウントが存在しなかった場合、メールアドレスかパスワードに何らかの誤りがある旨のみを表示する。（攻撃者にヒントを与えないための対応） 対象のアカウントのログイン失敗回数をキャッシュから取得する。キャッシュが存在しなかった場合は、ログイン失敗回数を0とみなして以降の処理を継続する。 対象レコードのログイン失敗回数の最終更新日時が存在する場合に、ログイン失敗回数の保存時間の時間内であり、かつ、アカウントロックするログイン失敗回数に達していたら、以下のログイン処理をスキップしログインフォームを表示する。 対象のメールアドレスのアカウントに設定されたパスワードと照合する。 パスワードが一致した場合は、以下の処理を行い、ログイン完了し、ログイン後ページに遷移する。 対象アカウントの最終ログイン日時をデータベースに保存する。 ログイン失敗回数のキャッシュが存在する場合、キャッシュを削除する。 パスワードが一致しなかった場合、以下3つのいずれかの処理を行う。 ログイン失敗回数のキャッシュが存在しない場合は、失敗回数を1としてキャッシュを作成する。 ログイン失敗回数のキャッシュが存在する場合、ログイン失敗回数を１増加してキャッシュに保存する。ログイン失敗回数の増加した結果の値が、アカウントロックするログイン失敗回数に達していた場合は、該当ユーザのセッション情報を破棄してログアウトし、アカウントロック通知（ 【FIX】アカウントロック通知メール（会員宛） ）を送信する。 パスワードが一致しなかった場合、エラーメッセージとともにログインフォームを表示する。 4.4.2. ログアウト処理 ログイン済みでない会員はログイン画面に遷移する。 認証トークンを基にログイン済みの会員のユーザー番号を取得する。 会員のユーザー番号を基にセッションテーブルから該当ユーザーのセッション情報を破棄して他のブラウザ・端末でもログアウトし、ログイン画面に遷移する。 4.5. エラー処理 アカウントが存在しなかった場合、攻撃者にはわからないようにするためメールアドレスかパスワードに何らかの誤りがある旨のみのエラーメッセージを表示する。 アカウントがロックされたことを攻撃者にはわからないようにするため、アカウントがロックされた旨のエラーメッセージは画面に表示しない。 ログイン失敗回数の更新に失敗した場合のエラー及び例外はハンドリングしない。Laravelのエラー・例外処理に任せる。 設定ファイルが存在しない、データベースにテーブル・フィールドが存在しない、メールテンプレートファイルが存在しない場合はプログラム上で特別な処理を行わず、Laravelの例外出力に任せる。 4.6. ログ 4.6.1. ログイン ログインに成功した場合に下記フォーマットでログ出力を実行する。 User {ユーザー番号} logged in. {日時} {アクセス元IPアドレス} {ユーザーエージェント} ログインに失敗した場合に下記フォーマットでログ出力を実行する。 User {匿名化したメールアドレス} failed to log in {日時} {アクセス元IPアドレス} {ユーザーエージェント} 4.6.2. アカウントロック アカウントロックが発生した場合に、下記フォーマットでログを出力する。 User {ユーザー番号} has been locked, as the user failed to login {ログイン失敗回数} times. {日時} {アクセス元IPアドレス} {ユーザーエージェント} アカウントロックされたメールアドレスでログインしようとした場合に、下記フォーマットでログを出力する。 Locked user {ユーザー番号} failed to log in. {日時} {アクセス元IPアドレス} {ユーザーエージェント} 4.6.3. ログアウト ログアウトに成功した場合に下記フォーマットでログ出力を実行する。 User {ユーザー番号} logged out. {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 ログイン時の二段階認証は行わない。（ CTJ-1091 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） SNSやシングルサインオン（SSO）など外部ツールによるログイン認証は行わない。 会員アカウントロック機能 アカウントロックの時間・回数については管理画面から設定変更できない。 アカウントがロックされているかどうかを管理画面で確認できる機能は提供しない。 会員を指定してアカウントロックを管理画面から解除できる機能は提供しない。 ログイン・ログアウトに成功した際、登録されているメールアドレスに通知を行わない。 1つの端末でログアウトした場合でも、他でログインしている端末からはログアウトしない。",
  "parentId": "721289315",
  "parentTitle": "040_■アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/703889475/042_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-03-31T05:20:16.470Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 会員がサービスサイトにて ログイン、ログアウト を行うための機能です。 3. 要求事項 3.1.1. ログイン機能 メールアドレスとパスワードを入力し、登録済み情報と一致すればログインすることができる。 メールアドレスの入力規制は 共通要件 に記載の内容に準ずる。 パスワードは以下の入力規制を設ける。 8文字以上50 文字以下であること。（セキュリティの観点からログイン時の..."
}