{
  "id": "704053518",
  "title": "168_【FIX】教室コピー機能",
  "content": "目次 概要 本機能はある教室の 【FIX】教室：基本情報／所在地 の一部、および 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 、また 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の登録済みのデータ他の教室にコピーする ための機能 です。 なお全体管理画面から利用する場合と企業管理画面から利用する場合とは基本的に同じ挙動とし、まとめて 本ドキュメント で定義する。 要求事項 全体管理画面から本機能を使用する場合は、全体管理画面にログインすることができる システム管理者、塾講師ステーション管理者、ゲスト管理者 が利用できる。 企業管理画面から本機能を使用する場合は、企業管理画面にログインできるクライアント企業管理者のみが利用できる。 ある教室の 【FIX】教室：基本情報／所在地 の一部、および 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 、また 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 について、以下の条件で別の教室にコピーすることができる。 全体管理画面では全ての教室について、企業、教室グループを跨いでコピーできる。 企業管理画面では、同一企業内の教室について、教室グループを跨いでコピーできる。 ただしサービス種別を跨いだ コピーは実行できない 。 求人のコピーについては、コピー元教室の方が求人数が多い場合はコピー先の教室のすべての求人を上書きするとともに足りない分を新規作成する。 逆にコピー元教室の方が求人数が少ない場合は コピー先の教室の求人のうち求人番号がより小さいものに 対して上書きする。 必須項目が未入力の教室を「公開中・掲載中」の教室にコピーした場合は教室の掲載設定を「公開／非掲載」とし、必須項目が未入力の求人をコピーした場合は求人の掲載設定を「非掲載」とする。 本機能は2ステップから構成され、それぞれのステップにページを設ける。またステップの表示を各ページ上に表示し、現在どちらのステップにいるか強調して表示する。 ステップ1 画面上では次のように操作を進めることができる。 企業を選択するコンボボックスで企業を選択する、または教室グループを選択するコンボボックスで教室グループを選択する。 企業選択コンボボックス の仕様は次の通りとする。 選択肢の名称は「企業番号_企業名」とする。 企業を選択するコンボボックスは全体管理画面でのみ表示する。 教室グループ選択コンボボックスの仕様は次の通りとする。 選択肢の名称は「教室グループ番号_教室グループ名」とする。 全体管理画面では、企業選択コンボボックスで企業が選ばれていない場合はすべての教室グループが選択肢となり、企業を選んだ場合はその企業に紐づく教室グループが選択肢となる。 クライアント企業管理画面の場合は 自らの企業に属する教室グループのみが選択肢となる。 コピー元の教室を選択する コンボボックスで教室を選択する。 選択肢の名称は「教室番号_教室名」とする。 デフォルトでは全ての教室を選択肢とする。 企業を選択するコンボボックスで企業を選択すると、その企業に属する すべての教室が選択肢となる。 教室グループを選択するコンボボックスで教室グループを選択すると、その教室グループに属する すべての教室が選択肢となる。 企業選択コンボボックスと教室グループ選択コンボボックスが両方選択された場合は重ねてフィルターをかける。 クライアント管理サイトではサイドメニューのほか、 501_【FIX】教室一覧閲覧機能 で 教室レコードから「複製」を押下することで、教室を選択した状態でこの画面に遷移することができる。その場合、教室グループと教室のセレクトボックスには、選択された教室に対応する内容を表示する。 教室を選択すると、その教室の教室情報、求人情報を項目ごとに選択するパーツを表示する。 教室情報、求人情報1〜3をすべてまとめてチェックするためのチェックボックスを用意する 教室情報、求人情報1〜3のそれぞれについて、各情報をまとめてチェックするためのチェックボックスを用意する 教室情報、求人情報1〜3のそれぞれの中の個別の情報グループについても、各情報をまとめてチェックするためのチェックボックスを用意する。 例えば教室情報の中でも、「応募情報転送先／応募後連絡先情報をすべてチェックする」など 保存されている項目は、テキストで保存されているデータはHTMLエスケープをして、項目値で保存されているデータは対応する値を表示する。画像もそのまま表示する。 全体管理画面のみでしか表示しない項目は、クライアント管理画面では表示しない。 値が登録されていない項目の表示も省略せず、値には空白を表示し項目名とセットで表示する。 各項目にはチェックボックスをつけ、チェックした項目をステップ2でコピーする。 表示、選択可能な項目は以下とする。 教室情報 基本情報 教室名 教室名カナ ホームページ アクセス方法 管理メモ1 管理メモ2 応募情報転送先／応募後連絡先 各項目については 163_【FIX】教室情報編集機能 の出力を参照。 塾チャート 各項目については 163_【FIX】教室情報編集機能 の出力を参照。 画像 各項目については 163_【FIX】教室情報編集機能 の出力を参照。 求人情報（1〜3について内容は同じ） 基本情報 各項目については 173_【FIX】求人情報編集機能（基本情報タブ） の出力を参照。 ただし以下の項目はコピーしない。 企業名 教室グループ 教室名 求人番号 群 表示順 勤務条件・指導科目 各項目については 173_1【FIX】求人情報編集機能（勤務条件・指導科目タブ） の出力を参照。 応募条件・研修情報 各項目については 173_2【FIX】求人情報編集機能（応募条件・研修情報タブ） の出力を参照。 応募情報等 各項目については 173_3【FIX】求人情報編集機能（応募情報等タブ） の出力を参照。 PR情報 各項目については 173_4【FIX】求人情報編集機能（PR情報タブ） の出力を参照。 キャンセルボタンを押下すると編集を取り消し、 161_【FIX】教室一覧閲覧機能 に遷移する。 「コピー先の教室を選ぶ」 ボタン を押下すると、入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければステップ2に遷移する。 ステップ2 一覧ページ上部には、一覧フィルター用コンポーネント、表示可能なレコードの総数を表示する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 作成日時の降順で表示し、並べ替えを行うことはできなくて良い。 クライアント管理画面ではコピー元の教室の企業名は表示しない。 一覧フィルター用コンポーネントの表示項目はWFの通りで、全てAND結合とする。特記すべき内容のみ下に記入する。 企業番号／企業名 コンボボックスとする 全体管理画面でのみ表示し、クライアント管理画面では表示しない。 教室グループ名 コンボボックスとする 教室番号 コンマ区切りで、複数検索できるようにする。 管理メモ1 検索ボタン 押下しフィルターしても検索結果が1件もなかった場合は、「該当する教室が見つかりませんでした」と表示する。 「全てチェック」を押下するとフィルターされているすべての教室をチェックし選択する。 一覧の各レコードに表示する項目はWFを参照し、特記すべき内容のみ本ドキュメントに記載する。 企業名 企業番号と企業名を連結する。 戻るボタンを押下するとステップ1の画面に戻る。 「コピーする」ボタン を押下すると、 「教室コピーを実行しますか？」というコピー処理確認モーダルを表示する。キャンセルボタンを押下すると処理をせずモーダルを閉じる。 「実行する」ボタンを押すと 、ステップ1で選択した項目の値を、ステップ2でチェックし選択したすべての教室に対して 登録する。 ステップ1で選択した項目の値が空白だった場合、コピー先でも空白値を登録する。 コピー先の教室にすでに値が登録されていた場合は上書きで登録する。 教室プランおよび プラン優先度 は、コピー先の教室に紐づく契約に基づいて設定する。 コピー元教室の方が求人数が多い場合はコピー先の教室のすべての求人を上書きするとともに足りない分を新規作成する。 その際、新規作成のために必要な情報は、仮にコピー元項目を選ぶ際にその項目にチェックが入ってなくても、強制的にその値でコピーする。 画像コピー処理は、処理負荷を考慮しバックエンドジョブにて非同期で実行する。 コピー対象に画像が含まれている状態でコピー先教室が101件以上選択されている場合は、コピー処理は実行されず、「コピー対象に画像が選択されている場合、一度にコピーできるデータは100件が上限です。恐れ入りますが対象を減らして再度お試しください。※画像を含まない場合コピー件数に制限はございません。」の内容のモーダルを表示する。閉じるボタンを押下すると処理をせずモーダルを閉じる。 すべてのコピー処理が正常に完了した場合 全体管理画面からコピー機能を実行 全体管理画面からコピー機能を実行した全体管理者に対して教室コピー完了通知メールを送信する（該当企業のクライアント企業管理者には送信しない）。コピー処理中にエラーが発生した場合は、「教室コピーエラー通知メール」を同様に実行者へ送信する。 クライアント企業(向け)管理画面からコピー機能を実行 クライアント企業(向け)管理画面からコピー機能を実行したクライアント企業管理者に対して教室コピー完了通知メールを送信する。コピー処理中にエラーが発生した場合は、「教室コピーエラー通知メール」を同様に実行者へ送信する。 入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければそのまま編集した入力フォームの内容をデータベースに保存し、システム全体に適用し、 「コピーが完了しました。」 「※画像はコピー実行完了後（数分後）に反映いたします。」 と表示された編集完了のポップアップを表示する。 保存が完了したら エリア平均給与算出共通処理 を実行する。 編集完了のポップアップで閉じるボタンを押下すると全体管理画面では 161_【FIX】教室一覧閲覧機能 に、 クライアント管理画面では 501_【FIX】教室一覧閲覧機能 に遷移する。 編集で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者番号、企業番号（クライアント管理画面からの操作の場合）、コピー元教室番号、コピー元求人番号、コピー先教室番号、コピー先求人番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 権限 要求に同じ。 帳票 要求および概要に同じ。 メールテンプレート なし ワークフロー なし 要件定義 ユーザーインターフェース（画面） ステップ1：教室・求人選択画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=10106-63839&amp;mode=design&amp;t=ViV9xfqERzD2H5Tp-4 ステップ2：コピー先教室先選択画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=10106-63848&amp;mode=design&amp;t=ViV9xfqERzD2H5Tp-4 入力 出力 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 XXX処理 処理の詳細説明です。 YYY処理 処理の詳細説明です。 エラー処理 処理を実施した際に行うエラー処理です ログ コピー画面に遷移した場合、下記フォーマットでログを出力する User {全体管理者のユーザー番号} started to copy classroom. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} コピー処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {全体管理者のユーザー番号} copied classroom. classroom_number_copied_from={コピー元の教室番号} job_numbers_copied_from={コピー元の求人番号} classroom_number_copied_to={コピー先の教室番号} job_numbers_copied_to={コピー先の求人番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {全体管理者のユーザー番号} failed to copy classroom. classroom_number_copied_from={コピー元の教室番号} job_numbers_copied_from={コピー元の求人番号} classroom_number_copied_to={コピー先の教室番号} job_numbers_copied_to={コピー先の求人番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "704053435",
  "parentTitle": "160_【FIX】教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704053518/168_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-09T05:10:51.464Z",
  "author": "isamu saito",
  "excerpt": "目次 概要 本機能はある教室の 【FIX】教室：基本情報／所在地 の一部、および 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 、また 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の登録済みのデータ他の教室にコピーす..."
}