{
  "id": "704053511",
  "title": "166_【FIX】教室一括更新機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 とそれに紐づく 【FIX】求人：基本情報 の掲載フラグを編集できる。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者が利用することができる。 161_【FIX】教室一覧閲覧機能 の「一括更新設定はコチラ」を押下すると、一括更新をする 企業の選択画面 に遷移する。 一覧フィルターは 特に指定がない限り 161_【FIX】教室一覧閲覧機能 と同じとする。 教室グループ、教室、都道府県は複数指定可のコンボボックスとする。 最低賃金エラーありが選択された場合、最低賃金の条件を満たしていない求人が紐づく教室を抽出する。 満たすべき最低賃金の条件は、 172_【FIX】求人情報新規作成機能 の通りとする。 ページネーションはなしとする。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 「全てチェック」を押下すると全てのレコードにチェックを入れる。 一覧レコードの表示項目はWFを参照する。 有効な急募契約 がある場合は 終了日 を表示し、ない場合は空白とする。 画面表示時点で掲載状態のものは（掲載中）と表示する。 キャリア求人のレコードは赤色にする。 「全てチェック」を押下すると全てのレコードにチェックを入れる。 「全てチェック」を押下すると2ページ目以降のデータを含めたフィルターされているすべての教室をチェックし選択する。 もう一度「全てチェック」を押下するとすべてのレコードからチェックを外す。 キャンセル するボタンを押下すると 161_【FIX】教室一覧閲覧機能 へ戻る。 更新するボタンを押下すると、掲載状況のチェックボックスのチェック内容を 【FIX】教室：基本情報／所在地 および 【FIX】求人：基本情報 の掲載フラグに反映する。 入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければそのまま編集した入力フォームの内容をデータベースに保存し、システム全体に適用し、「掲載設定を更新しました」という編集完了のポップアップを表示する。 編集完了のポップアップには閉じるボタンを配置し、押下すると 161_【FIX】教室一覧閲覧機能 に遷移する。 保存が完了したら エリア平均給与算出共通処理 を実行する。 編集で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、全体管理者のユーザー番号、教室番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 3.2. 帳票 3.3. メールテンプレート なし 3.4. ワークフロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=150939-95122&amp;mode=design&amp;t=qiHIj8mwrjZ0Wo9n-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 更新画面を表示した場合に下記フォーマットでログを出力する。 User {全体管理者のユーザー番号} started to update classroom and job publication flags. company_name ={企業名} classroom_group_name={教室グループ名} classroom_name={教室名} site ={サービス種別} prefecture={都道府県} publication_setting={掲載設定} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 更新処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {全体管理者のユーザー番号} updated classroom and job publication flags. published_classroom_numbers={掲載された教室番号} unpublished_classroom_numbers={非掲載にされた教室番号} {URI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {全体管理者のユーザー番号} failed to update classroom and job publication flags. {URI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項",
  "parentId": "704053435",
  "parentTitle": "160_【FIX】教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704053511/166_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-22T01:41:36.722Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 とそれに紐づく 【FIX】求人：基本情報 の掲載フラグを編集できる。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者が利用することができる。 161_【FIX】教室一覧閲覧機能 の「一括更新設定はコチラ」を押下すると、一括更新をする 企業の選択画面 に遷移する。 一覧フ..."
}