{
  "id": "704053700",
  "title": "433_【作成中】会員情報詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：指導可能科目 【FIX】会員：指導経験 【レビュー中】会員：設定情報（オファー・メール） 【レビュー中】会員：設定情報（希望条件） の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが利用することができる。 本機能は概要に記載の全ての項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目 なお指導経験と希望勤務地は登録されているものを全て表示する。 編集ボタン 押下することで 434_【FIX】会員情報編集機能 に遷移することができる。 一覧に戻るボタン 押下することで 431_【FIX】会員情報一覧閲覧・検索機能 に遷移することができる。 存在しない会員情報が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入った ログを出力する 。 日時、管理者ID、閲覧するユーザー番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 要求事項の記載に同じ。 3.2. 帳票 概要の記載に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=70753-97625&amp;mode=design&amp;t=r5Rp0Y8XOS9C2Zue-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ ユーザー番号 URLパラメータ 閲覧する会員を一意に指定するためのID 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 ユーザー番号 画面 適切にHTMLエスケープ処理をして出力する。 会員ID 画面 適切にHTMLエスケープ処理をして出力する。 会員ステータス 画面 保存された値が指し示す選択肢のラベルを出力する。 氏名 画面 姓名を全角スペースで結合し、適切にHTMLエスケープ処理をして出力する。 フリガナ 画面 姓名を全角スペースで結合し、適切にHTMLエスケープ処理をして出力する。 メールアドレス 画面 適切にHTMLエスケープ処理をして出力する。 性別 画面 保存された値が指し示す選択肢のラベルを出力する。 生年月日 画面 「YYYY年MM月DD日」形式の文字列で出力する。 郵便番号 画面 適切にHTMLエスケープ処理をして出力する。 都道府県 画面 保存された値が指し示す選択肢のラベルを出力する。 市区町村 画面 保存された値が指し示す選択肢のラベルを出力する。 電話番号 画面 適切にHTMLエスケープ処理をして出力する。 現在の職業 画面 保存された値が指し示す選択肢のラベルを出力する。 最寄り駅 画面 保存された値が指し示す選択肢のラベルを出力する。 最終学歴 画面 保存された値が指し示す選択肢のラベルを出力する。 職歴・自己PR（応募時の情報のみ利用） 画面 入力された改行を維持したまま表示されるように適切にHTMLエスケープ処理をして出力する。 管理メモ 画面 入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 学校種 画面 保存された値が指し示す選択肢のラベルを出力する。 所在地：都道府県 画面 保存された値が指し示す選択肢のラベルを出力する。 所在地：国名 画面 保存された値が指し示す選択肢のラベルを出力する。 学校名 画面 適切にHTMLエスケープ処理をして出力する。 入試区分 画面 保存された値が指し示す選択肢のラベルを出力する。 学部名 画面 適切にHTMLエスケープ処理をして出力する。 学科名（研究室・講座） 画面 適切にHTMLエスケープ処理をして出力する。 文理 画面 保存された値が指し示す選択肢のラベルを出力する。 学年 画面 保存された値が指し示す選択肢のラベルを出力する。 区分 画面 保存された値が指し示す選択肢のラベルを出力する。 入学年月 画面 保存された値が指し示す選択肢のラベルを出力する。 卒業年 画面 保存された値が指し示す選択肢のラベルを出力する。 受験経験：中学 画面 保存された値が指し示す選択肢のラベルを出力する。 受験経験：高校 画面 保存された値が指し示す選択肢のラベルを出力する。 指導可能科目 画面 保存された値が指し示す選択肢のラベルを出力する。 指導経験（家庭教師を含む） 画面 保存された値が指し示す選択肢のラベルを出力する。 指導学年 画面 保存された値が指し示す選択肢のラベルを出力する。指導経歴が複数登録されている場合は、各項目名の後に「（1）」などと番号をつける。 指導形態 画面 保存された値が指し示す選択肢のラベルを出力する。指導経歴が複数登録されている場合は、各項目名の後に「（1）」などと番号をつける。 指導年数 画面 保存された値が指し示す選択肢のラベルを出力する。指導経歴が複数登録されている場合は、各項目名の後に「（1）」などと番号をつける。 スカウト利用 画面 保存された値が指し示す選択肢のラベルを出力する。 マッチ利用 画面 保存された値が指し示す選択肢のラベルを出力する。 メール受信フラグ：スカウト通知 画面 保存された値が指し示す選択肢のラベルを出力する。 メール受信フラグ：マッチ通知 画面 保存された値が指し示す選択肢のラベルを出力する。 メール受信フラグ：メルマガ購読 画面 保存された値が指し示す選択肢のラベルを出力する。 メール受信フラグ：お知らせ通知 画面 保存された値が指し示す選択肢のラベルを出力する。 希望条件設定番号 画面 適切にHTMLエスケープ処理をして出力する。 希望雇用形態 画面 保存された複数の値が指し示す選択肢のラベルを全て出力する。 希望職種 画面 保存された複数の値が指し示す選択肢のラベルを全て出力する。 希望勤務地：都道府県 画面 保存された値が指し示す選択肢のラベルを出力する。希望勤務地が複数登録されている場合は、それぞれの項目名の中に「（1）」など番号を表示する。 希望勤務地：市区町村 画面 保存された値が指し示す選択肢のラベルを出力する。希望勤務地が複数登録されている場合は、それぞれの項目名の中に「（1）」など番号を表示する。 勤務可能期間 画面 保存された値が指し示す選択肢のラベルを出力する。 登録日時 画面 YYYY/MM/DD H:i:s形式の文字列で出力する。 最終ログイン日時 画面 YYYY/MM/DD H:i:s形式の文字列で出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 URL文字列から入力された会員番号文字列を取得し、会員番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 ユーザー番号文字列を元にデータベースから概要に記載の帳票のデータを取得する。対象の会員番号のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象のユーザーデータが存在したら、「出力」の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read user detail. user_number={ユーザー番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 特になし",
  "parentId": "704479585",
  "parentTitle": "430_【作成中】会員管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704053700/433_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-06-12T06:57:13.743Z",
  "author": "kotake_jin",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：指導可能科目 【FIX】会員：指導経験 【レビュー中】会員：設定情報（オファー・メール） 【レビュー中】会員：設定情報（希望条件） の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管..."
}