{
  "id": "704249930",
  "title": "134_【FIX】企業担当者情報編集機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け の登録済みのデータ1件を編集するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 登録されている 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け 1件の登録済み情報を閲覧し、本ページの 「要件定義」-「入力」 欄で入力元が「入力フォーム」と定義されている項目を編集することができる。 画面上には以下の項目を表示する 本ページの 「要件定義」-「入力」 欄で入力元が「入力フォーム」と定義されている項目 本ページの 「要件定義」-「出力」 欄で出力先として「画面」が定義されている項目 キャンセルボタン 更新ボタン キャンセルボタンを押下すると編集を取り消し、 133_【FIX】企業担当者詳細閲覧機能 に遷移する。 更新ボタンを押下すると、入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければそのまま編集した入力フォームの内容をデータベースに保存し、システム全体に適用し、編集完了のポップアップを表示する。 編集完了のポップアップには以下の内容を表示する 。 編集対象のクライアント企業管理者のユーザー番号 編集対象のクライアント企業管理者の氏名 閉じるボタン 押下すると 133_【FIX】企業担当者詳細閲覧機能 に遷移する。 編集で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、クライアント企業管理者ID( 【FIX】クライアント企業管理者 のユーザー番号：クライアント企業管理者)、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ 3.2. 帳票 130_【FIX】企業担当者管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 130_【FIX】企業担当者管理機能 の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース （画面） 4.1.1. 編集画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=5044-60939&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.1.2. 編集完了を知らせるポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=5044-60982&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限 ユーザー番号：クライアント企業管理者 入力フォーム 隠しフォーム 編集する対象のクライアント企業管理者の 【FIX】クライアント企業管理者 におけるユーザー番号：クライアント企業管理者 必須 企業番号 入力フォーム 隠しフォーム 編集する対象のクライアント企業管理者の、現在表示している企業との 【FIX】クライアント企業管理者-企業紐付け における企業番号 氏名 入力フォーム 初期状態：データベースから読み込んだ値 必須 担当者電話番号 入力フォーム 初期状態：データベースから読み込んだ値 必須 掲載担当 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 採用確認担当 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 請求担当 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 対象の企業管理者が その企業で唯一の請求担当である場合 、ここが偽だとエラーとする。 有効フラグ 入力フォーム 初期状態：データベースから読み込んだ値 対象の企業管理者がその企業で唯一の請求担当である場合、ここが偽だとエラーとする。 管理者フラグ 入力フォーム 初期状態：データベースから読み込んだ値 1つの企業には、管理者フラグがOFFの請求担当を１人以上登録する必要がある 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 出力先 説明 1 ユーザー番号：クライアント企業管理者 画面 HTMLエスケープ処理をして出力する。 2 氏名 データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 3 メールアドレス データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 担当者電話番号 データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 5 掲載担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 6 採用確認担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 7 請求担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 8 有効フラグ データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 9 管理者フラグ データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 10 更新者 データベース 【作成中】帳票共通項目 に従う。 11 更新 日時 データベース 【作成中】帳票共通項目 に従う。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 隠しフォーム入力からユーザー番号：クライアント企業管理者の文字列を取得し、入力がない場合/自然数ではない場合はレスポンスステータス404 not foundを出力して処理を終了する。 指定されたユーザー番号：クライアント企業管理者 および企業番号 で データベースから該当するレコードを抽出する 。 該当するレコードがデータベース上に存在しない場合はレスポンスステータス404 not foundを出力して処理を終了する。 4.4.1. 編集フォーム画面表示処理 該当するレコードが見つかったら、 「出力」 （ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704249930#4.3.-%E5%87%BA%E5%8A%9B ） に記載の通り、表示項目と入力可能項目に項目値を反映させて画面を出力し処理を終了する。 4.4.2. 編集処理 該当するレコードが見つかったら、「入力」（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704249930#4.2.-%E5%85%A5%E5%8A%9B ） に記載の入力項目値の妥当性検査を行う。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で編集フォーム画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、更新日時を操作している現在時刻とし、操作を行なっている全体管理者のユーザー番号を更新者に設定した上でデータベースの該当レコードを更新する。 該当のレコードの保存した情報を閲覧できる 133_【FIX】企業担当者詳細閲覧機能 へリダイレクトし処理を終了する。 4.5. エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 編集画面に遷移した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} started to update company_user . user_number ={ユーザー番号：クライアント企業管理者} company_number={企業番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 編集処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {全体管理者のユーザー番号} updated company_user . user_number ={ユーザー番号：クライアント企業管理者} company_number={企業番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {全体管理者のユーザー番号} failed to update company_user . user_number ={ユーザー番号：クライアント企業管理者} company_number={企業番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた 131_【FIX】企業担当者一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "704544810",
  "parentTitle": "130_【FIX】企業担当者管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704249930/134_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-11-22T02:14:06.104Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け の登録済みのデータ1件を編集するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 登録されている 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け..."
}