{
  "id": "704348167",
  "title": "044_【FIX】メールアドレス変更機能",
  "content": "1. 目次 2. 概要 会員がサービスサイトにて登録されているメールアドレスを変更するための機能です。 3. 要求事項 サービスサイトにログインしている会員が、メールアドレス設定画面で新たに設定したいメールアドレスを入力し、変更するボタンを押下する。 各種設定ページに戻るボタン を押下すると 055_【FIX】各種設定 ページ に戻る 。 登録するメールアドレスは以下の登録規制を設ける。 他の会員のメールアドレスとして登録されているメールアドレスには変更できない。 ただし管理者アカウントとして登録されているメールアドレスには変更できる。 その他の規制は 共通要件 に記載の内容に準ずる。 変更するボタンを押下すると、入力項目に問題なければメール送信完了画面へ遷移する。問題があればエラーメッセージが表示され、遷移はしない。 新たに設定したメールアドレス宛に、 【作成中】メールアドレス変更リクエストメール（会員宛） を送信する。そのURLからメールアドレス設定完了画面に遷移することで、メールアドレスの変更が完了する。 再設定用URLの有効期限は24時間とする。有効期限を超過したURLは無効とする。 一度再設定が完了したURLは無効となる。 同一メールアドレス宛に再設定用URLを2通以上送信した場合は、最新のURLのみを有効として、それ以外のURLは無効とする。 無効となった再設定用URLにアクセスした場合、ステータス404（Page Not Found）のページを表示する。 メールアドレス変更完了ページには、 042_【FIX】会員ログイン・ログアウト機能 に 遷移するため のボタンを配置する 。 001_全体トップ へ遷移するためのボタンを設置する。 会員がメールアドレス変更のためにメール送信に成功した場合、以下の情報が入ったログを出力する。 日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント 会員がメールアドレス変更に成功した場合、以下の情報が入ったログを出力する。 日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 サービスサイトにログインできる会員のみ。 3.2. 帳票 【FIX】会員：アカウント情報 3.3. メールテンプレート 【作成中】メールアドレス変更リクエストメール（会員宛） 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. メールアドレス入力画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=3342-34117&amp;mode=design&amp;t=CcnftQwJyKMG32wj-4 4.1.2. メール送信完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=56415-61557&amp;mode=design&amp;t=dLxt39Xr7E0Ucb54-4 4.1.3. メールアドレス変更完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=45537-4024&amp;mode=design&amp;t=n7R1T5wUBcwfRoU4-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 メールアドレス &nbsp; 入力フォーム 初期値なし 必須 他の会員のメールアドレスとして登録されているメールアドレスには変更できない 共通要件 に従う。 2 メールアドレス再設定用メール ファイル メールアドレス変更フォームでバリデーションチェックに問題がない時にのみ、ファイルから取得する。Laravelのメールテンプレートの書式とする。 文字列長及び書式チェックはプログラムにおいては行わない。メールに記載する内容は、 【作成中】メールアドレス変更リクエストメール（会員宛） に記載する。 3 登録認証用のtoken有効期限 設定ファイル 設定ファイルに記述した、tokenの有効期限（分）。 設定可能な値は1-1440の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を60として処理する。 &nbsp; 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 トークン データベース バリデーションに問題がない場合のみ、生成されるトークン。メールアドレス変更用テーブルに保存される。 バリデーションに問題があった場合はなにもしない。 2 メールアドレス データベース バリデーションに問題がない場合のみ、メールアドレス変更用のテーブルに保存する。 バリデーションに問題があった場合はなにもしない。 3 メールアドレス再設定用メール メール バリデーションに問題がない場合のみ、 【作成中】メールアドレス変更リクエストメール（会員宛） を元に必要な変数を差込変換して送信する。 4.4. 処理 ログイン済みでないユーザーはログイン画面に遷移する。 4.4.1. メールアドレス変更メール送信処理 セッションIDを基にログイン済みのユーザー番号を取得する。 入力されたメールアドレスが存在するかレコードを確認する。 アカウントが存在した場合、以降のステップをスキップしエラーメッセージを表示する。 入力されたメールアドレスでメールアドレス変更用レコードが存在する場合、ランダムな文字列のtokenを発行し、入力されたメールアドレス、token、ユーザーID、更新時間を招待用のデータベースに上書き保存する。 入力されたメールアドレスでメールアドレス変更用レコードが存在しない場合、ランダムな文字列のtokenを発行し、入力されたメールアドレス、token、ユーザーID、更新時間を招待用のデータベースに登録する。 ステップ4 or 5で作成されたtoken、対象アカウントのメールアドレスを基にURLを作成し対象アカウントのメールにURLを記載してメールアドレス変更メールを送信する。 送信完了ページを表示する。 4.4.2. メールアドレス変更処理 設定ファイルから、トークンの有効期限を取得し、値が取得できなかった場合、もしくは、値が不正だった場合はデフォルト値を利用するようにする。 URLパラメーターからトークンを取得する。以下の場合は404ステータスを返却しNot Foundページを表示する。 トークンが入力されていない、 入力されたトークンで招待レコードが存在しない 存在はするがメールアドレス変更用テーブルの更新時間が設定ファイルから取得した有効期限を上回っている メールアドレス変更用テーブルにレコードが存在する場合、メールアドレス変更用テーブルを基にメールアドレスを変更する。 URLにアクセスしたタイミングで未ログイン、ログイン済み問わず、メールアドレス変更完了画面に遷移する。 4.5. エラー処理 設定ファイルが存在しない、データベースにテーブル・フィールドが存在しない、メールテンプレートファイルが存在しない場合はプログラム上で特別な処理を行わず、Laravelの例外出力に任せる。 4.6. ログ ユーザーがメールアドレス変更のためにメール送信に成功した場合、以下の情報が入ったログを出力する。 User {ユーザー番号} sent an email to update its email address. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} ユーザーがメールアドレス更新に成功または失敗した場合、以下の情報が入ったログを出力する。 成功時 User {ユーザー番号} updated its email address. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗時 User {ユーザー番号} failed to update its email address. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "721289315",
  "parentTitle": "040_■アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704348167/044_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-02-01T11:06:43.541Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 会員がサービスサイトにて登録されているメールアドレスを変更するための機能です。 3. 要求事項 サービスサイトにログインしている会員が、メールアドレス設定画面で新たに設定したいメールアドレスを入力し、変更するボタンを押下する。 各種設定ページに戻るボタン を押下すると 055_【FIX】各種設定 ページ に戻る 。 登録するメールアドレスは以下の登録規制を設ける。 他の会員..."
}