{
  "id": "704479462",
  "title": "252_【FIX】採用お祝い金申請2nd詳細閲覧・編集機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【レビュー中】採用お祝い申請 のうち、お祝い③（お祝い2nd）について 登録済みのデータ1件 およびそれに紐づく 【レビュー中】お祝い申請：質問・回答 、また 【レビュー中】採用お祝い申請 に紐づく 【作成中】口コミグループ 1件とそれに紐づく 【作成中】口コミ の登録済みのデータ1件 を閲覧 ・編集 するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 本機能は概要に記載の全ての項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 一覧に戻るボタン 押下すると 241_【FIX】採用お祝い申請一覧閲覧機能 に遷移する。 採用確認詳細ボタン 押下すると該当の お祝い金申請で絞り込ん だ 231_【FIX】採用確認一覧閲覧機能 に遷移する。 採用お祝い金申請1st詳細へボタン 押下すると該当の応募に対する 242_【FIX】採用お祝い申請詳細閲覧・編集機能 に遷移する。 Amazonギフト券情報詳細ボタン 【レビュー中】採用お祝い申請 に紐づく 【FIX】Amazonギフト券情報 が存在する場合にテキストリンクを表示する。押下すると該当の 263_【FIX】Amazonギフト券管理-詳細閲覧機能 に遷移する。 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目 キャンセルボタン 押下することで編集を取り消し、 231_【FIX】採用確認一覧閲覧機能 に遷移する。 更新するボタン 更新するボタンを押下すると、入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければそのまま編集した入力フォームの内容をデータベースに保存し、システム全体に適用し、編集完了のポップアップを表示する。ポップアップの文言は「採用お祝い申請情報を更新しました。」とする。 編集完了のポップアップの閉じるボタンを押下すると 231_【FIX】採用確認一覧閲覧機能 に遷移する。 存在しないお祝い金申請が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入ったログを出力する。 日時、管理者ユーザー番号、採用お祝い申請番号(対応する帳票の〇〇番号)、アクセス元IPアドレス、ユーザーエージェント 詳細・閲覧ページで更新した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、採用お祝い申請番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 要求定義の通り。 3.2. 帳票 概要の通り。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 4. 要件定義 4.1. ユーザーインターフェース （画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=56619-24237&amp;mode=design&amp;t=HEdINJ6iD83ceAEU-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 採用お祝い申請番号 &nbsp; URLパラメータ 閲覧する採用お祝い申請を一意に指定するためのID 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 承認状況 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 選択肢は 【レビュー中】採用お祝い申請 に従う。 &nbsp; 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 投稿日時 画面 日時のフォーマットで表示する。 応募詳細のテキストリンクを押下すると該当の 213_【FIX】応募編集・詳細閲覧機能 へ遷移する。 教室名 画面 適切にHTMLエスケープ処理をして出力する。 テキストリンクとし、押下すると 163_【FIX】教室情報編集機能 へ遷移する。 氏名とフリガナ 画面 漢字とフリガナの姓名を適切にHTMLエスケープ処理をして出力する。 テキストリンクとし、押下すると 433_【作成中】会員情報詳細閲覧機能 に遷移する。 現在の就業状況 画面 保存された値が指し示す選択肢のラベルを出力する。 平均勤務日数 画面 保存された値が指し示す選択肢のラベルを出力する。 就業期間 画面 保存された値が指し示す選択肢のラベルを出力する。 退社理由 画面 適切にHTMLエスケープ処理をして出力する。 月額の平均給与（講習時除く） 画面 保存された値が指し示す選択肢のラベルを出力する。 主な指導学年 画面 保存された値が指し示す選択肢のラベルを出力する。 指導科目 画面 保存された値が指し示す選択肢のラベルを全て出力する。複数ある場合は「、」区切りとする。 勤務満足度（給料） 画面 保存された値が指し示す選択肢のラベルを出力する。 勤務満足度（給料コメント） 画面 適切にHTMLエスケープ処理をして出力する。 勤務満足度（人間関係・上司） 画面 保存された値が指し示す選択肢のラベルを出力する。 勤務満足度（人間関係・上司コメント） 画面 適切にHTMLエスケープ処理をして出力する。 勤務満足度（人間関係・同僚） 画面 保存された値が指し示す選択肢のラベルを出力する。 勤務満足度（人間関係・同僚コメント） 画面 適切にHTMLエスケープ処理をして出力する。 勤務満足度（システム） 画面 保存された値が指し示す選択肢のラベルを出力する。 勤務満足度（システムコメント） 画面 適切にHTMLエスケープ処理をして出力する。 プライベートとの両立 画面 保存された値が指し示す選択肢のラベルを出力する。 プライベートとの両立（コメント） 画面 適切にHTMLエスケープ処理をして出力する。 授業外業務の給与について 画面 保存された値が指し示す選択肢のラベルを出力する。 自分が成長できたこと 画面 適切にHTMLエスケープ処理をして出力する。 塾講師のやりがい 画面 適切にHTMLエスケープ処理をして出力する。 他の人に紹介したいか 画面 保存された値が指し示す選択肢のラベルを出力する。 他の人に紹介したいか（その理由をお書きください） 画面 適切にHTMLエスケープ処理をして出力する。 承認状況 画面/データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 URL文字列から入力された採用お祝い申請番号文字列を取得し、採用お祝い申請番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 採用お祝い申請番号文字列を元にデータベースから各帳票情報を取得する。対象の採用お祝い申請のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の企業データが存在したら、出力の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.4.1. 編集フォーム画面表示処理 該当するレコードが見つかったら、「出力」 に記載の通り、表示項目と入力可能項目に項目値を反映させて画面を出力し処理を終了する。 4.4.2. 編集処理 該当するレコードが見つかったら、「入力」に記載の入力項目値の妥当性検査を行う。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で編集フォーム画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、更新日時を操作している現在時刻とし、操作を行なっている全体管理者のユーザー番号を更新者に設定した上でデータベースの該当レコードを更新する。 該当のレコードの保存した情報を閲覧できる 231_【FIX】採用確認一覧閲覧機能 へリダイレクトし処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read gift request detail. gift_request_number={採用お祝い申請番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 編集した場合に下記フォーマットでログを出力する 成功した時 User {ユーザー番号} updated gift request. gift_request_number={採用お祝い申請番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した時 User {ユーザー番号} failed to update gift request. gift_request_number={採用お祝い申請番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 特になし",
  "parentId": "703856825",
  "parentTitle": "250_■お祝い金申請管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704479462/252_+FIX+2nd",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-26T09:34:17.109Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【レビュー中】採用お祝い申請 のうち、お祝い③（お祝い2nd）について 登録済みのデータ1件 およびそれに紐づく 【レビュー中】お祝い申請：質問・回答 、また 【レビュー中】採用お祝い申請 に紐づく 【作成中】口コミグループ 1件とそれに紐づく 【作成中】口コミ の登録済みのデータ1件 を閲覧 ・編集 するための機能です。..."
}