{
  "id": "704676285",
  "title": "100_【FIX】商品管理機能",
  "content": "1. 目次 2. 概要 本機能は、本システムにおいて、 クライアント企業とサイト運営者 の間で交わされる契約において紐づけられる商品（またはサービス）の情報を管理するための機能です。 【FIX】商品マスタ（統合版） のデータに対する基本的な一覧閲覧、レコード新規作成、1レコードごとの詳細閲覧、編集する機能を提供します。 本機能は下記のサブ機能で構成されます。 true 3. 要求事項 3.1. 権限 本機能にアクセスして操作を行えるのは システム管理者、塾ステーション管理者 のみとします。 3.2. 帳票 本機能で管理する帳票は下記とします。 【FIX】商品マスタ（統合版） 3.3. メールテンプレート なし 3.4. ワークフロー 3.4.1. 本機能 【FIX】商品登録・購入不可化フロー 3.4.2. 関連機能 対象帳票の紐付け https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674496542#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E5%A5%91%E7%B4%84%E3%83%BB%E7%99%BB%E9%8C%B2%E3%83%95%E3%83%AD%E3%83%BC https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674431004#%E6%80%A5%E5%8B%9F%E3%82%AA%E3%83%97%E3%82%B7%E3%83%A7%E3%83%B3%E7%94%B3%E8%BE%BC%E3%83%BB%E7%99%BB%E9%8C%B2%E3%83%95%E3%83%AD%E3%83%BC https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674496542#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E5%A5%91%E7%B4%84%E6%9B%B4%E6%96%B0%E3%83%BB%E7%B5%82%E4%BA%86%E3%83%95%E3%83%AD%E3%83%BC 対象帳票の参照 【作成中】契約関連全体フロー 配下全てのフロー 4. 要件定義 4.1. 本機能配下の基本要件 本機能においては商品情報データの 物理削除 は一切おこないません。 4.1.1. 共通入力・読み込み 本機能の配下において下記項目を必ず入力ないし設定ファイルから取得する。 項目名 変数名 入力元 説明 バリデーション 税区分選択肢 tax_types 設定ファイル 設定ファイルから「税区分」の選択肢の配列を取得する。 必要に応じて「税区分」のセレクトボックスに表示する。 必要に応じて「税区分」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 商品種別選択肢 service_types 設定ファイル 設定ファイルから「商品種別」の選択肢の配列を取得する。 必要に応じて「商品種別」のセレクトボックスに表示する。 必要に応じて「商品種別」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 課金形態種別選択肢 billing_types 設定ファイル 設定ファイルから「課金形態種別」の選択肢の配列を取得する。 必要に応じて「課金形態種別」のセレクトボックスに表示する。 必要に応じて「課金形態種別」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 オプション種別選択肢 option_types 設定ファイル 設定ファイルから「オプション種別」の選択肢の配列を取得する。 必要に応じて「オプション種別」のセレクトボックスに表示する。 必要に応じて「オプション種別」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 採用課金：雇用形態選択肢 employment_types 設定ファイル 設定ファイルから「採用課金：雇用形態」の選択肢の配列を取得する。 必要に応じて「採用課金：雇用形態」のセレクトボックスに表示する。 必要に応じて「採用課金：雇用形態」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 対象サイト選択肢 services 設定ファイル 設定ファイルから「対象サイト」の選択肢の配列を取得する。 必要に応じて「対象サイト」のセレクトボックスに表示する。 必要に応じて「対象サイト」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 付与プラン選択肢 plans 設定ファイル 設定ファイルから「付与プラン」の選択肢の配列を取得する。 必要に応じて「付与プラン」のセレクトボックスに表示する。 必要に応じて「付与プラン」の値表示に利用する。 設定が正しく行われていることを前提とし妥当性検査は行わない。 4.1.2. 共通出力 本機能の配下において 下記項目を必ず ユーザーに表示できる形式で出力する。 出力項目 出力先 説明 税区分選択肢 ページ 設定ファイルから取得した値をページ上において「税区分」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 商品種別選択肢 ページ 設定ファイルから取得した値をページ上において「商品種別」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 課金形態種別選択肢 ページ 設定ファイルから取得した値をページ上において「課金形態種別」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 オプション種別選択肢 ページ 設定ファイルから取得した値をページ上において「オプション種別」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 採用課金：雇用形態選択肢 ページ 設定ファイルから取得した値をページ上において「採用課金：雇用形態」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 対象サイト選択肢 ページ 設定ファイルから取得した値をページ上において「対象サイト」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 付与プラン 選択肢 ページ 設定ファイルから取得した値をページ上において「付与プラン」セレクトボックスの選択肢として、ないしは選択肢ラベルを表示するために利用する。 5. スコープ外及び制限事項 本機能において、商品情報データの一括出力、一括登録、一括変更、一括削除機能は提供しません。 本機能において、変更・削除した商品情報と契約の紐付けを自動で紐付け変える機能は提供しません。 商品情報データの登録上限数は削除済みを含めて1,000件までとし、これを超える場合は何らかのメンテナンスまたは追加対応が必要になるものとします。 6. 関連チケット CTJ-1009 0f376871-0459-35fc-b139-2a34c915ec22 System JIRA",
  "parentId": "666927305",
  "parentTitle": "■全体管理画面",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704676285/100_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-07-18T07:06:51.154Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は、本システムにおいて、 クライアント企業とサイト運営者 の間で交わされる契約において紐づけられる商品（またはサービス）の情報を管理するための機能です。 【FIX】商品マスタ（統合版） のデータに対する基本的な一覧閲覧、レコード新規作成、1レコードごとの詳細閲覧、編集する機能を提供します。 本機能は下記のサブ機能で構成されます。 true 3. 要求事項 3.1. 権..."
}