{
  "id": "704774279",
  "title": "391_【不要のため削除】問い合わせ一覧閲覧機能",
  "content": "目次 概要 本機能は 【作成中】問合せ の登録済みのデータの一覧を閲覧するための機能です。 要求事項 管理画面にログインできる全体管理者のみが、登録されている 【作成中】問合せ のデータを一覧で閲覧することができる。 １ページあたりの表示数を 50件 とし、表示対象のレコードが51件以上の場合は、 ページネーション (ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い 。 一覧フィルター用コンポーネントの表示項目 は下記の通り で、全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 問い合わせ者種別 セレクトボックス。「すべて」「クライアント」「ユーザー」を選択肢に表示し、初期状態は「すべて」が選択されているものとする。 氏名・担当者名 1行のテキストボックス。表示し初期状態は何も入力されていないものとする。 氏名または担当者名の部分一致検索にてフィルタリングを実行するものとする。 メールアドレス 1行のテキストボックス。表示し初期状態は何も入力されていないものとする。 メールアドレスの部分一致検索にてフィルタリングを実行するものとする。 問い合わせ種別 セレクトボックス。表示し初期状態は何も入力されていないものとする。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/680558793?NO_SSR=1 の帳票で定義されている、事前に定められた問い合わせ種別の選択肢をオプションとする。その際、ユーザーからのお問い合わせテーブルに紐づくオプションは「ユーザー：問い合わせ種別名」、クライアントからのお問い合わせテーブルに紐づくオプションは「クライアント：問い合わせ種別名」とする(現行のシステムと同じ)。 問い合わせ日 年月日単位で期間を指定し検索ボタンを押下することで、指定した期間で絞り込みを行い、一覧を取得することができる。 年の指定はセレクトボックス方式とする。 必須項目とする。 選択肢は2010年〜現在年とする。 表示順は年の降順とする。 初期表示は何も入力されていないものとする。 月の指定はセレクトボックス方式とする。 必須項目とする。 選択肢は1~12月とする。 表示順は月の昇順とする。 初期表示は何も入力されていないものとする。 月の指定はセレクトボックス方式とする。 必須項目とする。 選択肢は1~その年月の最終日とし、昇順とする。 表示順は日の昇順とする。 初期表示は何も入力されていないものとする。 絞り込み ボタン。押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、検索結果がありませんでした、と表示する。 一覧の各レコード には、登録されている問い合わせ情報の、以下情報、および詳細表示ボタンを表示する。 問合せ者種別 クライアント企業からの問い合わせの場合は「クライアント」、エンドユーザーからの問い合わせの場合は「ユーザー」と表示する。 問い合わせ日時 データベースに登録された日時を「yyyy-mm-dd」形式で表示する。 氏名 問い合わせの際に入力された値を変換せずにそのまま表示する。 企業名 企業からのお問い合わせの場合は、問い合わせの際に入力された値を変換せずにそのまま表示する。エンドユーザーからのお問い合わせの場合は空欄とする。 メールアドレス 問い合わせの際に入力された値を変換せずにそのまま表示する。 お問合わせ種別 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/680558793?NO_SSR=1 の帳票で定義されているように、事前に定められた選択肢のうち、ユーザーが選択したオプションを表示する。 レコードをクリックすると 、 その問い合わせの 392_【作成中】問い合わせ詳細閲覧機能 のページに遷移する。 スコープ外 特になし",
  "parentId": "714670091",
  "parentTitle": "390_【不要のため削除】問い合わせ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704774279/391_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-04-13T01:23:23.185Z",
  "author": "ejiri_yusuke",
  "excerpt": "目次 概要 本機能は 【作成中】問合せ の登録済みのデータの一覧を閲覧するための機能です。 要求事項 管理画面にログインできる全体管理者のみが、登録されている 【作成中】問合せ のデータを一覧で閲覧することができる。 １ページあたりの表示数を 50件 とし、表示対象のレコードが51件以上の場合は、 ページネーション (ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部..."
}