{
  "id": "705036397",
  "title": "532_【FIX】パーソナルオファー - 登録機能",
  "content": "1. 目次 2. 概要 本機能はパーソナルオファー（ 【FIX】オファー履歴 ）を送信するための機能です。 また、オファー対象者の絞り込み時に、 【FIX】オファー候補会員検索条件（パーソナルオファー） の 新規作成、削除もできます。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を追加することができる。 左メニューおよび画面上のボタンでの遷移時に、指定した対象サイトに絞った内容のみ表示する。 新規登録にあたって入力フォームに表示し入力可能な項目はWFの通りとし、特筆すべき内容のみここで記載する。 キャンセルボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/719224862 に遷移する。 自動オファー管理ボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705265747 へ遷移する。 「パーソナルオファーと自動オファーの違い」説明ツールチップ 押下すると、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/719224862 の定義と同じ説明を表示する。 残り送信可能数 対象サイトごとにカウントして表示する。 表示した時点で 有効な契約 に紐づく商品の「パーソナルオファー追加数」の合計値から、送信済み数を引いた数が表示される。それぞれの詳しい条件は下記。 基本契約 企業に紐づく複数の有効な基本契約（例：異なる教室グループの契約）がある場合、複数の基本契約は合計せずに、その内で値が最も大きい「パーソナルオファー追加数」を用いる。 オプション契約 有効期間開始日を起点として「有効期間：月数」の月初めの日が現在月であるものを対象とする。（例：1月20日に「3ヶ月500通UP」のオプション商品を契約した場合、1月20日〜1月末：500通UP、2月：500通UP、3月1日〜3月末：500通UP、となり4月1日〜4月19日は契約自体は有効だが通数UPはカウントしない） 企業に紐づく複数の有効なオプション契約がある場合、すべてのオプション契約の「パーソナルオファー追加数」の値を合計して用いる。 送信済み数は当月に送信したパーソナルオファーの 【FIX】オファー履歴 の数。 対象教室の選択 オファーを送信する際に紐づける教室を選択するためのフォーム。 該当企業に紐づく教室 のうち、1件以上の求人が掲載されている教室 を選択肢として表示する。 送信文面選択 選択肢として、該当企業に紐づいて登録されている 【FIX】オファーメッセージテンプレート（パーソナルオファー） 、および企業への紐付けがない 【FIX】オファーメッセージテンプレート（パーソナルオファー） を基本テンプレートとして表示する。 対象ユーザーの選択 送信対象ユーザーを条件で絞り込み、選択するための検索フィールドとユーザー一覧エリア。選択肢、選択方法については 【FIX】オファー候補会員検索条件（パーソナルオファー） と同様の定義とする。 「 閲覧履歴」でチェックした場合 、 3ヶ月以内に該当求人詳細ページを閲覧した （更新日が3ヶ月以内の 【作成中】求人閲覧データ がある）会員のみ抽出する。 一覧フィルター用コンポーネントの表示項目はWFにて定義の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。選択式のフィルター項目では、何も選択・入力していない状態を初期値とする。 退会者がオファー対象外。 保存した検索条件 【FIX】オファー候補会員検索条件（パーソナルオファー） を選択肢として表示する。 選択後、適用ボタンを押下すると、保存した条件が画面上のフォームに入力された状態になる。 選択後、削除を押下すると、削除確認モーダルが表示される。キャンセルを押下すると何もせずモーダルを閉じ、削除するを押下すると、選択した 【FIX】オファー候補会員検索条件（パーソナルオファー） を削除する。 必須条件 市区町村 選択ボタンを押下すると、指定した都道府県の市区町村の選択モーダルを開く。 市区町村の選択モーダル上では、全選択用のチェックボックスで全選択可能とする。 年齢 選択された最少年齢「以上」かつ最高年齢「以下」のユーザーを検索対象とする 学歴 学校名、学部名、学科名 コンボボックスとし、会員情報として登録されている情報をテキスト検索して一致した選択肢を表示・選択可能とする。 学校名、学部名、学科名の順に、上位の選択肢で絞り込まれた選択肢のみ表示する。 選択肢はキャッシュとして保存し、１日ごとに更新する。 検索条件を保存するボタン 押下すると、検索条件保存モーダルが表示され、名称を入力して保存するボタンを押下することで、選択中の条件を 【FIX】オファー候補会員検索条件（パーソナルオファー） として新規に登録することができる。 登録できる件数は、企業あたり30件までとして、上限に達していて保存できない場合は、「登録数の上限に達しているため保存できません」というメッセージを表示する。 登録に成功した場合は「保存しました」というメッセージを表示する。 検索ボタン 押下すると、選択中の条件および下記の条件に該当する会員が検索されて表示される。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/686686292 の条件を満たす。 【FIX】会員：設定情報（オファー・メール） にてパーソナルオファーを利用する設定にしている。 【FIX】会員：設定情報（オファー拒否企業） にて該当企業を拒否対象として登録していない。 会員一覧 選択チェック 残り送信可能数まで選択したら、可能数を超えて選択できない様に残りの選択欄を非活性する。 オファー送信後条件保存チェック チェックすると、オファー送信完了メッセージ表示後に前述の検索条件保存のモーダルが表示されて、条件を保存することができる。保存の仕方は、前述の通りとする。 オファー送信ボタン 押下すると、入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 エラーチェックで問題がなければ「$人数$名にオファーを送信しますか？」という最終確認用のモーダルを表示する。 モーダル上の実行ボタンを押すと、 【FIX】オファー履歴 のレコードおよび同時に送信された 【FIX】オファー履歴 をすべて紐づけた 【作成中】オファー履歴グループ をデータベースに保存し、完了したことを示すモーダルを表示する。モーダルには閉じるボタンを配置し、押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/719224862 に遷移する。 モーダル上のキャンセルボタンを押すと、レコードは作成せずにモーダルを閉じる。 オファーの登録が完了すると、パーソナルオファー通知を受信する設定している該当のユーザーにたいして、 【FIX】パーソナルオファー受信通知メール（会員宛／ステーション） を送信する。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 オファー送信 日時、クライアント企業管理者ID、オファー履歴番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 検索条件の保存・削除 日時、クライアント企業管理者ID、検索条件番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 概要と同じ 3.2. 帳票 概要と同じ 3.3. メールテンプレート 確認中 【FIX】パーソナルオファー受信通知メール（会員宛／ステーション） 3.4. ワークフロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. パーソナルオファー新規作成画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=126091-11442&amp;mode=design&amp;t=dYT33xYvF3NBgg8O-0 4.1.2. 検索条件の保存画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=130199-102281&amp;mode=design&amp;t=dYT33xYvF3NBgg8O-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ オファー 新規登録画面を表示した場合に下記フォーマットでログを出力する。 User {クライアント企業管理者のユーザー番号} started to create personal_offer. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 新規登録処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {クライアント企業管理者のユーザー番号} created personal_offer. company_number={企業番号} offer_number={オファー履歴番号,,,,} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {クライアント企業管理者のユーザー番号} failed to create personal_offer. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} オファー候補会員検索条件 新規登録処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {クライアント企業管理者のユーザー番号} created personal_offer_user_filter. company_number={企業番号} personal_offer_user_filter_number={オファー検索条件番号,,,,} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {クライアント企業管理者のユーザー番号} failed to create personal_offer_user_filter. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 削除を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {クライアント企業管理者のユーザー番号} deleted personal_offer_user_filter. company_number={企業番号} personal_offer_user_filter_number={オファー検索条件番号,,,,} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {クライアント企業管理者のユーザー番号} failed to delete personal_offer_user_filter. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "720929148",
  "parentTitle": "530_■パーソナルオファー管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705036397/532_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-14T08:52:05.151Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能はパーソナルオファー（ 【FIX】オファー履歴 ）を送信するための機能です。 また、オファー対象者の絞り込み時に、 【FIX】オファー候補会員検索条件（パーソナルオファー） の 新規作成、削除もできます。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を追加することができる。 左メニューおよび..."
}