{
  "id": "705200137",
  "title": "601_【FIX】メッセージテンプレート-一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【作成中】企業：メッセージテンプレート の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業管理画面にログインできるクライアント企業管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 595_【作成中】応募管理 - 詳細 - メッセージ管理機能 に本ページへの導線を用意している。 一覧ページ上部には、表示可能なレコードの総数 、 新規登録ボタンを表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 レコード一覧の上に次の項目を表示する 新規登録ボタン 押下すると 602_【作成中】メッセージテンプレート-新規作成機能 に遷移する。 ただしすでに登録されているメッセージテンプレートが20件ある場合はボタンを非活性とする。 メッセージ一覧に戻るボタン 押下すると遷移元の 595_【作成中】応募管理 - 詳細 - メッセージ管理機能 に遷移する。 本ページの 「要件定義」-「出力」「ページネーション」 欄で出力先 として「画面」が定義されている項目 一覧の各レコードには次の項目を表示する 本ページの 「要件定義」-「出力」「各レコード内」 欄で出力先 として「画面」が定義されている項目 編集ボタン 押下すると 603_【作成中】メッセージテンプレート-編集機能 へと遷移する。 削除ボタン 押下すると 604_【作成中】メッセージテンプレート-削除機能 を実行 する。 3.1. 権限 クライアント企業管理画面にログインできるクライアント企業管理者のみ 3.2. 帳票 【作成中】企業：メッセージテンプレート 3.3. メールテンプレート なし 3.4. ワークフロー 3.4.1. 本機能 3.4.2. 関連 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=54144-56449&amp;mode=design&amp;t=PRYSskljaJYjgryx-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. ページネーション 項目名 変数名 入力元 説明 バリデーション ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4.3.2. 各レコード情報 データベースから抽出したメッセージテンプレート情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 テンプレート名 画面 【作成中】企業：メッセージテンプレート の「テンプレート名」を適切にHTMLエスケープして表示する。 件名 画面 【作成中】企業：メッセージテンプレート の「件名」を適切にHTMLエスケープして表示する。 4.4. 処理 4.5. エラー処理 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント管理者のユーザー番号} read message template list. page={ページ番号} company_number={企業番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "705429519",
  "parentTitle": "600_メッセージテンプレート管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705200137/601_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-08T09:13:14.258Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 本機能は 【作成中】企業：メッセージテンプレート の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業管理画面にログインできるクライアント企業管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 595_【作成中】応募管理 - 詳細 - メッセージ管理機能 に本ページへの導線を用意している。 一覧ページ上部には、表示..."
}