{
  "id": "705429505",
  "title": "592_【FIX】応募管理 - 詳細 - メッセージ - 一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は、1つの応募に紐ずく 【FIX】応募メッセージ情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者のみが、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 一覧ページ上部には、次の内容を表示する。 応募詳細画面の各タブ共通内容 本ページの「要件定義」- 「出力」 - 「各タブ共通内容」欄で出力先として「画面」が定義されている項目 一覧に戻るボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833 へと遷移する。 メッセージテンプレートを管理するボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705200137 に遷移する。 新規メッセージ作成ボタン 以下の条件の場合はボタンを非活性とし、ボタン列の下にそれぞれに応じたメッセージを表示する。 対象の応募者が応募から180日以上経過している 「応募から180日以上が経過しているため新規のメッセージは送れません。」 対象の応募者が 応募情報を「未登録」から変更している修正している 「応募者が応募情報を編集したため新規のメッセージは送れません。」 対象の応募者が塾講師ステーションを退会している 「応募者が塾講師ステーションを退会しているため新規のメッセージは送れません。」 新規メッセージを送れる状態であれば活性とし、押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704970781 に遷移する。 プロフィールタブを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705396737 へ、採用情報編集タブを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/933626149 へ遷移する。 メッセージ一覧については、送信日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには次の項目を表示する 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、メッセージ情報レコードとして定義されている項目 3.1. 権限 要求の通り。 3.2. 帳票 概要の通り。 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705036289 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=99385-60567&amp;mode=design&amp;t=6uLBHyVExE7hZ2SH-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション 応募番号 URLパラメータ 閲覧するメッセージの応募番号を一意に指定するためのID 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 各タブ共通内容 出力項目 出力先 説明 氏名 画面 フリガナも合わせて、姓名を連結して表示する。 性別 画面 保存された値を表示する。 応募教室 画面 HTMLエスケープをして表示する。 応募求人 画面 HTMLエスケープをして表示する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704610884 へのテキストリンクとする。 採用ステータス 画面 企業側の採用ステータスの保存された値を表示する。 「採用ステータスを変更する」を押下すると、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/933626149 へ遷移する。 「採用ステータスを変更する」を押下すると、その応募で絞り込まれた https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833 へ遷移する。 面接日時 画面 日時のフォーマットで表示する。分数までの表示とする。 「面接日時を設定する」を 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/933626149 へ遷移する。 「面接日時を設定する」を 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833 で定義した面接日設定モーダルを、ページ遷移なしで開く。 面接日時補足 画面 HTMLエスケープをして表示する。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出したメッセージ情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 送信／受信 画面 「作成者」がクライアント管理者の場合は「送信」を、会員の場合は「受信」 のアイコン を表示する。 送信時間 画面 日時のフォーマットで表示する。 件名 画面 HTMLエスケープして表示する。 本文 画面 HTMLエスケープして表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は クライアント管理画面 のログイン画面にリダイレクトする。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が1,000を超えていた場合、以降は総件数を1,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「 ページ番号 」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件のメッセージデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべきメッセージ情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント管理者のユーザー番号} read message list. company_number={企業番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "727974168",
  "parentTitle": "595_【作成中】応募管理 - 詳細 - メッセージ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705429505/592_+FIX+-+-+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-08-28T06:49:09.091Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は、1つの応募に紐ずく 【FIX】応募メッセージ情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者のみが、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 一覧ページ上部には、次の内容を表示する。 応募詳細画面の各タブ共通内容 本ページの「要件定義」- 「出力」..."
}