{
  "id": "705429584",
  "title": "623_【FIX】契約更新機能",
  "content": "目次 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータを 1件 複数件（複数の基本契約および紐づく複数の課金形態契約）同時に 新規追加 するための機能です。 要求事項 クライアント管理画面にログインできるクライアント企業 管理者 が、 【FIX】契約情報（統合版） のデータを新規登録することができる。 自分の企業に紐づかない契約は更新できない。 「対象サイト」「 有効期間：終了日時 」が一致している すべての基本契約 およびそれらに紐づく課金形態契約を 対象として 、複数同時に更新できる。 ただし、有効期間終了前に無効化された契約については、同時更新の対象外とする。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの「要件定義」-「入力」欄で入力元が「入力フォーム」と定義されている項目 契約更新しないボタン 押下すると 624_【作成中】契約更新辞退機能 に遷移する。 更新するボタン 必須項目がすべて入力されるまではボタンを非活性とする。 キャンセルボタン 契約は、購入可能な商品の中で、指定した期間に基づいて、 期間以外 は更新前の契約と同条件の商品が自動で選択されて更新できる。 詳しい条件は下記の通りとする。 購入可能な商品の判定は下記とする。 共通 「公開フラグ」が「公開」である 「購入可フラグ」が「可」である 現在の月が、「契約可能月」に含まれる 前の契約と同じ「対象サイト」である 基本商品の場合 共通 商品種別が「基本」である。 「有効期間：有無フラグ」が「あり」である。 入力フォーム「更新期間」で選択した期間と同じ「有効期間：月数」である。 前の契約と同じ「付与プラン」である 更新前の契約の商品が0円の場合 「単価」が0円である 更新前の契約の商品が0円以外の場合 「単価」が0円以外である 課金形態商品の場合 商品種別が「課金形態」である。 前の契約と同じ「課金形態種別」「 採用課金：雇用形態 」「採用課金：確定時期」「請求タイミング」である。 購入可能な商品が複数あった場合、自動で選択される商品は、 下記の優先順で判定し選択されるものとする。 更新前の契約と同じ商品 更新前の契約の商品の後継商品 商品番号の最も小さい商品 更新するボタン を押下すると、次のチェックを行う。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558 の「3．要求事項＞4」に定義している重複がないかのチェックを行い、重複があればエラーとする。「 重複した契約 がすでに存在します」というエラーメッセージを含むポップアップと閉じるボタンを表示し、閉じるボタンを押下するとポップアップを閉じる。 また、 対象の基本契約および 紐づく課金形態の契約も 更新できるか をチェックするため、 前記の購入可能な商品が存在しているかのチェックどうかの すでに契約している課金形態の商品に対して以下の チェックを行う。 「公開フラグ」が「公開」である 「購入可フラグ」が「可」である 現在の月が、「契約可能月」に含まれる 上記のチェックがOKで、課金形態の更新も可能だと確認できれば、基本契約と紐づく課金形態の契約を更新する。データベースにレコードを保存し、作成したことを示すポップアップを表示する。ポップアップには閉じるボタンを表示し、閉じるボタンを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593409 に遷移する。 ただし、オプション契約は更新しない 契約更新時の処理については https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558 の「3．要求事項＞5」に記載の、契約後の請求書作成処理に従う。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 キャンセルボタンを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593409 に遷移する。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、新しい契約番号、更新前の契約番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 権限 要求定義に記載の通り。 帳票 概要に記載の通り。 メールテンプレート なし ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 要件定義 ユーザーインターフェース（画面） 更新画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=106793-7666&amp;mode=design&amp;t=CpCpvwWykw0UdlfN-0 完了ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=88550-61299&amp;mode=design&amp;t=hx4yYuZXIdyXoAmn-4 入力 変数名、説明、バリデーションは、帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限 1 更新 期間 （商品） 入力フォーム 初期値なし 必須 2 ご利用教室グループの確認 入力フォーム 初期値なし チェックボックス 必須 対象の契約（基本契約および紐づく課金形態契約）すべてにおいて、更新可能な商品が存在している場合のみ活性化する。（条件は要求欄参照） 出力 説明は帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 なお金額は全て3桁のカンマ区切りとし、文頭に「&yen;」をつけて出力する。 項目名 出力先 説明 1 前契約の契約番号 画面／ データベース 更新される契約の契約番号をHTMLエスケープ処理をして出力する。 2 教室グループ 画面 更新される契約に紐づく 教室グループ番号と 教室グループ名を 連結して HTMLエスケープ処理をして出力する。 対象の契約において、更新可能な商品が存在しない場合は、テキスト表示をグレーとする。（更新可能である条件は要求欄参照） 3 サービス種別 データベース/画面 更新される契約に紐づくサービス種別に対応するラベル名を出力する。 4 更新 期間（ 商品 ） 画面／データベース セレクトボックスとし、選択肢は 【FIX】商品マスタ（統合版） のうち、 購入可能商品（条件は要求欄参照）が保持している「有効期間：月数」 を表示する。 ただし、同じ「有効期間：月数」の場合は重複して表示せず、１つのみ表示する。 商品種別が「基本」である。 「有効期間：有無フラグ」が「あり」である。 「公開フラグ」が「公開」である 「購入可フラグ」が「可」である 現在の月が、「契約可能月」に含まれる 前の契約と同じ対象サイトの商品である 選択肢の表示名は「＄有効期間：月数＄」＋「ヶ月」 ＋「（＄商品名称＄）」 とする。 5 契約種別 画面 「基本」と出力する。 6 商品概要 画面 「更新料」と表示する。 7 総額（内消費税） 画面 「更新料（内消費税）」と表示する。 【FIX】商品マスタ（統合版） の税区分をもとに、税込の総額を表示する。また同様に消費税額も表示する。 ■総額の計算式 対象商品：税区分＝外税の場合 総額＝「単価」&times;「数量」＋（「単価」&times;「数量」）＊税率 対象商品：税区分＝内税の場合 総額＝「単価」&times;「数量」 ■内消費税の計算式 （「単価」&times;「数量」）＊税率 8 有効 期間 画面／データベース 前の契約の終了日 時 から過ぎていた場合 操作当日 の操作日時 を開始日 時 とし、期間分を加算し て た日付における、終わりの日時（24:00:00）を 終了日 時 として 出力する（画面上は日付のみ 表示する。 ） 前の契約の終了日 時 を過ぎていない場合 前の契約の終了時刻が00:00:00である場合 前の契約の終了日時を開始日時とし、期間分を加算して終了日時として出力する（画面上は日付のみ表示する。） 前の契約の終了時刻が00:00:00でない場合 前の契約の終了日の次の日 の00:00:00 を開始日 時 とし、期間分を加算して終了日 時 として 出力する（画面上は日付のみ 表示する。 ） 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はクライアント企業画面のログイン画面にリダイレクトする。 4.4.1. 入力画面表示処理 本ページの「入力」に記載の全ての項目の入力フォームと登録ボタンを配置した画面を表示する。 4.4.2. 新規登録処理 入力フォームからのデータを受け取り、「入力」の定義にしたがって値の妥当性検査をおこなう。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、作成日時、更新日時を操作している現在時刻とし、操作を行なっているクライアント企業管理者のユーザー番号を作成者/更新者に設定した上でデータベースに新規レコードとして挿入する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593409 ページへリダイレクトし、新規データ登録が完了したことがわかるようにメッセージを表示する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 更新画面を表示した場合に下記フォーマットでログを出力する。 User {クライアント企業管理者のユーザー番号} started to create contract. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 更新処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {クライアント企業管理者のユーザー番号} created contract . contract_number={契約番号} company_number={企業番号} brand_number={教室グループ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 作成したレコード数の数だけログを出力する。 失敗した場合 User {クライアント企業管理者のユーザー番号} failed to create contract . company_number={企業番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "705265775",
  "parentTitle": "620_■契約管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705429584/623_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-14T00:44:29.084Z",
  "author": "ejiri_yusuke",
  "excerpt": "目次 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータを 1件 複数件（複数の基本契約および紐づく複数の課金形態契約）同時に 新規追加 するための機能です。 要求事項 クライアント管理画面にログインできるクライアント企業 管理者 が、 【FIX】契約情報（統合版） のデータを新規登録することができる。 自分の企業に紐づかない契約は更新できない。 「対象サイト」「 有効期間：終了日時..."
}