{
  "id": "705429575",
  "title": "572_【FIX】急募管理 - 編集機能",
  "content": "1. 目次 2. 概要 本機能は求人の急募情報（急募契約 【FIX】契約情報（統合版） 1件およびそれに紐づく 【FIX】急募オプション申込付帯情報 複数件）において、紐づく求人を変更するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を変更することができる。 変更する際に、急募設定可能な上限数は、紐づく契約と商品の値から下記の様に定められる。 【FIX】商品マスタ（統合版） の「急募数」&times; 【FIX】契約情報（統合版） の「数量」 編集画面に表示する内容はWFの通りとし、特筆すべき内容のみ下記に記載する。 対象の急募情報 適用期間：終了日は、時刻が00:00:00の場合、前日の日付を表示する。（例：契約期間が2024/9/4 00:00:00〜 2024/10/5 00:00:00の場合、「2024/9/4〜 2024/10/4 」の様にする） 入れ替え元求人選択画面 キャンセルボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705232936 へ遷移する。 対象の急募情報 編集対象の急募情報を表示する。 表示内容の値の定義は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705232936 と同様とする。 入れ替え元求人選択選択フォーム 対象の急募に紐づいている求人を一覧で表示する。 チェックボックスで複数選択可能とする。 次へボタン 急募設定可能数に余剰がある場合は入れ替え元求人を選択していない状態でも活性化し、急募設定可能数に余剰が無い場合（既に上限まで急募設定している場合）は入れ替え元求人を１件以上選択した場合に活性化する。 押下すると「入れ替え先求人選択画面」へ遷移する。 入れ替え先求人選択画面 戻るボタン 押下すると「入れ替え元求人選択画面」へ遷移する。 対象の急募情報 編集対象の急募情報を表示する。 表示内容の値の定義は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705232936 と同様とする。 選択中の入れ替え元求人 対象の急募に紐づく求人の内、「入れ替え元求人選択画面」で選択した求人を表示する。 該当する求人がない場合は、列タイトルのみ表示する。 入れ替え対象外求人 対象の急募に紐づく求人の内、「入れ替え元求人選択画面」で選択しなかった求人を表示する。 該当する求人がない場合は、列タイトルのみ表示する。 入れ替え先求人選択選択フォーム 対象の急募と同じ「対象サイト」「教室グループ」に一致する求人、かつ、対象の急募に紐づいていない求人のみが一覧で表示され、選択可能とする。 急募設定上限数から「入れ替え元求人選択画面」で選択しなかった求人数を除く数 を上限として選択でき、上限まで達したら他の選択肢は選択不可とする。 求人一覧 は、一覧フィルターコンポーネントで絞り込んで表示できる。 一覧フィルター用コンポーネントの表示項目はWFにて定義の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。選択式のフィルター項目では、何も選択・入力していない状態を初期値とする。各フィルター項目は基本的にWFを参照する。 更新するボタン 入れ替え先求人選択選択フォームにて、必要な求人数未満しか選択していない場合はボタンを非活性にする。 「選択中の入れ替え元求人」がなく、かつ「入れ替え先求人」を選択してない場合は、更新するボタンを非活性にする。 押下すると、入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 エラーチェックで問題がなければ、下記のレコードをデータベースに保存し、作成したことを示すモーダルを表示する。モーダルには閉じるボタンを配置し、押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705232936 に遷移する。 【FIX】急募オプション申込付帯情報 入れ替え元求人として選択した求人が紐づいている 【FIX】急募オプション申込付帯情報 の紐付け先求人をそれぞれ、入れ替え先求人として選択した求人へ変更する。 モーダル上のキャンセルボタンを押すと、レコードは作成せずにモーダルを閉じる。 更新に成功または失敗した場合、以下の情報が入ったログを出力する。 日時、クライアント企業管理者ID、契約番号、急募オプション申込付帯情報番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 概要と同じ 3.2. 帳票 概要と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オプション申込・登録・解除フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 入れ替え元求人選択画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=114402-60066&amp;mode=design&amp;t=wHwI8OVstG8idDlc-0 4.1.2. 入れ替え先求人選択画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=114402-60470&amp;mode=design&amp;t=wHwI8OVstG8idDlc-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 編集画面を表示した場合に下記フォーマットでログを出力する。 User {クライアント企業管理者のユーザー番号} started to update urgent_option. contract_number={契約番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 更新処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {クライアント企業管理者のユーザー番号} updated urgent_option. contract_number={契約番号} company_number={企業番号} urgent_option_number={急募オプション申込付帯情報番号,,,} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {クライアント企業管理者のユーザー番号} failed to update urgent_option. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "705396812",
  "parentTitle": "570_■急募管理 機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705429575/572_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-09-17T05:07:25.577Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は求人の急募情報（急募契約 【FIX】契約情報（統合版） 1件およびそれに紐づく 【FIX】急募オプション申込付帯情報 複数件）において、紐づく求人を変更するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を変更することができる。 変更する際に、急募設定可能な上限数は、紐づく契..."
}