{
  "id": "705593396",
  "title": "672_【FIX】全アカウント管理 - アカウント招待・登録機能",
  "content": "1. 目次 2. 概要 クライアント企業管理 画面にログインしたいユーザーを招待し、招待されたユーザーがクライアント企業管理者アカウントを登録するための機能。 3. 要求事項 クライアント企業管理者招待 クライアント企業管理者が、 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 からアクセスできるクライアント企業管理者招待モーダルにて、クライアント企業向け管理画面にログインしたいクライアント企業管理者へメールアドレスを指定してクライアント企業管理者招待メール（ 【レビュー中】クライアント企業管理者招待メール ）を送信する。 画面上には以下の項目を表示する 本ページの「要件定義」-「入力」-「新規招待機能」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593396#4.2.1.-%E6%96%B0%E8%A6%8F%E6%8B%9B%E5%BE%85%E6%A9%9F%E8%83%BD ）で入力元が「入力フォーム」と定義されている項目 招待する用ボタンを押下すると入力項目に問題なければ、招待したことがわかる表示がされると同時に、 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 ページへ遷移する。 問題があればエラーメッセージが表示される。（入力規制は要件定義で定義する。） メールアドレスがすでにクライアント企業管理者として登録済みのものである場合はエラーとし、招待メールは送信しない。 クライアント企業管理者招待で成功した場合、以下の情報が入ったログを出力する。 日時、招待をしたクライアント企業管理者のユーザー番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功）、部分的にマスクしたメールアドレスaaaaaa@bbb.co.jpをa************@bbb.co.jpと出力する、など。） クライアント企業管理者登録 招待を受けた本人が、必要な項目を登録することで新規のクライアント企業管理者アカウントを登録することができる。 招待された本人は、招待メール（ 【レビュー中】クライアント企業管理者招待メール ）に表示されるユニークなURLを押下することで、クライアント企業管理者アカウント登録用ページへ遷移することができる。 ユニークなURLの有効期限は 24時間 1週間 とする。またメールが再送された場合、有効期限内であっても前回のメールにあるユニークなURLを無効とする。無効となったURLにアクセスした場合、ステータス404（Page Not Found）のページを表示する。 クライアント企業管理者登録用ページの項目は以下とする。なお、以下の他は 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け に記載の内容に準ずる。 本ページの「要件定義」-「入力」-「登録機能」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593396#4.2.2.-%E7%99%BB%E9%8C%B2%E6%A9%9F%E8%83%BD ）で入力元が「入力フォーム」と定義されている項目 登録する用ボタンを押下すると入力項目に問題なければ、更新されたことがわかる表示がされると同時に、クライアント企業管理者画面のログインページ（ 681_【FIX】クライアント企業ログイン・ログアウト機能 ）へ遷移する。 問題があればエラーメッセージが表示される。（入力規制は要件定義で定義する。） クライアント企業管理者登録で成功した場合、以下の情報が入ったログを出力する。 日時、新規登録されたクライアント企業管理者のユーザー番号：クライアント企業管理者、アクセス元IPアドレス、ユーザーエージェント、アクション（成功） 3.1. 権限 クライアント企業管理画面にログインすることができるクライアント企業管理者のみが、新規のクライアント企業管理者を招待することができる。 3.2. 帳票 670_【FIX】全アカウント管理機能 の記載と同じ 3.3. メールテンプレート 【レビュー中】クライアント企業管理者招待メール 3.4. ワークフロー 670_【FIX】全アカウント管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. クライアント企業管理者招待画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29668-46544&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.1.2. クライアント企業管理者招待完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29668-46800&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.1.3. クライアント企業管理者登録情報入力画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29678-47173&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.1.4. クライアント企業管理者登録情報入力完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29678-47189&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.2. 入力 4.2.1. 新規招待機能 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 &nbsp; フォーム 隠しフォーム その企業番号を持つ 【FIX】企業：基本情報 が存在すること。 2 メールアドレス &nbsp; 入力フォーム 初期状態なし 必須 3 掲載担当 &nbsp; 入力フォーム 初期状態なし 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 チェックは入っておらず活性状態である 4 採用確認担当 &nbsp; 入力フォーム 初期状態なし 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 チェックは入っておらず活性状態である 5 請求担当 &nbsp; 入力フォーム 初期状態なし 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 チェックは入っておらず活性状態である 6 登録認証用のtoken有効期限 &nbsp; 設定ファイル 設定ファイルに記述した、tokenの有効期限（分）。 設定可能な値は 1-10080 の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を60として処理する。 &nbsp; 4.2.2. 登録機能 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 氏名 &nbsp; 入力フォーム 初期値なし そのメールアドレスですでに企業管理者としてのアカウントがない場合のみ必須 2 パスワード &nbsp; 入力フォーム 初期値なし そのメールアドレスですでに企業管理者としてのアカウントがない場合のみ必須 3 担当者電話番号 &nbsp; 入力フォーム 初期値なし 必須 4 トークン &nbsp; URLパラメータ クライアント企業管理者アカウント招待メールに表示させるURLに仕様されるトークン 必須 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 招待機能 出力項目 出力先 説明 1 トークン データベース クライアント企業管理者招待ページにて、バリデーションに問題がない場合のみ、生成されるトークン。 バリデーションに問題があった場合はなにもしない。 2 メールアドレス データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 3 掲載担当 データベース/画面 画面の対象フォーム内に入力された値に対するラベルを表示をする、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 採用確認担当 データベース/画面 画面の対象フォーム内に入力された値に対するラベルを表示をする、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 5 請求担当 データベース/画面 画面の対象フォーム内に入力された値に対するラベルを表示をする、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 6 管理者招待メール メール クライアント企業管理者招待ページにて、バリデーションに問題がない場合のみ、管理者招待メールテンプレートを元に必要な変数を差込変換して送信する。 7 作成者 データベース 【作成中】帳票共通項目 の定義に従う。 8 作成日時 データベース 【作成中】帳票共通項目 の定義に従う。 9 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 10 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.3.2. 登録機能 項目名 入力元 説明 1 氏名 画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力する。 そのメールアドレスですでに企業管理者としてのアカウントがない場合のみエラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 2 パスワード データベース/画面 そのメールアドレスですでに企業管理者としてのアカウントがない場合のみ管理者登録成功時にハッシュ化したパスワードを保存する。 そのメールアドレスですでに企業管理者としてのアカウントがある場合は項目ごと表示しない。 3 担当者電話番号 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 5 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はクライアント企業管理者画面のログイン画面にリダイレクトする。 4.4.1. 入力画面表示処理 本ページの「入力」（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593396#4.2.-%E5%85%A5%E5%8A%9B ）に記載の全ての項目の入力フォームと登録ボタンを配置した画面を表示する。 4.4.2.クライアント企業管理者招待処理 入力フォームからのデータを受け取り、「入力」の定義にしたがって値の妥当性検査をおこなう。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、作成日時、更新日時を操作している現在時刻とし、操作を行なっているクライアント企業管理者のユーザー番号を作成者/更新者に設定した上でデータベースに新規レコードとして挿入する。 4.4.3. クライアント企業管理者登録処理 入力フォームからのデータを受け取り、「入力」の定義にしたがって値の妥当性検査をおこなう。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、更新日時を操作している現在時刻とし、操作を行なっているクライアント企業管理者のユーザー番号を更新者に設定した上でデータベースに保存する。 681_【FIX】クライアント企業ログイン・ログアウト機能 ページへリダイレクトし、新規データ登録が完了したことがわかるように以下のメッセージを表示する。 クライアント企業管理者情報を新規登録しました。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 ログ クライアント企業管理者招待画面を表示した場合に下記フォーマットでログを出力する。 User {操作を実行したクライアント企業管理者のユーザー番号} started to invite company_user . {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} クライアント企業管理者招待処理を実行した場合に下記フォーマットでログを出力する。 成功 User {操作を実行したクライアント企業管理者のユーザー番号} invited company_user. type= {publication, hiring_check, accountingのうち担当に当てはまるものをコンマ区切りで } email={匿名化処理したメールアドレス} ip_restriction={IPアドレス制限} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗 User {操作を実行したクライアント企業管理者のユーザー番号} failed to invite company_user. type={publication, hiring_check, accountingのうち担当に当てはまるものをコンマ区切りで} email={匿名化処理したメールアドレス} ip_restriction={IPアドレス制限} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} クライアント企業管理者登録画面を表示した場合に下記フォーマットでログを出力する。 Invited user started to create company_user. type ={publication, hiring_check, accountingのうち担当に当てはまるものをコンマ区切りで} email={匿名化処理したメールアドレス} ip_restriction={IPアドレス制限} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} クライアント企業管理者登録処理を実行した場合に下記フォーマットでログを出力する。 成功 Invited user created company_user. user_number={登録されたクライアント企業管理者のユーザー番号} company_number={企業番号} type={publication, hiring_check, accountingのうち担当に当てはまるものをコンマ区切りで} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗 Invited user failed to create company_user. company_number={企業番号} type={publication, hiring_check, accountingのうち担当に当てはまるものをコンマ区切りで} email={匿名化処理したメールアドレス} ip_restriction={IPアドレス制限} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} メールアドレスの匿名化処理は 共通要件 の記載に従う。 5. 制限事項 なし",
  "parentId": "705265754",
  "parentTitle": "670_【FIX】全アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705593396/672_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-01-30T03:27:49.248Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 クライアント企業管理 画面にログインしたいユーザーを招待し、招待されたユーザーがクライアント企業管理者アカウントを登録するための機能。 3. 要求事項 クライアント企業管理者招待 クライアント企業管理者が、 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 からアクセスできるクライアント企業管理者招待モーダルにて、クライアント企業向け管理画面にログインしたいクライ..."
}