{
  "id": "705593389",
  "title": "631_【FIX】請求管理 - 一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 およびそれに紐づく 【FIX】請求：請求明細 【FIX】請求：請求書PDF の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 企業管理画面にログインできるクライアント企業管理者のみ が、登録されている 【修正中】請求：基本情報 を一覧で閲覧することができる。 一覧で表示される請求書は以下の条件を満たすものだけである。 【修正中】請求：基本情報 が承認済み およびDL済み である。 それに紐づく最新の承認された 【FIX】請求：請求書PDF が署名済みである。 一覧ページ上部には、下記を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数 １ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、検索ボタンを押下するまでフィルター項目の変更は適用されないものとする。 本ページの「要件定義」-「入力」欄で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 検索ボタン 押下することで変更されたフィルター項目の一覧適用を実行する。 リセットボタン 押下すると一覧フィルター用コンポーネントの全ての入力項目をデフォルト値に戻す。 一覧の各レコードには以下の項目を表示する。 本ページの「要件定義」-「出力」 - 「各レコード」欄で定義されている項目 3.1. 権限 要求の記載と同じ。 3.2. 帳票 【修正中】請求：基本情報 【FIX】請求：請求書PDF 3.3. メールテンプレート なし 3.4. ワークフロー 契約関連全体フロー 4. 要件定義 4.1. ユーザーインターフェース（ 画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=86377-34829&amp;mode=design&amp;t=6P8WL1QXIshns15t-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 請求対象年月 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のセレクトボックスで入力し、 年については 【修正中】請求：基本情報 の「請求対象年月：年」 に記載されている選択肢、 年については「2023年」から「処理時点の年」の期間の中の選択肢、 月については 【修正中】請求：基本情報 の「請求対象年月：月」に記載されている選択肢から選択することができる。 デフォルトは未選択とする。 年については 【修正中】請求：基本情報 の「請求対象年月：年」 に記載されている選択肢、 年については「2023年」から「処理時点の年」の期間の中の選択肢、 月については 【修正中】請求：基本情報 の「請求対象年月：月」に記載されている選択肢以外が入力された場合は、期間未設定と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合はフィルタリングはおこなわない。 2 DL状況 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のラジオボタンで入力し、「指定なし」「DL未実行」「DL済」から選択することができる。 デフォルトは「指定なし」とする。 「指定なし」「DL未実行」「DL済」以外が入力された場合は「指定なし」と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合は「指定なし」と判定しフィルタリングはおこなわない。 3 ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 検索フィルター・ページネーション 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 請求対象年月 画面 入力された「請求対象年月」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「請求対象年月」のセレクトボックスで初期選択状態とする。 5 DL状況 画面 入力された「DL状況」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「DL状況」のラジオボタンで初期選択状態とする。 4.3.2. 各レコード 出力項目 出力先 説明 1 請求番号 画面 登録された「請求ID」を変換せずにそのまま表示する。詳細は 【修正中】請求：基本情報 を参照。 2 請求書PDFファイル名 画面 紐づく 【FIX】請求：請求書PDF のファイル名を表示し、テキストリンクとする。押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/721027374 を実行する。 紐づく 【FIX】請求：請求書PDF が削除済みの場合は、テキストリンクにはせずにファイル名を表示し、また文末に「（削除済み）」をつけて表示する。 3 DL状況 画面 【修正中】請求：基本情報 の「請求書ファイルダウンロード日時」が登録されているなら「DL済み」それ以外なら「DL未実行」と表示する。 紐づく 【FIX】請求：請求書PDF の「ステータス」が「DL済み」なら「DL済み」、それ以外なら「DL未実行」と表示する。 4 請求対象年月 画面 データベースから取得した請求情報1レコードの「請求対象年月」。登録された「請求対象年月：年」と「請求対象年月：月」を「yyyy年mm月」の形式で表示する。詳細は 【修正中】請求：基本情報 を参照。 5 請求金額 画面 データベースから取得した請求情報1レコードの 【FIX】請求：請求書PDF の「請求金額」。登録された「請求金額」を変換せずに、文頭に「￥」をつけ、3桁ずつのカンマ区切りで表示する。詳細は 【FIX】請求：請求書PDF を参照。 値がNULLの場合は空白（何も表示しない）とする。 6 請求に関してのお知らせ 画面 データベースから取得した請求情報1レコードの「請求に関してのお知らせ」。登録された「請求に関してのお知らせ」を適切にHTMLエスケープして表示する。詳細は 【修正中】請求：基本情報 を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は企業管理者画面のログイン画面にリダイレクトする。 「請求対象年月」「DL状況」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が20,000を超えていた場合、以降は総件数を20,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の請求管理データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき請求管理情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント企業管理者のユーザー番号} read invoice list. company_number={企業番号} page={ページ番号} invoice_date={請求対象年月} download_status={DL状況} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "720863520",
  "parentTitle": "630_■請求管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705593389/631_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-28T08:46:28.160Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 およびそれに紐づく 【FIX】請求：請求明細 【FIX】請求：請求書PDF の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 企業管理画面にログインできるクライアント企業管理者のみ が、登録されている 【修正中】請求：基本情報 を一覧で閲覧することができる。 一覧で表示される請求書は以下の条件を満たすものだけである。 【..."
}