{
  "id": "705626113",
  "title": "【FIX】契約情報（統合版）",
  "content": "概要 クライアント企業による商品（ 【FIX】商品マスタ（統合版） ）の購入内容であり、対象商品やその数量、有効期間などを定義する。 全体管理画面またはクライアント企業向け管理画面で登録する。 ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】オプション申込・登録・解除フロー 【FIX】クライアント企業への請求・支払いフロー 詳細 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 契約番号 contract_number 数値 - 自然数 本システムが発行する一意の連番。 2 対象企業：企業番号 数値 セレクトボックス 自然数 指定した 【FIX】企業：基本情報 が存在すること 3 請求先：企業名 文字列 セレクトボックス 締結時点の対象企業の 【FIX】企業：基本情報 の企業名を登録する。 4 請求先・振込先マスタ番号 &nbsp; 数値 &nbsp; 自然数 指定した 【FIX】商品マスタ（統合版） の 商品種別が 「基本」の場合のみ設定可能 指定の番号の 【FIX】企業：請求先・振込先マスタ が存在すること 請求先・振込先情報 契約新規作成時に紐づける 5 対象教室グループ：教室グループ番号 数値 セレクトボックス 自然数 指定した 【FIX】教室グループ が存在すること 同じ企業でも、教室グループによって成果報酬の金額が異なる場合があるため、指定する。必須での入力を想定。 6 対象商品：商品番号 数値 セレクトボックス 自然数 指定した 【FIX】商品マスタ（統合版） が存在すること 7 対象商品：単価 数値 - レコード作成時点の対象の 【FIX】商品マスタ（統合版） の情報をコピーして保持する。 8 対象商品：数量 数値 テキストボックス - 自然数 指定した 【FIX】商品マスタ（統合版） の 商品種別が 「オプション」の場合のみ設定可能 数量の指定がない場合、 レコード新規作成時に、固定で「1」が設定される。 9 対象商品：税区分 単一選択 - 選択肢内 レコード作成時点の対象の 【FIX】商品マスタ（統合版） の情報をコピーして保持する。 「外税」「内税」から選択する 10 対象商品：税率 数値 - 0〜100 レコード作成時点の対象の 【FIX】商品マスタ（統合版） の情報をコピーして保持する。 11 締結日 日付 - レコード作成時点の日付が自動で設定される。 12 有効期間：開始日時 start_datetime 日時 デイトピッカー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E5%80%8B%E5%88%A5%E4%BA%8B%E9%A0%85 の年月日の仕様に準ずる。 時刻は、画面上で入力した日付がの始まる時刻（0時）または、レコードの生成時刻が設定される。 13 有効期間：終了日時 end_datetime 日時 デイトピッカー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E5%80%8B%E5%88%A5%E4%BA%8B%E9%A0%85 の年月日の仕様に準ずる。 時刻は、画面上で入力した日付が終わる時刻（24時）が設定される。 14 無料フラグ 真偽値 チェックボックス 「対象商品：商品番号」 で指定した商品の商品種別が「基本」の場合のみ設定可能。 初回契約のみ無料にする場合があるため、本フラグで無料契約であることを識別する。 15 更新辞退フラグ renewal_declined_flag 真偽値 辞退の選択をした場合に「1」とする。 契約更新時に、クライアント企業が更新を希望しない選択をしたことを記録するフラグ。 16 無効化実行者 数値 自然数 指定した番号の 【FIX】全体管理者登録情報 が存在すること 契約を無効にした全体管理者のユーザー番号 無効化の完了時に自動で登録される。 17 無効化日時 日時 ボタン 契約を無効にした日時 無効化を完了した日時が自動で設定される。 18 親基本契約：契約番号 数値 セレクトボックス 自然数 指定した https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=705626113 が存在すること 指定した https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=705626113 で購入した商品の商品種別が「基本」であること 「対象商品：商品番号」で指定した商品の商品種別が「課金形態」 「オプション」 の場合のみ設定可能。 19 前契約：契約番号 数値 セレクトボックス 自然数 指定した https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=705626113 が存在すること 20 担当者 person_in_charge 数値 セレクトボックス 21 メモ note 文字列 改行可能なテキストボックス 最大100文字 メモは100文字以下で入力してください。 22 【作成中】帳票共通項目 で定める項目を持つ。 23 【作成中】帳票共通項目 で定める項目を持つ。 24 【作成中】帳票共通項目 で定める項目を持つ。 25 【作成中】帳票共通項目 で定める項目を持つ。 26 【作成中】帳票共通項目 で定める項目を持つ。 27 【作成中】帳票共通項目 で定める項目を持つ。 関連チケット CTJ-1009 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "715882497",
  "parentTitle": "■商品・契約",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705626113/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-13T08:37:27.562Z",
  "author": "ejiri_yusuke",
  "excerpt": "概要 クライアント企業による商品（ 【FIX】商品マスタ（統合版） ）の購入内容であり、対象商品やその数量、有効期間などを定義する。 全体管理画面またはクライアント企業向け管理画面で登録する。 ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】オプション申込・登録・解除フロー 【FIX】クライアント企業への請求・支払いフロー 詳細 項目名 変数名 値の形式 画面上..."
}