{
  "id": "709197835",
  "title": "（バックアップ）011_【作成中】求人一覧閲覧・検索機能",
  "content": "011_【作成中】求人一覧閲覧・検索機能 に最新版を記載したためこちらはバックアップとする。 1. 目次 2. 概要 本機能は帳票に記載の登録済みのデータを、教室が公開で求人が掲載の求人を一覧で閲覧/検索するための機能です。 3. 要求事項 エンドユーザーや会員は、エントリー済みなどを含む 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 に登録された求人のうち、教室が公開で求人が掲載の求人を一覧で閲覧することができる。（表示条件の詳細については 015_【作成中】教室および求人の公開/掲載の条件 を参照） ただし、「非公開」の求人に関しては一覧に表示しない。 ステーションサイトではステーション対象の求人のみ 、キャリアサイトではキャリア対象の求人のみを表示する。 3.1. 検索コンポーネント（サイドバー） ページ左部には検索フィルター用コンポーネントを表示する。ページスクロールに追従する。 検索フィルター用コンポーネントで各条件を指定し検索するボタンを押下することで、指定した条件で絞り込みを行い一覧を取得することができる。 一覧フィルター用コンポーネントの表示項目は下記の通りでAND検索とする。 本ページの「入力」の「検索コンポーネント」で入力元として「入力フォーム」が定義されている項目 ただし「勤務地」「指導形態」「特徴から選択」「新着/急募」の内部検索項目はすべてOR検索とする。 各フィルター項目が選択、変更されたタイミングで、リアルタイムで該当件数を取得し検索ボタンのテキストに表示し、検索件数が0件の場合は検索ボタンを非活性にする。 「選択をクリア」を押下すると全ての検索条件をクリアする。その段階ではまだ再読み込みはしない。 次の条件で検索結果をキャッシュする。 キャッシュのリフレッシュ期間は1日とする。 エリアで検索の場合は 地域 &gt;都道府県&gt;市区町村の単位で、駅・路線で検索の場合は地域＞都道府県＞路線＞駅の単位で検索結果をキャッシュする。 急募を含む検索上位30件をキャッシュする。 3.2. 検索モーダル モーダル表示時の速度向上のため、都道府県やエリアごとのヒット件数はキャッシュする。キャッシュのリフレッシュ期間は1日とする。 検索結果に該当するヒット件数は、チェックボックス等のボタンを押下するごとに APIを利用して リアルタイムで更新し 検索ボタン内に件数として表示する。 3.3. 求人カード／教室グループカード 一覧ページ上部には、以下を表示する。 検索条件に基づいた求人総数 「塾ブランドごとにまとめて表示」機能 機能詳細 同一の教室グループに紐づく求人は1つの教室グループのカードの中に表示する。 表示件数切替え セレクトボックスとし、選択肢は「10件」「20件」「30件」とする。デフォルトは「10件」とする。 新しい値が選択されると、その件数分の検索結果を表示する。 1ページあたりの表示数を選択された件数とし、表示対象のレコードがそれより多い場合は、ページネーションを一覧の下部に表示する。 一覧の求人情報カードは以下の条件で並べる 。 検索条件に合致する急募求人がある場合は 、 それ以外の全ての求人について、以下の条件で並べ替える 。 各求人情報カードには次の項目を表示する。 本ページの「要件定義」-「出力」 - 「求人カード」の項目 「求人詳細へ進む」ボタン。押下すると 012_【FIX】求人詳細閲覧機能 に遷移する。 3.4. サブコンテンツ 社員やプロ講師などの求人をお探しのたかはこちら 「キャリアTOP」ボタンを押下すると、 002_【作成中】キャリアトップ に遷移する。 ［地域］の社会人向け求人はこちら 都道府県または市区町村で絞り込んでいる場合、その地域名を含むバナーを表示する。 押下すると、その条件で絞り込んだキャリア求人の （バックアップ）011_【作成中】求人一覧閲覧・検索機能 が表示される。 バナー プレミアム 契約プランがプレミアムである企業の求人からランダムで選んだ6件を抽出し、それぞれの 【作成中】教室画像 の「スライドイメージ（１）」を表示する。表示順もランダムとする。 求人カード全体をリンクとし、 押下すると該当の求人の 012_【FIX】求人詳細閲覧機能 に遷移する。 デラックス 契約プランがデラックスである企業の求人からランダムで選んだ6件を抽出し、それぞれの 【作成中】教室画像 の「スライドイメージ（１）」を表示する。表示順もランダムとする。 求人カード全体をリンクとし、 押下すると該当の求人の 012_【FIX】求人詳細閲覧機能 に遷移する。 急募求人はこちら 現在の検索条件でヒットした求人のうち、 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在するものを4件表示する。 急募求人で絞り込んだ求人 を4件表示する。 並び順は公開日の降順とし、公開日が同一の求人については、更新時間の降順とする。 急募求人カード全体をリンクとし、 押下すると該当の求人の 012_【FIX】求人詳細閲覧機能 に遷移する。 出力で「急募求人はこちら」で定義している項目を表示する。 「ほかの急募求人を見る」ボタンを押下すると、 現在と同じ条件でかつ「急募」を選択してで絞り込んだ （バックアップ）011_【作成中】求人一覧閲覧・検索機能 に遷移する。 塾ブランド紹介コラム 塾ブランドをカテゴリにもつ記事のうち 、公開日が新しい記事を最大で3つ表示する。公開日が同一の記事があれば作成時間が新しいものを選ぶ。 表示項目は出力の「塾ブランドコラム」の内容とする。 記事カード全体をリンクとし、記事カードを押下すると 022_ 【作成中】記事詳細閲覧機能 に遷移する。 市区町村から探す 都道府県または市区町村の検索時に表示する。 都道府県で検索した場合はその都道府県の、市区町村で検索した場合はその市区町村を含む都道府県の、 配下の市区町村について一覧で表示し 、それぞれテキストリンクとし、押下するとその市区町村で絞り込んだ （バックアップ）011_【作成中】求人一覧閲覧・検索機能 を表示する。 地域の特徴・地域の塾講師求人の特徴 都道府県または市区町村での検索時に表示する。 よくある質問(FAQ) 都道府県または市区町村の検索時に表示する。 次の3つのFAQを表示する。それぞれのFAQの文頭には対象地域の地名を入れてFAQの内容を分かりやすくする。 塾講師バイトの時給はどのくらいですか？ 塾講師バイトにはどんな塾がありますか？ 対象地域の求人のうち、 【FIX】求人：基本情報 の「指導形態」が「集団指導（10名以上）」または「グループ指導（10名以下）」で絞り込んだ （バックアップ）011_【作成中】求人一覧閲覧・検索機能 を表示するためのリンクを設置する。 対象地域の求人のうち、 【FIX】求人：基本情報 の「指導形態」が「個別指導」で絞り込んだ （バックアップ）011_【作成中】求人一覧閲覧・検索機能 を表示するためのリンクを設置する。 大学生でも出来る塾講師バイトはありますか？ 対象地域の求人のうち、 【FIX】求人：応募条件・研修情報 の「歓迎」で「大学生歓迎」が選択されている （バックアップ）011_【作成中】求人一覧閲覧・検索機能 を表示するためのリンクを設置する。 3.5. 権限 エンドユーザーがログイン状態に関係なく利用できる 3.6. 帳票 【FIX】求人：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 【FIX】求人：勤務条件・指導科目 【作成中】記事 3.7. メールテンプレート なし 3.8. ワークフロー 3.8.1. 関連 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674234399/FIX#%E5%BF%9C%E5%8B%9F%E3%83%95%E3%83%AD%E3%83%BC 【FIX】オシゴトQ＆A登録・回答・公開・編集・非公開・評価フロー 4. 要件 定義 4.1. ユーザーインターフェース（画面） 4.1.1. 求人検索/一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=19233-1765&amp;mode=design&amp;t=FLIegDWTEG3zK2vm-0 4.1.2. SP画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=109167-58398&amp;mode=design&amp;t=CImEwH6fU7QirBqE-4 4.2. 入力 都道府県 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 に記載の共有入力・取得項目は省略する。 4.2.1. ページネーション・・ページ表示 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 ページ番号 &nbsp; URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 2 表示件数切り替え URLパラメータ／入力フォーム セレクトボックスとする。 選択肢は「10件」「20件」「30件」とする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「10件」とする。 任意項目。入力されていない場合は「10件」と判定する。 3 塾ブランドごとにまとめて表示 URLパラメータ／入力フォーム フィルター項目 チェックボックスによる単一選択とする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 任意項目。入力されていない場合はFalseと判定する。 4.2.2. 検索コンポーネント 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 勤務地 URLパラメータ／入力フォーム 選択肢 は 都道府県 とする。 チェックボックスによる複数選択とし、求人に紐づく教室の勤務地で絞り込む。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 追加ボタンを押下すると、勤務地選択モーダルが表示される。 「さらに表示する」を押下すると、現在選択中の勤務地で表示しきれない勤務地を全て表示することができる。 高速に検索するために、DBの対象テーブルのフィールドにインデックスを作成する 任意項目。チェックされていない場合はフィルタリングをおこなわない。 2 指導形態 URLパラメータ／入力フォーム チェックボックスによる複数選択とし、選択肢は 【FIX】求人：基本情報 の「指導形態」とする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 高速に検索するために、DBの対象テーブルのフィールドにインデックスを作成する 任意項目。チェックされていない場合はフィルタリングをおこなわない。 3 時給（最低時給） URLパラメータ／入力フォーム 単一選択のセレクトボックス。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何も入力されていないものとする。 選択肢は1,000円から3,000円まで500円刻みとする。 高速に検索するために、DBの対象テーブルのフィールドにインデックスを作成する 任意項目。入力されていない場合はフィルタリングをおこなわない。 4 時給（最高時給） URLパラメータ／入力フォーム 単一選択のセレクトボックス。初期状態は何も入力されていないものとする。 選択肢は3,000円まで10,000円まで1,000円刻みとする。 高速に検索するために、DBの対象テーブルのフィールドにインデックスを作成する 任意項目。入力されていない場合はフィルタリングをおこなわない。 5 勤務日数 URLパラメータ／入力フォーム 単一選択のセレクトボックス。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何も入力されていないものとする。 選択肢は 【FIX】求人：勤務条件・指導科目 の「勤務可能最低日数」に記載されている選択肢から選択することができる。 任意項目。入力されていない場合はフィルタリングをおこなわない。 6 勤務期間 URLパラメータ／入力フォーム 単一選択のセレクトボックス。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何も入力されていないものとする。 選択肢は「3ヶ月以上」「6ヶ月以上」「1年以上」 「最低勤務期間」に記載されている選択肢 から選択することができる。 【FIX】求人：勤務条件・指導科目 の「最低勤務期間」が選択された値以上の求人で絞り込む。 「短期OK」にチェックすると、 【FIX】求人：勤務条件・指導科目 の「勤務条件」内の「短期OK」が選択された状態になる。 任意項目。入力されていない場合はフィルタリングをおこなわない。 7 特徴から選択 8 指導特徴（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 選択肢は 【FIX】求人：基本情報 の「指導特徴」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 9 待遇（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：基本情報 の「待遇」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 10 勤務条件（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：勤務条件・指導科目 の「勤務条件」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 11 勤務可能曜日（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：勤務条件・指導科目 の「勤務可能曜日」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 12 指導学年（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：勤務条件・指導科目 の「指導学年」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 13 服装・髪型（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：勤務条件・指導科目 の「服装・髪型」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 14 応募資格（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：応募条件・研修情報 の「応募資格」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 15 歓迎（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：応募条件・研修情報 の「歓迎」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 16 選考方法（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：応募情報等 の「選考方法」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 17 塾の特徴（特徴） URLパラメータ／入力フォーム 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 表示する選択肢は 【FIX】求人：PR情報 の「PR情報：塾の特徴」を参照。 任意項目。入力されていない場合はフィルタリングをおこなわない。 18 フリーワード URLパラメータ／入力フォーム 初期状態は最後に入力したものを適切にHTMLエスケープ処理をして表示する。前に入力されたものがない場合は空欄とする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 19 新着/急募 URLパラメータ／入力フォーム チェックボックスとし、選択肢は 「新着」と「急募」とする 。 「新着」は掲載から2週間未満の求人とする。 「急募」は 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在するものとする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は何もチェックされていないものとする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4.3. 出力 なお金額を表示する場合は全て、3桁ごとのカンマ区切りとし末尾に「円」をつける。 4.3.1. 検索一覧 出力項目 出力先 説明 1 総求人件数 画面 指定されたフィルタリングを適用した、結果表示可能なデータの総件数をページ上部に表示する。 条件に該当する求人がなかった場合は「0」と表示する。 2 表示件数 画面 指定されたフィルタリングを適用した、結果表示可能なデータの総件数のうち、現在表示されている件数の範囲をページ上部に表示する。 3 ページ番号 画面 現在のページ番号を表示し、ハイパーリンクにはしない。 4 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して、1ページあたり10件の表示で計算した総ページ数をページ下部に表示する。 5 塾ブランドごとにまとめて表示 画面 入力された「塾ブランドごとにまとめて表示」を入力処理にて変換した値を利用し、対応するラベルで表示する。 6 表示件数切り替え 画面 入力された「表示件数切り替え」を入力処理にて変換した値を利用し、対応するラベルで表示する。 4.3.2. 検索フィルター用コンポーネント 出力項目 出力先 説明 1 勤務地 画面 入力された「勤務地」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「勤務地」のチェックボックスで初期選択状態とする。 2 指導形態 画面 入力された「指導形態」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「指導形態」のチェックボックスで初期選択状態とする。 3 時給（最低時給） 画面 入力された「時給（最低時給）」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「時給（最低時給）」のセレクトボックスで初期選択状態とする。 4 時給（最高時給） 画面 入力された「時給（最高時給）」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「時給（最高時給）」のセレクトボックスで初期選択状態とする。 5 勤務日数 画面 入力された「勤務日数」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「勤務日数」のセレクトボックスで初期選択状態とする。 6 勤務期間 画面 入力された「勤務期間」「短期OK」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「勤務期間」「短期OK」のセレクトボックスで初期選択状態とする。 7 指導特徴（特徴） 画面 入力された「指導特徴」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 8 待遇（特徴） 画面 入力された「待遇」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 9 勤務条件（特徴） 画面 入力された「勤務条件」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 10 勤務可能曜日（特徴） 画面 入力された「勤務可能曜日」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 11 指導学年（特徴） 画面 入力された「指導学年」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 12 服装・髪型（特徴） 画面 入力された「服装・髪型」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 13 応募資格（特徴） 画面 入力された「応募資格」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 14 歓迎（特徴） 画面 入力された「歓迎」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 15 選考方法（特徴） 画面 入力された「選考方法」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 16 塾の特徴（特徴） 画面 入力された「塾の特徴」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「特徴から選択」のチェックボックスで初期選択状態とする。 17 フリーワード 画面 入力された「フリーワード」を適切にHTMLエスケープ処理をして表示する。 18 新着/急募 画面 入力された「新着/急募」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「新着/急募」のチェックボックスで初期選択状態とする。 19 検索ボタン 画面 指定されたフィルタリングを適用した、結果表示可能なデータの総件数を検索ボタンに表示する。 条件に該当する求人がなかった場合は「0件」と表示する。 4.3.3. 求人カード 出力項目 出力先 説明 1 急募 画面 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在する場合に急募ラベルを表示する。 2 スライド画像 画面 データベースから取得した 【FIX】教室：ロゴ・スライド画像 の「スライド画像」を表示する。 3 求人タイトル 画面 データベースから取得した求人情報1レコードの「求人タイトル」を取得し、適切にHTMLエスケープしてテキストリンクとして表示する。押下すると 012_【FIX】求人詳細閲覧機能 に遷移する。 4 教室名 画面 データベースから取得した求人情報1レコードの「教室名」を取得し、適切にHTMLエスケープして表示表示する。 5 給与 画面 データベースから取得した求人情報1レコードの「給与形態」「給与形態：授業、コマ」「給与：最高時給」「給与：最低時給」を適切にHTMLエスケープして、「[給与形態][給与形態：授業、コマ][給与：最低時給]円〜[給与：最高時給]円」形式で表示する。 6 勤務地 画面 データベースから取得した求人情報1レコードの「都道府県」「市区町村」「最寄り駅名：最寄り駅1：駅名」「最寄り駅名：最寄り駅1：移動手段」「最寄り駅名：最寄り駅1：所要時間」を適切にHTMLエスケープして、「[都道府県][市区町村]（[最寄り駅名：最寄り駅1：駅名]より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]）形式で表示する。 7 指導形態 画面 データベースから取得した求人情報1レコードの「指導形態」を取得し、指導形態選択肢のラベルで表示する。 複数登録されていた際は句読点で連結して全て表示する。 8 雇用形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を取得し、雇用形態の選択肢のラベル名を表示する。 9 勤務条件 画面 データベースから取得した教室情報1レコードの「勤務条件」「勤務可能最低日数」を取得し、「[勤務条件]／「勤務可能最低日数」）形式で表示する。 「勤務条件」が複数登録されていた際は句読点で連結して全て表示する。 10 勤務時間 画面 データベースから取得した教室情報1レコードの「勤務時間：平日（開始時間）」「勤務時間：平日（終了時間）」「勤務時間：土曜（開始時間）」「勤務時間：土曜（終了時間）」「勤務時間：日曜（開始時間）」「勤務時間：日曜（終了時間）」を取得し、「[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）]、[勤務時間：土曜（開始時間）]〜[勤務時間：土曜（終了時間）]、[勤務時間：日曜（開始時間）]〜[勤務時間：日曜（終了時間）]」形式で表示する。 登録されていない勤務時間は表示しない。 11 求人キープボタン 画面 求人キープボタンを押すとキープ一覧に保存される。 その求人がキープに未登録の場合は白抜きマークが表示され、登録済みの場合は塗りつぶされたマークとする。 4.3.4. プレミアム・デラックスのバナー 出力項目 出力先 説明 1 画像（プレミアム） 画面 【作成中】教室画像 の「スライドイメージ（１）」を表示する。 2 画像（デラックス） 画面 【作成中】教室画像 の「スライドイメージ（１）」を表示する。 4.3.5. 急募求人はこちら 出力項目 出力先 説明 1 スライド画像 画面 保存された「スライドイメージ」のうち、「画像タイプ」で「サムネイル用」として保存された画像からを表示する。 表示枠を埋めるように、画像の縦横比を維持したまま画像サイズを調整・縮小し中央寄せで表示する。その結果として画像の上下または左右の部分が表示枠からはみ出た場合、その部分は表示しない（表示枠でトリミングする）。 スライド画像が1枚も登録されていない場合は、「No Image」の画像が表示される。 2 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 最大全角29文字まで表示され、30文字目に「&hellip;」が表示される。 3 給与 画面 保存された項目値を「[求人タイトル] [雇用形態]／[指導形態]／[給与形態：授業、コマ][給与：最低時給]〜[給与：最高時給]」形式で適切にHTMLエスケープして表示する。 4 最寄り駅 画面 その求人に紐づく教室の最寄駅名を全て「、」区切りで表示する。 4.3.6. 塾ブランドコラム 出力項目 出力先 説明 1 タイトル画像 画面 【作成中】記事 のタイトル画像のリンクを出力し画像を表示する。 2 タイトル 画面 【作成中】記事 のタイトルを適切にHTMLエスケープ処理を行い表示する。 4.3.7. 市区町村から探す 4.3.8. 地域の特徴 4.3.9. FAQ 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "703561854",
  "parentTitle": "010_■求人・教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709197835/011_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-02-15T10:22:53.987Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "011_【作成中】求人一覧閲覧・検索機能 に最新版を記載したためこちらはバックアップとする。 1. 目次 2. 概要 本機能は帳票に記載の登録済みのデータを、教室が公開で求人が掲載の求人を一覧で閲覧/検索するための機能です。 3. 要求事項 エンドユーザーや会員は、エントリー済みなどを含む 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 に登録された求人のうち、教室が公開で求人が掲載..."
}