{
  "id": "709263407",
  "title": "161_【FIX】教室一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者、が、登録されている 【FIX】教室：基本情報／所在地 一覧で閲覧することができる。 ギフト券担当者、記事管理者、記事担当者は閲覧することができない。 一覧ページ上部には、「教室新規登録」セレクトボックスを表示し、以下の項目を持つ。 「1件登録」ボタン 押下することで、 162_【FIX】教室新規登録機能 に遷移することができる。 「教室CSVアップロード」ボタン 押下することで、モーダルが表示され、 165_【FIX】教室-CSVアップロード機能 機能を使用することができる。 「最低賃金エラーCSVダウンロード」ボタン 押下することで、 179_【FIX】求人CSVダウンロード機能 を実行し、最低賃金を下回っている求人情報をCSV出力することができる。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「検索」ボタンを押下するまでフィルター項目の変更は適用されないものとする。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709263407#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 「検索」ボタン 一覧フィルター用コンポーネント下部には下記を表示する。 「教室CSVダウンロード」ボタン 押下することで、 161-1_【作成中】教室CSVダウンロード機能 を実行し、表示対象の教室情報をCSV出力することができる。 「求人CSVダウンロード」ボタン 押下することで、 179_【FIX】求人CSVダウンロード機能 を実行し、表示対象の教室情報に紐づく求人情報をCSV出力することができる。 「教室評点CSVダウンロード」ボタン 押下することで、 161-1_【作成中】教室CSVダウンロード機能 を実行し、表示対象の教室の教室評点情報をCSV出力することができる。 ページネーション（ページ移動のためのコンポーネント） 表示可能なレコードの総数 表示対象のレコード件数 一括更新設定リンク 一覧の各レコードには本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、教室情報レコードとして定義されている項目を表示する。 【FIX】教室：基本情報／所在地 の「教室 番号 」の降順で表示し、並べ替えを行うことはできなくて良い。 １ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 3.1. 権限 160_【FIX】教室管理機能 と同じ 3.2. 帳票 160_【FIX】教室管理機能 と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 160_【FIX】教室管理機能 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=3960-35025&amp;mode=design&amp;t=8BM1pNITuHKtemSH-0 4.2. 入力 160_【FIX】教室管理機能 に記載の共有入力・取得項目は省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 company_number URLパラメータ／入力フォーム フィルター項目 コンボボックス。初期状態は何も入力されていないものとする。 企業名を入力することによるサジェスト（ 121-2_【FIX】企業検索API 利用）で企業（企業番号）を選択できる。 選択肢は「企業コード_企業名」の形式で表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 2 教室 番号 classroom_number URLパラメータ／入力フォーム フィルター項目 １行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室 番号 」を 部分 完全 一致 でフィルタリングする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 3 教室名 name URLパラメータ／入力フォーム フィルター項目 １行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室名」を部分一致でフィルタリングする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4 教室グループ番号 brand_number URLパラメータ／入力フォーム フィルター項目 初期値はなし。 コンボボックスによる単一選択。 151-2_【FIX】教室グループ検索API を使い、テキストエリアに入力された文字列との中間一致で検索して抽出した教室グループを選択肢として表示し、表示された選択肢から選択することで「教室グループ番号」が入力される。 任意項目。入力されていない場合はフィルタリングをおこなわない。 5 都道府県 prefecture_id URLパラメータ フィルター項目 初期値はなし。 コンボボックスによる複数選択。 任意項目。入力されていない場合はフィルタリングをおこなわない。 6 教室プラン plan URLパラメータ フィルター項目 初期値なし 単一選択のセレクトボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室プラン」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 7 サービス種別 URLパラメータ フィルター項目 初期値なし 単一選択のセレクトボックスで入力し、 【FIX】教室：基本情報／所在地 の「対象サイト」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」 8 公開設定 &nbsp; URLパラメータ／入力フォーム 初期値は「すべて」。 セレクトボックスとし、選択肢は「すべて」「公開」「非公開」とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 9 ページ番号 &nbsp;page URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部と下部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり 50件 の表示で計算した総ページ数をページ上部と下部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部と下部に表示する。 4 教室情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した教室情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「 教室 情報：」プレフィックスで始まる出力項目として説明する。 5 教室情報：教室番号 画面 データベースから取得した教室情報1レコードの「教室番号」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 6 教室情報：教室ID 画面 データベースから取得した教室情報1レコードの「教室ID」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 7 教室情報：企業コード 画面 データベースから取得した教室情報1レコードの「企業コード」を適切にHTMLエスケープして表示する。詳細は 【FIX】企業：基本情報 を参照。 8 教室情報：企業名 画面 データベースから取得した教室情報1レコードの「企業名」を適切にHTMLエスケープして表示する。詳細は 【FIX】企業：基本情報 を参照。 9 教室情報：教室グループ名 画面 データベースから取得した教室情報1レコードの「教室グループ名」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室グループ を参照。 10 教室情報：教室名 画面 データベースから取得した教室情報1レコードの「教室名」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 11 教室情報：教室プラン 画面 データベースから取得した教室情報1レコードの「教室プラン」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 12 教室情報：サービス種別 画面 データベースから取得した教室情報1レコードの「サービス種別」の保存された値のラベルを表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 13 教室情報：更新日時 画面 データベースから取得した教室情報1レコードの「更新日時」を「yyyy/mm/dd」形式で表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 14 教室情報：編集ボタン 画面 押下することで、対象教室の 163_【FIX】教室情報編集機能 へ基本情報/所在地タブへ遷移する。 15 教室情報：求人ボタン 画面 押下することで、対象教室の 163_【FIX】教室情報編集機能 の求人タブへ遷移する。 16 教室情報：削除ボタン 画面 押下することで、対象教室の 164_【FIX】教室削除機能 を実行する。 17 教室情報：公開フラグ 画面 データベースから取得した教室情報1レコードの「公開フラグ」を設定ファイルから取得した公開フラグ選択肢のラベルで表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 18 教室情報：掲載フラグ 画面 データベースから取得した教室情報1レコードの「掲載フラグ」を設定ファイルから取得した公開フラグ選択肢のラベルで表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 公開非公開トグルの表示条件は、レコードの有無ではなく、必須項目に値が入力されているかどうかに基づいて判定する。 編集項目で登録されていな い 場合は、掲載フラグの欄に、登録されていない項目のラベルを表示する。 また列名を「未登録項目」とする。 19 教室情報： 教室プラン 対象サイト 画面 データベースから取得した教室情報1レコードの「対象サイト」が「キャリア」の場合、レコードをピンク色の背景色として表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 20 教室情報：急募 画面 該当教室配下の求人に紐づく有効な急募が1件でも存在する場合「急募中」と表示し、それ以外の場合は空白とする。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力欄に記載の項目（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709263407#4.2.-%E5%85%A5%E5%8A%9B ）の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が100,000を超えていた場合、100,000件を超えるレコードは無視し、以降は総件数を100,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の教室データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして教室番号の降順に並べて、指定されたページ番号に表示すべき教室情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read classroom list. page={ページ番号} company_number={企業番号} brand_number={教室グループ番号} classroom_number={教室番号} name={教室名} prefecture_id={都道府県} plan={教室プラン} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。 最後に閲覧していた 161_【FIX】教室一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "704053435",
  "parentTitle": "160_【FIX】教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709263407/161_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-31T08:22:09.945Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者、が、登録されている 【FIX】教室：基本情報／所在地 一覧で閲覧することができる。 ギフト券担当者、記事管理者、記事担当者は閲覧することができない。 一覧ページ上部には、..."
}