{
  "id": "709296160",
  "title": "171_【FIX】求人情報一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、教室ごとに登録されている 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 を一覧で閲覧することができる。 「表示順」の昇順で表示する。その際、値なしは最後とする。また、「表示順」が同じ場合は 登録日時の降順 で 掲載ステータスが「掲載」のものを優先して表示し、同じステータス内では更新日時の降順で 表示する。 並べ替え を行うことはできなくて良い。 ページの上部には次のボタンを配置する。 教室一覧へ戻るボタン 押下すると 161_【FIX】教室一覧閲覧機能 に遷移する。 新規登録ボタン その教室に紐づく求人がすでに3つある場合は、「1つの教室には、求人は3つまでしか作成できません」と画面上にエラーメッセージをダイアログで表示する。 上記でない場合は、押下すると 172_【FIX】求人情報新規作成機能 に遷移する。 一覧の各レコードには次の項目を表示する 本ページの「要件定義」-「出力」欄( https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709296160/171_+FIX#4.3.-%E5%87%BA%E5%8A%9B )で出力先として「画面」が定義されている項目の内、 求人情報配列 として定義されている項目 編集ボタン 押下すると 173_【FIX】求人情報編集機能（基本情報タブ） へと遷移 する。 掲載／非掲載ボタン 求人が掲載状態の場合は一覧画面の行には「非掲載」として、求人が非掲載状態の場合は「掲載」としてトグルボタンを表示する。 トグルボタンを押下して「掲載」とすると確認モーダルが表示され、「掲載する」を押下すると 176_【FIX】求人掲載フラグ切り替え機能（API） にて、 【FIX】求人：基本情報 における掲載フラグを「掲載」とする。 トグルボタンを押下して「非掲載」とすると確認モーダルが表示され、「非掲載にする」を押下すると、 176_【FIX】求人掲載フラグ切り替え機能（API） にて当該の求人の 【FIX】求人：基本情報 における掲載フラグを「非掲載」とする。 コピーボタン 押下すると 172_【FIX】求人情報新規作成機能 に遷移する。 削除ボタン 押下すると 177_【FIX】求人削除機能 へと遷移する。 キャリアに紐づく教室の求人一覧である場合は、レコードの背景色をピンク色とする。 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ 3.2. 帳票 170_【要求FIX】求人管理機能 の記載と同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 170_【要求FIX】求人管理機能 の記載と同じ。 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース （画面） 4.1.1. 一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=8515-63524&amp;mode=design&amp;t=2taTiSm1zL1TqEOY-4 4.1.2. 掲載確認モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=24282-20059&amp;mode=design&amp;t=swjATejuAj5XCSqs-4 4.1.3. 非掲載確認モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=24282-20120&amp;mode=design&amp;t=swjATejuAj5XCSqs-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション 企業番号 URLパラメータ 求人の一覧を絞り込み表示するために指定する企業番号。自然数の数字で指定する。 自然数以外が入力された場合は404ページを表示する 存在しない企業番号が指定された場合は404ページを表示する。 教室番号 URLパラメータ 求人の一覧を絞り込み表示するために指定する教室番号。自然数の数字で指定する。 自然数以外が入力された場合は404ページを表示する 存在しない教室番号が指定された場合は404ページを表示する。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 企業名 画面 表示する求人と紐づく企業名を表示し、その企業の 125_【FIX】企業詳細閲覧機能 へのテキストリンクとする。 教室グループ名 画面 表示する求人と紐づく教室グループ名を表示し、その教室グループの 153_【FIX】教室グループ詳細閲覧機能 へのテキストリンクとする。 教室名 画面 表示する求人と紐づく教室名を表示し、その教室の 163_【FIX】教室情報編集機能 へのテキストリンクとする。 対象サイト 画面 表示する求人と紐ずく対象サイト表示する。 求人情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した求人情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「求人情報：」プレフィックスで始まる出力項目として説明する。 求人情報：求人番号 画面 データベースから取得した求人情報1レコードの「求人番号」を適切にHTMLエスケープして表示する。 求人情報：表示順 画面 データベースから取得した求人情報1レコードの「表示順」を適切にHTMLエスケープして表示する。 求人情報：求人タイトル 画面 データベースから取得した求人情報1レコードの「求人タイトル」 の 最初の10文字 を 適切にHTMLエスケープして表示する。横幅が収まらない場合は折り返しで表示する。 テキストリンクとし、押下すると 517_【FIX】求人プレビュー 機能 に遷移する。 求人情報：雇用形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を適切にHTMLエスケープして表示する。 求人情報：給与 画面 データベースから取得した求人情報1レコードの「最低時給」と「最高時給」を適切にHTMLエスケープして表示する。 求人情報：給与形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を適切にHTMLエスケープして表示する。 求人情報：更新日 画面 データベースから取得した求人情報1レコードの「更新日」を適切にHTMLエスケープして表示する。 求人情報：急募 画面 該当求人に紐づく有効な急募が存在する場合「急募中」と表示し、それ以外の場合は空白とする。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「企業番号」 、「教室番号」(URLパラメーター)の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が0件だった場合、データがない旨を画面に表示する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、求人情報のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read job list. company_number={企業番号} classroom_number={教室番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。",
  "parentId": "704053484",
  "parentTitle": "170_【要求FIX】求人管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709296160/171_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-08T09:52:14.992Z",
  "author": "Numbered Headings",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、教室ごとに登録されている 【FIX】求人：基本情報 【FIX..."
}