{
  "id": "709361689",
  "title": "151_【FIX】教室グループ一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】教室グループ の登録済みのデータの一覧を 閲覧するための機能 です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者 、ゲスト管理者 が、登録されている 【FIX】教室グループ 一覧で閲覧することができる。 ギフト券担当者、記事担当者は 【FIX】教室グループ を一覧で閲覧することができない。 一覧ページ上部には、下記を表示する。 「新規登録」ボタン 押下することで、 152_【FIX】教室グループ新規作成機能 に遷移することができる。 一覧フィルター用コンポーネント 「検索」ボタン 「 条件から教室CSVダウンロード」ボタン 押下することで、 156_教室グループCSVダウンロード機能 を実行する。 本ボタンは 【FIX】全体管理者登録情報 の管理者種別が、「全体管理者」「塾講師ステーション管理者」「ゲスト管理者」のみに表示され、操作を行うことができる。 「記事管理者」は一覧を確認することはできるが、本ボタンは表示されておらず、操作を行うことができない。 表示可能なレコードの総数 表示対象のレコード件数 １ページあたりの表示数を 50件 とし、表示対象のレコードが 51件以上 の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は 下記の通り で全てAND結合とし、検索ボタンを押下するまでフィルター項目の変更は適用されないものとする。 絞り込み ボタン。押下することで変更されたフィルター項目の一覧適用を実行する。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709361689#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 一覧の各レコードには下記を表示する。 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、教室グループ情報レコードとして定義されている項目 「編集」ボタン 押下すると、 154_【FIX】教室グループ編集機能 に遷移する。 「削除」ボタン 押下すると、 155_【FIX】教室グループ削除機能 にて削除することができる。 3.1. 権限 150_【FIX】教室グループ管理機能 記載の通り 3.2. 帳票 150_【FIX】教室グループ管理機能 記載の通り 3.3. メールテンプレート 本機能で扱うメールテンプレートページへのリンクです 3.4. ワークフロー 3.4.1. 本機能 本機能の利用シーンを示しているワークフローへのリンクです 3.4.2. 関連 【FIX】教室登録・公開・削除フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=1933-33219&amp;mode=design&amp;t=UcPKicOqscjBXGK7-4 4.2. 入力 150_【FIX】教室グループ管理機能 に記載の共有入力・取得項目は省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 教室グループ名 URLパラメータ / 入力フォーム １行テキストボックスで入力し、 【FIX】教室グループ の「教室グループ名」を部分一致でフィルタリングする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 フィルター項目 共通要件 に記載されている文字列処理を適用し、文字制限以外の文字種制限は行わない。 2 ページ番号 &nbsp; URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部と下部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり 50件 の表示で計算した総ページ数をページ上部と下部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部と下部に表示する。 4 教室グループ情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した教室グループ情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「教室グループ情報：」プレフィックスで始まる出力項目として説明する。 5 教室グループ情報：教室グループID 画面 データベースから取得した教室グループ情報1レコードの「教室グループID」を表示する。 詳細は 【FIX】教室グループ を参照。 6 教室グループ情報：教室グループ番号 画面 データベースから取得した教室グループ情報1レコードの「教室グループID」を表示する。 詳細は 【FIX】教室グループ を参照。 7 教室グループ情報：教室グループ名 画面 データベースから取得した教室グループ情報1レコードの「教室グループ名」を適切にHTMLエスケープして表示する。 詳細は 【FIX】教室グループ を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力欄に記載の項目（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709361689#4.2.-%E5%85%A5%E5%8A%9B ）の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が30,000を超えていた場合、30,000件を超えるレコードは無視し、以降は総件数を30,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件のデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read brand list. page={ページ番号} brand _name={教室グループ名} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 最後に閲覧していた 151_【FIX】教室グループ一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "704413785",
  "parentTitle": "150_【FIX】教室グループ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709361689/151_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-08-16T09:07:22.505Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】教室グループ の登録済みのデータの一覧を 閲覧するための機能 です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者 、ゲスト管理者 が、登録されている 【FIX】教室グループ 一覧で閲覧することができる。 ギフト券担当者、記事担当者は 【FIX】教室グループ を一覧で閲覧することができない。 一覧ページ上..."
}