{
  "id": "713392189",
  "title": "431_【FIX】会員情報一覧閲覧・検索機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：設定情報（オファー・メール） 【レビュー中】会員：設定情報（希望条件） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、表示可能なレコードの総数を表示する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713392189#4.2.-%E5%85%A5%E5%8A%9B で入力元として「フィルター項目」が定義されている項目 検索みボタン 押下するとフィルター項目での一覧絞り込みを実行する。検索結果が1件もなかった場合は、「該当する会員情報が見つかりませんでした」と表示する。 CSVダウンロード 押下すると現在の検索条件で https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/894763040 を実行する。 一覧の各レコードには次の項目を表示する 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、会員情報レコード(下の出力欄の記載に合わせる)として定義されている項目 詳細ボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704053700 へと遷移する。 編集ボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704741457 へと遷移する。 3.1. 権限 要求事項の記述に同じ。 3.2. 帳票 概要の記述に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704479585 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 会員管理一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=77268-22678&amp;mode=design&amp;t=a0ZVUwTYd0YFa8sq-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション ページ番号 &nbsp; URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 ユーザー番号 URLパラメータ／入力フィルター 1行テキストボックスで入力し、会員のユーザー番号を 前方 完全一致 でフィルタリングする。 初期値はなし 任意項目。入力されていない場合はフィルタリングをおこなわない。 会員ID URLパラメータ／入力フィルター 1行テキストボックスで入力し、会員のIDを 前方 完全一致 でフィルタリングする。 初期値はなし 任意項目。入力されていない場合はフィルタリングをおこなわない。 氏名 URLパラメータ／入力フィルター 1行テキストボックスで入力し、会員の氏名を 前方 部分一致 でフィルタリングする。 初期値はなし 任意項目。入力されていない場合はフィルタリングをおこなわない。 メールアドレス URLパラメータ／入力フィルター 1行テキストボックスで入力し、メールアドレスを 完全一致 部分一致 でフィルタリングする。 初期値はなし 任意項目。入力されていない場合はフィルタリングをおこなわない。 都道府県 URLパラメータ／入力フィルター 単一選択のセレクトボックスで入力し、 都道府県 に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 大学名 URLパラメータ／入力フィルター 単一選択の コンボボックス で入力し、登録されている 大学名 に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 学年 URLパラメータ／入力フィルター 単一選択のセレクトボックスで入力し、 【FIX】会員：学歴情報 の「学年：大学」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 文理 URLパラメータ／入力フィルター 単一選択のセレクトボックスで入力し、 【FIX】会員：学歴情報 の「大学：文理」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 スカウト利用 URLパラメータ／入力フィルター 単一選択のセレクトボックスで入力し、 【FIX】会員：設定情報（オファー・メール） の「メール受信フラグ：スカウト通知」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 マッチ利用 URLパラメータ／入力フィルター 単一選択のセレクトボックスで入力し、 【FIX】会員：設定情報（オファー・メール） の「メール受信フラグ：マッチ通知」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期値はなし 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 メルマガ購読 URLパラメータ／入力フィルター チェックボックスで入力し、 【FIX】会員：設定情報（オファー・メール） の「メール受信フラグ：メルマガ購読」に記載されている選択肢から選択することができる。デフォルトは未選択。 初期値はなし 任意項目。入力されていない場合はフィルタリングはおこなわない。 退会 URLパラメータ／入力フィルター チェックボックスで入力し、「していない」かどうかを選択することができる。デフォルトは未選択。 「退会していない」を選ぶと、ステータスが 「利用停止」または 「退会」の会員を除いて表示する。 初期値はなし 任意項目。入力されていない場合はフィルタリングはおこなわない。 現在の職業 URLパラメータ／入力フィルター チェックボックスで入力し、 現在の職業 に記載されている選択肢から選択することができる。デフォルトは未選択。 初期値はなし 任意項目。入力されていない場合はフィルタリングはおこなわない。 登録日時 URLパラメータ／入力フィルター 認証日時（本登録日時）で絞り込む。 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分でのデートタイムピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付の0時から翌日の0時までを対象期間に入力する。 クリアボタンについては、「開始」ボタンを押下すると開始日時を初期値に戻す。「終了」ボタンを押下すると終了日時を初期値に戻す。「両方」ボタンを押下すると開始日時と終了日時を初期値に戻す。 初期値はなし 任意項目。入力されていない場合はフィルタリングはおこなわない。 最終ログイン日時 URLパラメータ／入力フィルター 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分でのデートタイムピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付の0時から翌日の0時までを対象期間に入力する。 クリアボタンについては、「開始」ボタンを押下すると開始日時を初期値に戻す。「終了」ボタンを押下すると終了日時を初期値に戻す。「両方」ボタンを押下すると開始日時と終了日時を初期値に戻す。 初期値はなし 任意項目。入力されていない場合はフィルタリングはおこなわない。 退会日時 URLパラメータ／入力フィルター 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分でのデートタイムピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付の0時から翌日の0時までを対象期間に入力する。 クリアボタンについては、「開始」ボタンを押下すると開始日時を初期値に戻す。「終了」ボタンを押下すると終了日時を初期値に戻す。「両方」ボタンを押下すると開始日時と終了日時を初期値に戻す。 初期値はなし 「利用停止」になったユーザーにも退会日時を入れるので、このフィルターは「利用停止」のユーザーも含む 任意項目。入力されていない場合はフィルタリングはおこなわない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 検索フィルター・ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 ユーザー番号 画面 入力された「ユーザー番号」を入力処理にて変換した値を適切なHTMLエスケープ処理を施して表示する。 会員ID 画面 入力された「会員ID」を入力処理にて変換した値を適切なHTMLエスケープ処理を施して表示する。 氏名 画面 入力された「氏名」を入力処理にて変換した値を適切なHTMLエスケープ処理を施して表示する。 メールアドレス 画面 入力された「メールアドレス」を入力処理にて変換した値を適切なHTMLエスケープ処理を施して表示する。 都道府県 画面 入力された「都道府県」を入力処理にて変換した値の対応するラベル名を表示する。 入会経路 画面 入力された「入会経路」を入力処理にて変換した値の対応するラベル名を表示する。 大学名 画面 入力された「大学名」を入力処理にて変換した値の対応するラベル名を表示する。 学年 画面 入力された「学年」を入力処理にて変換した値の対応するラベル名を表示する。 文理 画面 入力された「文理」を入力処理にて変換した値の対応するラベル名を表示する。 スカウト利用 画面 入力された「スカウト利用」を入力処理にて変換した値の対応するラベル名を表示する。 マッチ利用 画面 入力された「マッチ利用」を入力処理にて変換した値の対応するラベル名を表示する。 メルマガ購読 画面 入力された「メルマガ購読」を入力処理にて変換した値の対応するラベル名がチェックされた状態で表示する。 退会 画面 入力された「退会」を入力処理にて変換した値の対応するラベル名がチェックされた状態で表示する。 現在の職業 画面 入力された「現在の職業・学校」を入力処理にて変換した値の対応するラベル名がチェックされた状態で表示する。 登録日時 画面 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分について、入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートタイムピッカーで初期選択状態とする。 最終ログイン日時 画面 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分について、入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートタイムピッカーで初期選択状態とする。 退会日時 画面 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分について、入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートタイムピッカーで初期選択状態とする。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する。 出力項目 出力先 説明 会員ID・ユーザー番号 画面 データベースから取得した会員情報1レコードの「会員ID」と「ユーザー番号」を、文字列を変換せずにそのまま表示する。 テキストリンクとし、押下すると該当の会員の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704053700 に遷移する。 氏名 画面 データベースから取得した会員情報1レコードの「氏名」を適切にHTMLエスケープして表示する。 メールアドレス 画面 データベースから取得した会員情報1レコードの「メールアドレス」を適切にHTMLエスケープして表示する。 現在の職業 画面 データベースから取得した会員情報1レコードの「現在の職業」。保存された値が指し示す選択肢のラベルを出力する。 登録日時 画面 データベースから取得した会員情報1レコードの「登録日時」をyyyy/mm/dd h:i:s形式で表示する。 ステータス 画面 「退会」 または「利用停止」 の会員のレコードは背景色をグレーとする（カラムとしては表示しない）。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「会員ID」「会員コード」「氏名」「メールアドレス」「都道府県」「入会経路」「大学名」「学年」「文理」「スカウト」「マッチ」「メルマガ購読」「退会」「現在の職業」「登録日時」「最終ログイン日時」「退会日時」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が200,000を超えていた場合、以降は総件数を200,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件のデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき会員情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read user list. page={ページ番号} user_number={ユーザー番号} user_id={会員ID} user_name={氏名} user_email={メールアドレス} user_pref={都道府県} user_method={入会経路} user_university_name={大学名} user_grade={学年} user_major_type={文理} user_scout={スカウト利用} user_match={マッチ利用} user_subscribed={メルマガ購読} user_deleted={退会} user_current_job={現在の職業} user_signed_up_at={登録日時} user_last_logged_in_at={最終ログイン日時} user_deleted_at={退会日時} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "704479585",
  "parentTitle": "430_【作成中】会員管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713392189/431_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-05-12T02:38:54.001Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：設定情報（オファー・メール） 【レビュー中】会員：設定情報（希望条件） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ が、概要で挙げた帳票に登録されてい..."
}