{
  "id": "713556025",
  "title": "361_【作成中】カテゴリ一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【作成中】記事カテゴリ の登録済みのカテゴリデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、記事管理者のみが、登録されている 【作成中】記事カテゴリ を一覧で閲覧することができる。 ギフト券担当者、塾講師ステーション担当者、記事担当者は 【作成中】記事カテゴリ を一覧で閲覧することができない。 一覧ページ上部には、「全部開く」テキストリンク、「全部閉じる」テキストリンクを表示する。 「全部開く」テキストリンク 親カテゴリ、子カテゴリ双方の 362_【作成中】カテゴリ追加機能 363_【作成中】カテゴリ詳細閲覧機能 364_【作成中】カテゴリ編集機能 を開いた状態で 361_【作成中】カテゴリ一覧閲覧機能 表示する。 「全部閉じる」テキストリンク 親カテゴリ、子カテゴリ双方の 362_【作成中】カテゴリ追加機能 363_【作成中】カテゴリ詳細閲覧機能 364_【作成中】カテゴリ編集機能 を閉じた状態で 361_【作成中】カテゴリ一覧閲覧機能 表示する。 登録日時の降順で表示する。 登録されている 【作成中】記事カテゴリ の情報を一覧表示し、 【レビュー中】全体管理者登録情報 の管理者種別によって表示・操作できる項目は、本ページの「要件定義」-「入力」欄で入力元が「テキストリンク」と定義されている項目とする。 一覧の各レコードには本ページの「要件定義」- 「出力」欄で出力先として「画面」が定義されている項目の内、記事カテゴリ情報レコードとして定義されている項目を表示する。 一覧ページ下部には、「階層構造を元に戻す」テキストリンク、「階層構造を保存する」テキストリンク、「このページの最上部へ」テキストリンクを表示する。 「階層構造を元に戻す」テキストリンク 登録済みの 【作成中】記事カテゴリ をドラッグアンドドロップで別の親カテゴリに移動させた際に「階層構造を元に戻す」テキストリンクを押下すると移動させた情報は保存されずに前の状態に戻る。 「階層構造を保存する」テキストリンク 登録済みの 【作成中】記事カテゴリ をドラッグアンドドロップで別の親カテゴリに移動させた際に「階層構造を保存する」テキストリンクを押下すると移動させた情報が保存される。 3.1. 権限 360_【作成中】■カテゴリ管理機能 3.2. 帳票 360_【作成中】■カテゴリ管理機能 3.3. メールテンプレート 本機能で扱うメールテンプレートページへのリンクです ※親ページの定義に包含される場合は、親ページへのリンクを記載します 3.4. ワークフロー ※親ページの定義に包含される場合は、親ページへのリンクを記載します 3.4.1. 本機能 本機能の利用シーンを示しているワークフローへのリンクです 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） 該当するワイヤフレーム定義ページへのリンクです 4.2. 入力 360_【作成中】■カテゴリ管理機能 に記載の共通入力・取得項目は省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 全部開く テキストリンク 親カテゴリ、子カテゴリの中で1つ以上の 363_【作成中】カテゴリ詳細閲覧機能 が閉じている際に「全部開く」テキストリンクを押下することで、全てのカテゴリ詳細を表示することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 2 全部閉じる テキストリンク 親カテゴリ、子カテゴリの中で1つ以上の 363_【作成中】カテゴリ詳細閲覧機能 が開いている際に「全部閉じる」テキストリンクを押下することで、全てのカテゴリ詳細の表示を閉じることができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 3 親カテゴリ：アイコン編集 テキストリンク 364_【作成中】カテゴリ編集機能 を表示し、親カテゴリのみに対して「アイコン画像（PCサイト）」、「アイコン画像（スマホサイト）」を登録、編集ができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 4 親カテゴリ：詳細 テキストリンク 363_【作成中】カテゴリ詳細閲覧機能 を表示し、登録された「概要」、「関連リンクテキスト」、「関連リンクURL」、「アイコン画像（PC）」、「アイコン画像（スマホ）」を詳細閲覧することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 5 親カテゴリ：編集 テキストリンク 364_【作成中】カテゴリ編集機能 を表示し、「概要」、「関連リンクテキスト」、「関連リンクURL」の登録、編集ができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 6 親カテゴリ：無効化 テキストリンク カテゴリ有効フラグ切り替え機能を使用し、登録した 【作成中】記事カテゴリ を無効化することができる。 「無効化」テキストリンクを押下すると、「ステータスを更新しました」と確認ダイアログを表示し、「OK」を押下すると、登録した 【作成中】記事カテゴリ を無効化することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 7 親カテゴリ：有効化 テキストリンク カテゴリ有効フラグ切り替え機能を使用し、登録した 【作成中】記事カテゴリ を有効化することができる。 「有効化」テキストリンクを押下すると、「ステータスを更新しました」と確認ダイアログを表示し、「OK」を押下すると、登録した 【作成中】記事カテゴリ を有効化することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 8 親カテゴリ：追加 テキストリンク 362_【作成中】カテゴリ追加機能 を表示し、該当の親カテゴリの配下に子カテゴリを追加登録することができる。 登録項目は、「名称」、「概要」、「関連テキスト」、「関連リンクURL」とする。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 9 子カテゴリ：詳細 テキストリンク 363_【作成中】カテゴリ詳細閲覧機能 を表示し、登録された「概要」、「関連リンクテキスト」、「関連リンクURL」、「アイコン画像（PC）」、「アイコン画像（スマホ）」を詳細閲覧することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 10 子カテゴリ：編集 テキストリンク 364_【作成中】カテゴリ編集機能 を表示し、「概要」、「関連リンクテキスト」、「関連リンクURL」の登録、編集ができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 11 子カテゴリ：無効化 テキストリンク カテゴリ有効フラグ切り替え機能を使用し、登録した 【作成中】記事カテゴリ を無効化することができる。 「無効化」テキストリンクを押下すると、「ステータスを更新しました」と確認ダイアログを表示し、「OK」を押下すると、登録した 【作成中】記事カテゴリ を無効化することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 12 子カテゴリ：有効化 テキストリンク カテゴリ有効フラグ切り替え機能を使用し、登録した 【作成中】記事カテゴリ を有効化することができる。 「有効化」テキストリンクを押下すると、「ステータスを更新しました」と確認ダイアログを表示し、「OK」を押下すると、登録した 【作成中】記事カテゴリ を有効化することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 13 子カテゴリ：追加 テキストリンク 362_【作成中】カテゴリ追加機能 を表示し、該当の子カテゴリの配下に孫カテゴリを追加登録することができる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 14 階層構造を元に戻す テキストリンク 登録済みの 【作成中】記事カテゴリ をドラッグアンドドロップで別の親カテゴリに移動させた際に「階層構造を元に戻す」テキストリンクを押下すると移動させた情報は保存されずに前の状態に戻る。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 15 階層構造を保存する テキストリンク 登録済みの 【作成中】記事カテゴリ をドラッグアンドドロップで別の親カテゴリに移動させた際に「階層構造を保存する」テキストリンクを押下すると移動させた情報が保存される。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事管理者」のみに表示され、操作を行うことができる。 4.3. 出力 出力項目 出力先 説明 1 記事カテゴリ情報配列 画面 データベースから抽出した記事カテゴリ情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「記事カテゴリ情報：」プレフィックスで始まる出力項目として説明する。 2 記事カテゴリ情報：親カテゴリ名称 画面 データベースから取得した記事カテゴリ情報（親カテゴリ）1レコードの「名称」を適切にHTMLエスケープして表示する。詳細は 【作成中】記事カテゴリ を参照。 3 記事カテゴリ情報：親カテゴリID 画面 データベースから取得した記事カテゴリ情報（親カテゴリ）1レコードの「カテゴリID」。登録された「カテゴリID」文字列を（ID：{カテゴリID}）で表示する。詳細は 【作成中】記事カテゴリ を参照。 4 記事カテゴリ情報：子カテゴリ名称 画面 データベースから取得した記事カテゴリ情報（子カテゴリ）1レコードの「名称」を適切にHTMLエスケープして表示する。詳細は 【作成中】記事カテゴリ を参照。 5 記事カテゴリ情報：子カテゴリID 画面 データベースから取得した記事カテゴリ情報（子カテゴリ）1レコードの「カテゴリID」。登録された「カテゴリID」文字列を（ID：{カテゴリID}）で表示する。詳細は 【作成中】記事カテゴリ を参照。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "703529119",
  "parentTitle": "360_【作成中】■カテゴリ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713556025/361_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-08T01:52:53.856Z",
  "author": "Kenji Komukai (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 本機能は 【作成中】記事カテゴリ の登録済みのカテゴリデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、記事管理者のみが、登録されている 【作成中】記事カテゴリ を一覧で閲覧することができる。 ギフト券担当者、塾講師ステーション担当者、記事担当者は 【作成中】記事カテゴリ を一覧で閲覧すること..."
}