{
  "id": "713752653",
  "title": "271_【FIX】請求一覧閲覧・検索機能",
  "content": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 およびそれに紐づく 【FIX】請求：請求明細 【FIX】請求：請求書PDF の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが、登録されている 【修正中】請求：基本情報 を一覧で閲覧することができる。 一覧ページ上部には、下記を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数 新規登録ボタン 押下すると 272_【FIX】請求新規作成機能 に遷移する。 １ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は 下記である。 全てAND結合とし、検索ボタンを押下するまでフィルター項目の変更は適用されないものとする。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713752653#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 一覧レコード上部に表示する項目は以下の通りである。 検索ボタン 押下することで変更されたフィルター項目の一覧適用を実行する。 CSVダウンロードボタン 押下すると 277_【作成中】請求CSVダウンロード機能 を実行する。 一括PDF発行・承認ボタン 押下すると 276_【FIX】請求一括発行・承認機能 を実行する。 一括削除ボタン 一覧でフィルターした全てのレコードを対象 に 275_【FIX】請求情報削除機能 を実行する。 リセットボタン 押下すると一覧フィルター用コンポーネントの全ての入力項目を入力されていない状態に戻す。 一覧の各レコードには本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、請求情報レコードとして定義されている項目を表示する。 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみ 3.2. 帳票 270_■請求管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 270_■請求管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） 請求一覧 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=77194-21216&amp;mode=design&amp;t=VBpGKArJDYy8HnzB-0 4.2. 入力 変数名、説明、バリデーションは、 【修正中】請求：基本情報 【FIX】請求：請求書PDF 各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 URLパラメータ／入力フォー：フィルター項目 フィルター項目 コンボボックス。初期状態は何も入力されていないものとする。 企業名を入力することによるサジェスト（ 121-2_【FIX】企業検索API 利用）で企業（企業番号）を選択できる。 選択肢は「企業番号_企業名」の形式で表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 2 請求対象年月 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のセレクトボックスで入力し、年については 【修正中】請求：基本情報 の「請求対象年月：年」 に記載されている選択肢 2021年以降、月については 【修正中】請求：基本情報 の「請求対象年月：月」に記載されている選択肢から選択することができる。 デフォルトは未選択とする。 年については 【修正中】請求：基本情報 の「請求対象年月：年」 に記載されている選択肢、月については 【修正中】請求：基本情報 の「請求対象年月：月」に記載されている選択肢以外が入力された場合は、期間未設定と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合はフィルタリングはおこなわない。 3 FM請求集計ID URLパラメータ／入力フォー：フィルター項目 フィルター項目 1行テキストボックスで入力し、 【修正中】請求：基本情報 の「FM請求集計ID」を部分一致でフィルタリングする。 初期状態は何も入力されていないものとする。 共通要件 に記載されている文字列処理を適用し、文字制限以外の文字種制限は行わない。 文字数上限を全半角問わず5文字以下とし、5文字を超える場合もエラーは発生させないでフィルタリングをおこなわない。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4 承認状態 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のラジオボタンで入力し、「指定なし」「未承認」「承認済」から選択することができる。 デフォルトは未選択とする。 「指定なし」「未承認」「承認済」以外が入力された場合は「指定なし」と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合は「指定なし」と判定しフィルタリングはおこなわない。 5 発行状況 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のラジオボタンで入力し、「指定なし」「未発行」「発行済」から選択することができる。 デフォルトは未選択とする。 「指定なし」「未発行」「発行済」以外が入力された場合は「指定なし」と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合は「指定なし」と判定しフィルタリングはおこなわない。 6 DL状況 URLパラメータ／入力フォー：フィルター項目 フィルター項目 単一選択のラジオボタンで入力し、「指定なし」「DL未実行」「DL済」から選択することができる。 デフォルトは未選択とする。 「指定なし」「DL未実行」「DL済」以外が入力された場合は「指定なし」と判定し、どんな値が入力されてもエラーは発生させない。 任意項目。入力されていない場合は「指定なし」と判定しフィルタリングはおこなわない。 7 ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、 【修正中】請求：基本情報 【FIX】請求：請求書PDF 各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 企業番号 画面 入力された「請求先：企業番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「請求先：企業番号」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 5 企業名 画面 入力された「企業名」を入力処理にて変換した値を、フィルター用コンポーネント内の「企業名」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 6 請求対象年月 画面 入力された「請求対象年月」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「請求対象年月」のセレクトボックスで初期選択状態とする。 7 FM請求集計ID 画面 入力された「FM請求集計ID」を入力処理にて変換した値を、フィルター用コンポーネント内の「FM請求集計ID」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 8 発行状況 画面 入力された「発行状況」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「発行状況」のラジオボタンで初期選択状態とする。 9 DL状況 画面 入力された「DL状況」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「DL状況」のラジオボタンで初期選択状態とする。 10 承認状態 画面 入力された「承認状態」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「承認状態」のラジオボタンで初期選択状態とする。 11 請求情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した請求情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「請求情報：」プレフィックスで始まる出力項目として説明する。 12 請求情報：請求番号 画面 データベースから取得した請求情報1レコードの「請求ID」。登録された「請求ID」を変換せずにそのまま表示する。詳細は 【修正中】請求：基本情報 を参照。 13 請求情報：FM請求集計ID 画面 データベースから取得した請求情報1レコードの「FM請求集計ID」。登録された「FM請求集計ID」を適切にHTMLエスケープして表示する。詳細は 【作成中】企業：請求先・振込先マスタ を参照。 14 請求情報：企業番号 画面 データベースから取得した請求情報1レコードの「請求先：企業番号」。登録された「請求先：企業番号」を変換せずにそのまま表示する。詳細は 【修正中】請求：基本情報 を参照。 15 請求情報：企業名 画面 データベースから取得した請求情報1レコードの「企業名」。登録された「企業名」を適切にHTMLエスケープして表示する。詳細は 【FIX】企業：基本情報 を参照。 16 請求情報：請求対象年月 画面 データベースから取得した請求情報1レコードの「請求対象年月」。登録された「請求対象年月：年」と「請求対象年月：月」を、YYYY年MM月の形式で表示する。詳細は 【修正中】請求：基本情報 を参照。 17 請求情報：請求金額 画面 データベースから取得した請求情報1レコードの「請求金額」。登録された「請求金額」を変換せずに、文頭に「￥」をつけ、3桁ずつのカンマ区切りで表示する。詳細は 【修正中】請求：基本情報 を参照。 18 請求情報： ステータス 画面 データベースから取得した請求情報1レコードの「PDFファイルダウンロード日時」があれば「DL済み」、なくて「発行通知日時」があれば「発行通知済み」、なくて「承認日時」があれば「承認済み」、なくて紐ずく 【FIX】請求：請求書PDF がなければ「未承認」を表示する。 全てなければ「未発行」を表示する。 詳細は 【FIX】請求：請求書PDF を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「企業番号」「企業名」「請求対象年月」「承認状態」「発行状況」「DL状況」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が20,000を超えていた場合、以降は総件数を20,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の〇〇データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき請求情報情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read invoice list. page={ページ番号} company_number={企業コード} company_name={企業名} invoice_target_date={請求対象年月} approval_status={承認状態} notification_status={発行状況} download_status={DL状況} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "704414005",
  "parentTitle": "270_■請求管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713752653/271_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-11T07:12:05.797Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 およびそれに紐づく 【FIX】請求：請求明細 【FIX】請求：請求書PDF の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが、登録されている 【修正中】請求：基本情報 を一覧で閲覧することができる。 一覧ページ上部には、下記を表示する。 一覧フィルタ..."
}