{
  "id": "713883659",
  "title": "231_【FIX】採用確認一覧閲覧機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】応募情報 および 【レビュー中】採用お祝い申請 の登録済みのデータの一覧を 閲覧・更新するための機能 です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを 一覧で閲覧・更新 することができる。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 3.1.1. 一覧 フィルター コンポーネント 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。選択式のフィルター項目では、何も選択・入力していない状態を初期値とする。各フィルター項目は基本的にWFを参照し、特筆すべき内容を以下に記載する。また https://docs.google.com/spreadsheets/d/12e3xfdAyCsVDRWWcjNEJT8pNFXXFNsTWzOAzQqP-94c/edit#gid=0&amp;range=343:369 の「メニュー情報」で「応募管理」＞「メニュー内項目名」＞「採用確認」の行 も参照 すること。 企業名／企業番号 コンボボックスとし、企業名を入力することによるサジェスト（ 121-2_【FIX】企業検索API 利用）で企業（企業番号）を選択できる。 選択肢は「企業コード_企業名」の形式で表示する。 提出期限 「 今月末 」 の 絞り込みの条件は、以下のいずれかの条件を満たすものを対象とする。 絞り込みを実行した月の月末 の が提出期限の応募 で、提出ステータスが『未提出』の応募 。 提出期限が過ぎて（「期限超過」） おり、かつ提出ステータスが「未提出」の いる応募。 期限超過 提出期限が過ぎて（「期限超過」） おり、かつ提出ステータスが「未提出」の いる応募。 在籍確認 選択肢は「○」と「&times;： 退職済み 1か月以内退職 」の2種類とする。 採用確認状況 絞り込みの条件は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833/596+FIX+-?focusedCommentId=940671060 の「採用確認状況」と同じとする。 提出期限超過(累積) 「あり」で絞り込むと 【作成中】企業：集計情報 の「提出期限超過月数」が1以上の企業に紐ずく応募を表示する。 なしの場合は「提出期限超過月数」が0の企業に紐ずく応募を表示する。 3.1.2. 採用状況集計表 レコード一覧の上の採用状況集計表には次の項目を表示する クライアント要確認数(現在) 全応募のうち、提出期限が今月末かつ、提出ステータスが未提出または差し戻し中ものの総数を表示する。 未登録者数(現在) 全応募 クライアント要確認数(現在)のうち、採用ステータス（企業）が未登録のものの総数を表示する。 研修未定者数(現在) 全応募 クライアント要確認数(現在)のうち、採用ステータス（企業）が「採用」でかつ研修初日が未登録のものの総数を表示する。 在籍確認待ち数(現在) 全応募 クライアント要確認数(現在)のうち、採用ステータス（企業）が「採用」でかつ在籍確認が未登録のものの総数を表示する。 トモノカイ要確認数(現在) 提出ステータスが提出中で確認完了が未完了のものの総数を表示する。 当月請求確定者数 全応募のうち、請求確定日が今月のものの総数を表示する。 追加確認数 全応募のうち、 【FIX】応募情報 で「 追加確認理由」 が登録されているものの総数を表示する。 3.1.3. 各レコード表示 レコード一覧の上に表示されているソート機能で、応募日、教室名でソートすることができる。 選択されていない方のソート順のテキストはテキストボタンとする。 デフォルトは「応募日」で、応募日の降順とする。 「教室名」を押下すると教室名の降順でのソートに切り替わる。 レコード一覧の上に次のボタンを表示する 確認完了一括チェック 押下すると、 現在フィルタリングされている全て のレコードの確認完了にチェックが入る。 一覧の各レコードに表示する項目は基本的に WF を参照し、特筆すべき内容のみここで記載する。 背景色 提出ステータスが「完了」の場合、背景をグレーとする。 レコード毎に背景を白と薄い青色を交互に表示する 教室区分が「キャリア」の場合、背景を薄いピンクとする。 アイコン 赤丸ドッキリマーク： 追加確認理由 が選択されている場合に表示する。 緑三角マーク：採用不一致が発生している場合に表示する。 なお不一致の条件は、 763_【FIX】採用お祝い自動承認・関連メール送信バッチ で不一致メールを送る条件と同じある。 ロックマーク： 提出ステータスが「提出中」の場合に表示する。 企業側からすでに在籍確認の提出があった 場合に表示する。 提出ステータスが「完了」または確認完了が「完了」の場合 に表示する。 教室名 確認完了にチェックが入っていなければ 同じ企業・ 同じ教室グループ・ 同じ対象サイト の他の教室に変更できるようコンボボックス とする。チェックが入っていれば変更できずただのテキスト表示とする。 異なる教室グループの教室へ変更した場合 、該当の 【FIX】応募情報 に紐づく 【FIX】請求：請求明細 で設定されている商品（ 【FIX】商品マスタ（統合版） ）、契約（ 【FIX】契約情報（統合版） ）およびそれらに連動して定まる項目（単価など）をすべて、 変更後の教室グループに紐づくもの へ変更する （ これは、 【FIX】応募情報 に紐づく 【FIX】請求：請求明細 自体を変更（付け替える）ことで実現する） 。ただし、変更後の教室グループにおいて、変更前と 同じ課金形態種別 かつ指定した雇用形態の有効な契約が存在しない場合は、変更できないものとする。 変更が完了したら （共通）請求関連共通処理 を併せて実施する。 教室名の横の※をクリックするとその教室が属する 企業で絞り込まれた 221_【FIX】企業別採用一覧閲覧機能 に遷移する。 氏名 氏名をテキストリンクとし、クリックすると 433_【作成中】会員情報詳細閲覧機能 に遷移する。 指名の横の♯ボタンをクリックすると、その会員で絞り込まれた 231_【FIX】採用確認一覧閲覧機能 に遷移する。 選考状況 保存されている値のラベルを表示する。ただし、保存されている値が無い（NULL）状態は「未登録」という名称として表示され、選択できる。 【FIX】応募情報 の「選考状況」の選択肢から選択できる。 「採用ステータス（クライアント企業）」で「採用、不合格、連絡取れず、辞退、欠席、保留」が選択された場合は入力を必須とする。このとき、入力されていない状態の場合は「選考状況を選択してください」というメッセージを表示する。 採用ステータス 【FIX】応募情報 の「採用ステータス（クライアント企業）」の選択肢から選択できる。 「対象外」が選択された場合は、提出ステータスは「完了」となる。 「採用」で提出後は、採用ステータスを変更することは出来ない。 研修初日 登録されている日時がすでに表示されている入力欄を押下するとデートピッカーを表示し、そこで選択されて日時を該当の入力欄に更新する。 入力した研修初日が前月で、かつ1ヶ月経過していない場合は在籍確認を入力しなくても 更新できる。 採用ステータスで「採用」の場合、研修初日が空欄の場合は「未定」と表示する。 ただし、 761_【FIX】採用確認月次バッチ の応募データ更新処理10、12実行後、採用ステータスが「採用」でも、研修初日の「未定」テキストを非表示にする。 研修初日が「未定」、もしくは「日付あり」の場合は 【FIX】応募情報 の「研修初日回答済みフラグ」が「True」となる。 追加確認理由 選択肢 は以下の通りとする。 退職日時未記入 採用お祝い不一致 採用お祝い申請が来ていない応募では選択肢に表示されないようにする 応募重複確認 その他 理由を選択すると、 クライアント用メモ欄 に追加確認内容を記載する。 更新ボタンを押して更新される場合、その応募があった教室の企業担当者に 追加確認の旨を通知する 追加確認メール（クライアント） を送信する 。また 【FIX】応募情報 の「提出ステータス」を「差し戻し」に変更する。 追加確認理由を選択し、更新が行われた際のクライアント画面での編集可否は以下のとおりとする。 採用ステータスが「採用以外」の場合 すべての項目（採用ステータス／研修初日／在籍確認／備考）は編集可能。 採用ステータスが「採用」の場合 「研修初日」「在籍確認」がともに空欄の場合 採用ステータスのみ編集不可、それ以外は編集可能。 「研修初日」が入力済みで「在籍確認」が空欄の場合 採用ステータスおよび研修初日は編集不可、在籍確認・備考は編集可能。 「研修初日」と「在籍確認」がともに入力済みの場合 採用ステータスおよび研修初日は編集不可、在籍確認・備考は編集可能。 期限超過数 その教室 の応募管理のうち、期限超過の総数を表示する。 期限超過の条件は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833/596+FIX+-?focusedCommentId=951943329 の条件と同じとする。 お祝い超過 【レビュー中】採用お祝い申請 での「研修開始日」から1ヶ月後の同じ日付以降であれば「お祝い超過」と表示する。 最終提出日時 クライアント企業管理画面から提出されるたびに「最終提出日時」を更新する。 提出ステータスが変更されても「最終提出日時」を保持し表示する。 請求確定日 変更ボタンを押下するとデートピッカーを表示し、そこで選択されて日時を該当のセルに更新する。 更新ボタンを押して更新される場合、請求対象年月が変わるので （共通）請求関連共通処理 を行う。 在籍確認 596_【FIX】応募・採用管理 - 一覧閲覧機能 の通りとする。 ただし、全体管理画面では、「採用課金：確定時期」で判定する必須項目バリデーションは行わないものとする。 繰越し 提出期限が来月以降ならボタンを非活性とする。 押下すると、 【FIX】応募情報 の「提出期限」をすでに登録されているものの翌月末日に設定する。 重複したクリックを防ぐために、1回押下するとボタンを非活性とする。 押下すると確認完了にチェックを入れる。 保留月数 その教室への全ての応募のうち、採用ステータスが「保留」となっているものの総数を表示する。 【FIX】応募情報 の保留月数を表示する。 採用お祝い申請 その応募に紐づく採用お祝い申請がある場合は 242_【FIX】採用お祝い申請詳細閲覧・編集機能 へのテキストリンクを表示する。 提出期限 期限前の場合は期限までの日数を表示をする。 超過しており、かつ提出ステータスが「未提出」の場合は「期限超過」を表示する。 それ以外の場合は提出期限の日付を表示する。 管理者用メモ 押下するとポップアップ画面が表示され、メモを入力することができる。キャンセルボタンを押下するとそのままポップアップ画面が閉じ、 入力 ボタンを押下すると入力したメモをセルに更新する。 備考 押下するとポップアップ画面が表示され、備考を入力することができる。キャンセルボタンを押下するとそのままポップアップ画面が閉じ、 入力 ボタンを押下すると入力した備考をセルに更新する。 確認完了 全体管理者がそのレコードをチェックしたかどうかを入力する。 チェックをつけた段階で、提出ステータスが「未提出」（または「提出中」）かつ採用ステータスが「未登録」の場合、「採用ステータスが未登録のため確認完了できません」のエラーが表示され、更新はできない チェックをつけた段階で、提出ステータスが「未提出」（または「提出中」）かつ採用ステータスが「採用」かつ研修初日が「1ヶ月後の同日以上経過」かつ在籍確認欄が「空欄」の場合、「在籍確認を選択してください」のエラーが表示され、更新はできない チェックをつけた段階で、採用ステータスが「採用」かつ研修初日が空欄の場合、「研修初日を入力してください」のエラーが表示され、更新はできない チェックをつけた段階で、追加確認理由を空欄の状態から理由選択した場合、「確認完了は追加確認理由が変更されているためONにできません」のエラーが表示され、更新はできない 最終変更者 全体管理者の場合はその氏名を表示する。 クライアント管理者は「Client : ＄ユーザー番号＄」とし、 133_【FIX】企業担当者詳細閲覧機能 へのテキストリンクとする。 システムの場合は「system」と表示する。 各レコードでは、レコードのどれかのカラムでも編集した場合は背景色を黄色とする。 3.1.4. 研修初日選択モーダル デートインプットで日付を選択できる。 3.1.5. 管理メモ・備考入力モーダル テキストエリアで管理メモ・備考を入力できる。 3.1.6. 更新処理 更新ボタンを押下すると確認モーダルを表示する。確認モーダルの文章は「背景色が黄色のレコードが更新されます。問題ないですか？」とする。 キャンセルボタンを押下することでモーダルを閉じる。 確認モーダル中の「更新する」を押下すると入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければそのまま編集した入力フォームの内容をデータベースに保存し、システム全体に適用し、編集完了のポップアップを表示する。 提出内容によって提出期限を以下の通り更新する。 採用ステータス「採用」、研修初日「未定」or採用ステータス「保留」で提出した場合、提出した月の翌月末に更新する。 採用ステータス「採用」、研修初日「当月」で提出した場合、提出した月の翌月末に更新する。 採用ステータス「採用」、研修初日「当月以降」で提出した場合、入力した研修初日の「日付」の翌月末に更新する。 全体管理画面において、採用ステータスが「採用」として登録されているレコードを「未登録」に変更した場合、提出期限を以下の通り更新する。 応募日が更新月月初未満の場合は、更新月末を提出期限とする。 応募日が更新月月初以降の場合は、更新月の翌月末を提出期限とする。 本機能からメールを送信した際、 【作成中】メール送信履歴 を保存する。 3.1. 権限 要求に従う。 3.2. 帳票 概要に従う。 3.3. メールテンプレート なし 3.4. ワークフロー 親ページのリンクを貼る の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=52768-50296&amp;mode=design&amp;t=PhdsSre09QR5f7e5-0 4.1.2. 研修初日選択モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=112243-30074&amp;mode=design&amp;t=h4RKGub2bmPS5I25-4 4.1.3. 管理メモ入力モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=112243-21255&amp;mode=design&amp;t=h4RKGub2bmPS5I25-4 4.1.4. 備考入力モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=112385-30150&amp;mode=design&amp;t=alEg2l1ggTBu9n92-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read hiring check list. page={ページ番号} company_number={企業番号} classroom_number={教室番号} classroom_name ={教室名} classroom_plan={教室プラン} user_number={会員番号} user_name={氏名} email_address={メールアドレス} application_number={応募番号} hiring_status={採用ステータス} submission_due={提出期限} enrollment_confirmation={在籍確認} confirmation={確認完了} hiring_confirmation={採用確認状況} overdue_cumulative={提出期限超過(累積)} pending_month={保留月数} first_training_undecided={研修初日未定} employment_celebration_application={採用お祝い申請} disagreements_only ={不一致のみ} submission_status={提出ステータス} application_date={応募日時} final_submission_date={最終提出日時} first_training_date={研修初日} updated_date={更新日時} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 編集処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {全体管理者のユーザー番号} updated application on hiring check list. application_number={応募番号} hiring_status_change={[応募番号, 変更前の値, 変更後の値][]} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {全体管理者のユーザー番号} failed to update application on hiring check list. application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項",
  "parentId": "704381195",
  "parentTitle": "230_■採用確認管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713883659/231_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-27T07:20:36.930Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】応募情報 および 【レビュー中】採用お祝い申請 の登録済みのデータの一覧を 閲覧・更新するための機能 です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを 一覧で閲覧・更新 することができる。 1ページあたりの表示数を5..."
}