{
  "id": "713916417",
  "title": "211_【FIX】応募一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルターの上に次のボタンを表示する 「応募一覧CSVダウンロード」ボタン 押下すると 214_【不要】応募情報CSVダウンロード機能 を実行する。 一覧フィルター用コンポーネントの表示項目は下記の通りで、全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの 「要件定義」-「入力」 欄 で入力元として「入力フォーム：フィルター」が定義されている項目 検索ボタン 「CSVダウンロード」ボタン 検索ボタンを押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、「該当する応募が見つかりませんでした」と表示する。 CSVダウンロードボタンを押下することで、押下すると絞り込んだ内容で 214_【不要】応募情報CSVダウンロード機能 を実行する。検索結果が1件もなかった場合はダウンロードは実行されず、データがありません、とポップアップを表示する。ポップアップには閉じるボタンを配置し、ボタンを押下するとポップアップを閉じる。 一覧の各レコードには以下の項目を表示する。 本ページの 「要件定義」-「出力」欄 で 出力先として「画面」が定義されている項目のうち、応募情報レコードとして定義されている項目 編集ボタン 押下すると 213_【FIX】応募編集・詳細閲覧機能 へ遷移する。 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ 3.2. 帳票 210_■応募管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 210_■応募管理機能 の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=17775-41984&amp;mode=design&amp;t=9Ub0qrmnHIKvRfaH-4 4.2. 入力 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 ページ番号 &hellip; URLパラメータ &hellip; &hellip; 2 氏名 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、 紐づく 【FIX】会員：プロフィール情報 の「氏名」を 完全 中間一致 でフィルタリングする。 【FIX】応募情報 の「応募時会員情報」の中間一致でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 3 会員ID 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、紐づく 【FIX】会員：アカウント情報 の 「会員ID」を完全一致でフィルタリングする。 【FIX】応募情報 の「会員ID」の完全一致でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4 メールアドレス 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、紐づく 【FIX】会員：アカウント情報 の 【FIX】応募情報 の「メールアドレス」を 完全一致 でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 5 雇用形態 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】求人：基本情報 の「雇用形態」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 6 企業名 入力フォーム：フィルター、URLパラメータ 121-2_【FIX】企業検索API を利用したコンボボックスでの入力とし、入力された文字列に 「企業名」が前方一致する 選択肢をセレクトボックスの選択肢とする。 選択肢にはそれぞれの企業の企業名を表示しつつ、値として企業番号を持たせる。 選択された企業番号を持つ企業でフィルタリングする。 選択された企業名に紐づく 【FIX】企業：基本情報 の「企業名」を 完全一致 でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 7 教室名 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、紐づく 【FIX】教室：基本情報／所在地 の「教室名」を 完全 中間一致 でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 8 現在の職業 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】会員：プロフィール情報 の 「現在の職業」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 9 学年 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】会員：学歴情報 の「大学：学年」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 10 教室プラン 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】教室：基本情報／所在地 の 「教室プラン」に記載されている選択肢と「すべて」から選択することができる 。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 11 オファー応募 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】オファー履歴 の「オファー種別」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 選択されたオファー種別のオファーメッセージを、応募した会員に対して応募先の教室から送信しており、かつ応募前にそれを開封している、という条件で絞り込む。 【FIX】応募情報 の「オファー応募」の項目で絞り込む。 任意項目。入力されていない場合はフィルタリングをおこなわない。 12 サービス種別 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、「ステーション」「キャリア」「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 13 応募日時 入力フォーム：フィルター、URLパラメータ 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分でのデートタイムピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付の0時から翌日の0時までを対象期間に入力する。 クリアボタンについては、「開始」ボタンを押下すると開始日時を初期値に戻す。「終了」ボタンを押下すると終了日時を初期値に戻す。「両方」ボタンを押下すると開始日時と終了日時を初期値に戻す。 初期状態 は最後に入力したものを表示する。 前に入力されたものがない場合は現在の時間から1ヶ月前までの期間を入力する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4.3. 出力 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 応募番号 画面 入力された「応募番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「応募番号」のテキストボックスに表示する。 5 氏名 画面 入力された「氏名」を入力処理にて変換した値を、フィルター用コンポーネント内の「氏名」のテキストボックスに表示する。 6 会員ID 画面 入力された「会員ID」を入力処理にて変換した値を、フィルター用コンポーネント内の「会員ID」のテキストボックスに表示する。 7 メールアドレス 画面 入力された「メールアドレス」を入力処理にて変換した値を、フィルター用コンポーネント内の「メールアドレス」のテキストボックスに表示する。 8 雇用形態 画面 入力された「雇用形態」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「雇用形態」のセレクトボックスで初期選択状態とする。 9 企業名 画面 入力された「企業名」を入力処理にて変換した値を、フィルター用コンポーネント内の「企業名」のテキストボックスに表示する。 10 教室名 画面 入力された「教室名」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「教室名」の テキストボックス セレクトボックス で初期選択状態とする。 11 現在の職業 画面 入力された「現在の職業」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「現在の職業」のセレクトボックスで初期選択状態とする。 12 学年 画面 入力された「学年」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「学年」のセレクトボックスで初期選択状態とする。 13 教室プラン 画面 入力された「教室プラン」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「教室プラン」のセレクトボックスで初期選択状態とする。 14 オファー応募 画面 15 応募日時 画面 検索期間の開始日時と終了日時について、それぞれ年・月・日・時・分について、入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートタイムピッカーで初期選択状態とする。 16 応募情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した応募情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「応募情報：」プレフィックスで始まる出力項目として説明する。 17 応募情報：応募番号 画面 データベースから取得した応募情報1レコードの「応募番号」を表示する。 18 応募情報：教室名 画面 データベースから取得した応募情報1レコードの「教室名」を適切にHTMLエスケープして表示する。 19 応募情報： 雇用形態 画面 データベースから取得した応募情報1レコードの「雇用形態」の保存された値に対応するラベル名を表示する。 20 応募情報： 指導形態 画面 データベースから取得した応募情報1レコードの「指導形態」の保存された値に対応するラベル名を表示する。 21 応募情報： 応募者氏名（会員ID） 画面 データベースから取得した応募情報1レコードの「応募者氏名」と「会員ID」を、適切にHTMLエスケープして表示する。 22 応募情報：採用ステータス 画面 データベースから取得した応募情報1レコードの「採用ステータス（クライアント企業）」の保存された値に対応するラベル名を表示する。 23 応募情報：応募日時 画面 データベースから取得した応募情報1レコードの「作成日時」をYYYY/MM/DD hh:mm 形式で表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「名前」「会員ID」「メールアドレス」「雇用形態」「企業名」「教室名」「現在の職業」「学年」「教室プラン」「オファー種別」「サービス種別」「応募時間」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が 200,000 を超えていた場合、以降は総件数を200,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の応募データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき応募情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットで ログを出力する User {全体管理者のユーザー番号} read application list. page={ページ番号} user_id={会員ID} email_address={メールアドレスを匿名化して出力} employment_type={雇用形態} company_name={企業名} classroom_name={教室名} current_job={現在の職業} grade={学年} plan={教室プラン} offer_type={オファー種別} site={サービス種別} application_created_at={応募時間} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。 最後に閲覧していた 211_【FIX】応募一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "704545010",
  "parentTitle": "210_■応募管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713916417/211_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-14T03:54:43.987Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション(ページ移動のためのコンポーネント..."
}