{
  "id": "714211558",
  "title": "112_【FIX】契約新規追加機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の新規データを1件を新規登録するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが、 【FIX】契約情報（統合版） のデータを新規登録することができる。 本機能へは、下記の導線で遷移する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163 からの遷移 企業がフィルタリングされていない状態で「新規登録」ボタンを押下した場合 本機能に遷移する。 企業がフィルタリングされた状態で「新規登録」ボタンを押下した場合 該当の企業の企業番号をURLパラメータに付与した状態で本機能に遷移する。 113_【修正中】契約詳細閲覧機能 からの遷移（「更新用契約の作成」ボタンを押下した場合） 閲覧していた契約の紐づく商品種別によって、商品種別欄が選択された状態で本機能へ遷移する。 選択された状態は、変更不可とする。 基本または課金形態の場合、「基本・課金形態」が選択される。 オプションの場合、「オプション」が選択される。 閲覧していた契約における 下記項目または、（下記項目を割り当てるための）閲覧していた契約の契約番号を、URLパラメータへの入力 として本機能に遷移する。 前契約 ：契約番号 閲覧していた契約が基本または課金形態の場合 閲覧していた契約の「契約番号」を、本機能の「前契約：契約番号」に割り当て、変更不可とする。 閲覧していた契約がオプションの場合 値は設定しない。 企業番号 閲覧していた契約と同じ値を割り当てる、変更不可とする。 教室グループ番号 閲覧していた契約と同じ値を割り当て、変更不可とする。 商品 閲覧していた契約が基本契約の場合 閲覧していた契約と同じ商品を商品（基本契約欄）として割り当て、本機能の画面上で変更可能とする。 閲覧していた契約の子契約で商品種別が課金形態の商品をすべて商品（課金形態欄）として割り当て 、本機能の画面上で変更可能とする 。 閲覧していた契約が課金形態の場合 閲覧していた契約と同じ商品を商品（課金形態欄）として割り当て、本機能の画面上で変更可能とする。 閲覧していた契約がオプションの場合 閲覧していた契約と同じ商品を商品として割り当て、本機能の画面上で変更可能とする。 請求先・振込先 閲覧していた契約が基本契約の場合 閲覧していた契約と同じ請求先・振込先を割り当て、本機能の画面上で変更可能とする。 有効期間：開始日時 閲覧していた契約の「有効期間：終了日時」の値を初期値として割り当て、本機能の画面上で 変更可能とする 。 新規登録にあたって入力フォームに表示し入力可能とする項目は下記とする。 「一覧に戻る」ボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163 に遷移する。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558#4.2.-%E5%85%A5%E5%8A%9B ）で入力元が「入力フォーム」と定義されている項目 「登録する」ボタン 押下すると入力項目に問題なければ、データベースにレコードを保存し、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163 ページへ遷移して、保存したことが利用者にわかるメッセージを表示する。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 新規登録においては、下記の 制限 を設ける。 商品種別が「 基本 」の商品を選択した場合 既存の有効な契約に対して、企業、教室グループ、商品の商品種別、 商品の対象サイト、 契約期間（一部の期間でも）、が 同じ複数の契約が同時に存在できない 。 同じ契約を作成しようとした場合、ユーザーが確認の上、重複する既存の契約を 自動的に無効にすること で、作成できる。 重複する契約の「登録する」ボタンを押下した際に重複確認用のダイアログが表示され、「無効にして登録する」を押下することで無効にできる。 契約開始日は、 登録完了日時が自動で設定される。 以下の通りとする。 下記のいずれかの設定方法を選択可能とする。 登録完了日時が自動で設定される。 操作日の当日以降で設定可能とする。 ただし、更新用契約の作成用として本機能へ遷移してきた場合は、更新用の入力定義に従うものとする。 契約終了日は、 指定した商品の有効期間が反映された 終了日 になる。（自動で設定され、変更できない） 指定した商品の有効期間が反映された終了日以前、かつ契約開始日以降の範囲で設定可能とする。（指定した商品の有効期間が初期値として自動で設定されるが、変更できる） 商品種別が「課金形態」の商品を選択した場合 親基本契約として有効な基本契約を指定していなければ、契約は作成できない。 作成する契約に対して、企業、教室グループ、 対象サイト が同じ基本契約を指定可能とする。 契約開始日は、 下記の通りとする。 指定した親基本契約の開始日時が登録完了日時より未来の場合、親基本契約の開始日時が自動で設定される。 指定した親基本契約の開始日時が登録完了日時より未来ではない場合、 登録完了日時が自動で設定される。 契約終了日は、指定した親基本契約と 同じ終了日 になる。（自動で設定され、変更できない） 既存の有効な契約に対して、企業、教室グループ、商品の商品種別、 商品の対象サイト、 契約期間（一部の期間でも）、が 同じ複数の契約が同時に存在できない 。 同じ契約を作成しようとした場合、ユーザーが確認の上、重複する既存の契約を 自動的に無効にすること で、作成できる。 重複する契約の「登録する」ボタンを押下した際に重複確認用のダイアログが表示され、「無効にして登録する」を押下することで無効にできる。 ただし、課金形態種別が「採用課金」の商品は、雇用形態が異なる商品であれば、作成することができる。 商品種別が「オプション」の商品を選択した場合 親基本契約として有効な基本契約を指定していなければ、契約は作成できない。 作成する契約に対して、企業、教室グループ、対象サイトが同じ基本契約を指定可能とする。 契約期間は、指定した親基本契約の 有効期間内でなければならない 。 ただし、指定した親基本契約の終了日を超える期間を指定した場合も、超えた期間すべてにおいて、指定した親基本契約と同じ企業、教室グループ、対象サイトで有効な基本契約が存在している場合は、契約を作成することができる。 その場合、作成される契約は、指定した契約期間の１つの契約ではなく、下記のように分割された子契約が作成され、それぞれ該当する期間の基本契約が親契約となる。 指定した契約開始日〜指定した親基本契約の終了日 超えた期間の親基本契約１の開始日〜超えた期間の親基本契約１の終了日 超えた期間の親基本契約２の開始日〜超えた期間の親基本契約２の終了日 （中略） 超えた期間の親基本契約Nの開始日〜指定した指定した契約終了日 既存の有効な契約に対して、企業、教室グループ、商品の商品種別、 商品のオプション種別 、 商品の対象サイト、 契約期間（一部の期間でも）、が 同じ複数の契約が同時に存在できない 。 同じ契約を作成しようとした場合、ユーザーが確認の上、重複する既存の契約を 自動的に無効にすること で、作成できる。 重複する契約の「登録する」ボタンを押下した際に重複確認用のダイアログが表示され、「無効にして登録する」を押下することで無効にできる。 ただし、商品のオプション種別が「プラン」以外の商品は、商品のオプション種別が同じであっても、複数作成することができる。 共通 同時に複数の商品を選択して契約を作成する場合 選択した1商品ごとに1契約レコードを作成する。 同じ商品は同時に複数選択できないものとする。 商品種別が「オプション」の商品は、他の商品種別の商品と同時に選択して作成できないような入力フォームとする。 商品種別が「基本」の商品と「課金形態」の商品を同時に選択した場合、商品種別が「基本」の商品を選択した契約が、商品種別が「課金形態」を選択した契約の親基本契約として自動的に登録される。 同時に作成する契約も含めて、制限に当てはまるか否かを判定する。 契約の新規作成に成功した場合、併せて下記を行う。 紐づく商品の「付与プラン」に値があり、その値が既存の契約含めて優先度が高いプランである場合は、紐づく 求人 教室 にプラン および「プラン優先度」 を登録する。 作成した契約の請求予定および請求の可能性があるすべての月（下記条件）における 【修正中】請求：基本情報 を作成する。ただし、すでに 【修正中】請求：基本情報 存在する場合 （同じ「請求先・振込先マスタ番号」かつ、同じ「請求対象年月」の請求基本情報が存在する場合） は作成しない。 「基本」の場合：契約開始日が含まれる月のみ 「課金形態」の場合は、下記の通り、請求の可能性があるすべての月 「掲載課金」の場合 該当商品の「請求タイミング」が「一括前払い」の場合：契約開始日が含まれる月のみ 該当商品の「請求タイミング」が「毎月」の場合： 契約期間が含まれるすべての月 「応募課金」の場合：契約期間が含まれるすべての月 「採用課金」の場合 「採用課金：確定時期」が「即時」の場合：契約期間が含まれるすべての月 「採用課金：確定時期」が「1ヶ月後」の場合：契約期間が含まれるすべての月の1ヶ月後の月 「採用課金：確定時期」が「 3ヶ月後 」の場合：契約期間が含まれるすべての月の3ヶ月後の月 「登録課金」の場合：作成しない 「オプション」の場合： 「プラン」「新オプション」の場合 該当商品の「請求タイミング」が「一括前払い」の場合： 契約開始日が含まれる月のみ ただし、作成した契約が、本システムが自動で分割した契約の場合、分割後の最初の契約のみを対象とする。つまり、分割後の２つ目以降の契約に紐づく請求基本情報は作成しない。 該当商品の「請求タイミング」が「毎月」の場合：契約期間が含まれるすべての月 それ以外の場合：契約開始日が含まれる月のみ 作成した契約、および下記条件にあてはまる 【修正中】請求：基本情報 を紐付け先とした 【FIX】請求：請求明細 を作成する。ただし、 すでに同契約 （本システムによって分割作成された分割後の契約も含む） に紐づく 【FIX】請求：請求明細 存在する場合は作成しない。 「基本」の場合：契約開始日が含まれる月のみ ただし、「無料フラグ」が設定されている場合は、金額のみ同額でマイナスの値を設定した請求明細を併せて作成する。 作成するマイナスの請求明細の請求項目名は固定で「初回利用のため更新料割引」とする。 「課金形態」の場合は、下記の通り、請求の可能性があるすべての月 「掲載課金」の場合 該当商品の「請求タイミング」が「一括前払い」の場合：契約開始日が含まれる月のみ 該当商品の「請求タイミング」が「毎月」の場合：契約期間が含まれるすべての月 「応募課金」の場合：契約期間が含まれるすべての月 「採用課金」の場合 「採用課金：確定時期」が「即時」の場合：契約期間が含まれるすべての月 「採用課金：確定時期」が「1ヶ月後」の場合：契約期間が含まれるすべての月の 1ヶ月後の月 「採用課金：確定時期」が「3ヶ月後」の場合：契約期間が含まれるすべての月の3ヶ月後の月 「登録課金」の場合：作成しない 「オプション」の場合 「プラン」「新オプション」の場合 該当商品の「請求タイミング」が「一括前払い」の場合：契約開始日が含まれる月のみ ただし、作成した契約が、本システムが自動で分割した契約の場合、分割後の最初の契約のみを対象とする。つまり、分割後の２つ目以降の契約に紐づく請求明細は作成しない。 該当商品の「請求タイミング」が「毎月」の場合：契約期間が含まれるすべての月 それ以外の場合：契約開始日が含まれる月のみ また、 【修正中】請求：基本情報 の請求金額、税額を （共通）請求関連共通処理 に基づいて更新する。 契約の新規作成の過程で 、既存の契約を無効にした場合は、既存の契約に紐づく 【FIX】請求：請求明細 のうち、無効日時が含まれる月より未来の月の 【FIX】請求：請求明細 はすべて削除（論理削除）する。 また、対象の 【FIX】請求：請求明細 に紐づく 【修正中】請求：基本情報 の請求金額、税額を （共通）請求関連共通処理 に基づいて更新する。 また、 【FIX】請求：請求明細 削除によって紐づく 【FIX】請求：請求明細 が無くなった 【修正中】請求：基本情報 も削除（論理削除）する。 契約の新規作成に成功した場合、「classroom_basic_informations」テーブルの「plan」カラムの値と併せて、「plan_priority」カラムの値も登録する。 新規登録で成功または失敗した場合、以下の情報が入った ログ を出力する。その際、複数の契約の登録操作を同時に実施した場合は、契約レコードごとに別々にログを出力する。 日時、契約番号（成功した場合）、登録処理を実行した全体管理者のID、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714637353 の記載と同じ 3.2. 帳票 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714637353 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714637353 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 新規登録画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=1888-30172&amp;mode=design&amp;t=xg3p531z1W6EWruq-0 4.1.2. 重複確認ダイアログ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=2890-33701&amp;mode=design&amp;t=xg3p531z1W6EWruq-0 4.1.3. 新規登録完了ダイアログ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=1888-30199&amp;mode=design&amp;t=xg3p531z1W6EWruq-0 4.2. 入力 変数名、説明、バリデーションは、 【FIX】契約情報（統合版） の記載を前提とし、本ページに固有の特記事項のみ記載する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714637353 に記載の共通入力・取得項目は項目自体を省略する。 「制限」に「必須」とある場合に入力がない場合のエラーメッセージは統一して「{項目名}を入力してください」とする。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 対象企業：企業番号 入力フォーム／URLパラメータ 選択肢の表示形式は「[企業コード]_[企業名]」とする。 URLパラメータで企業が指定されている状態で作成する場合 入力フォームにせずに、隠しフォームに指定された企業番号を入力する。 入力フォームの代わりに、指定された企業を表示する。 URLパラメータで企業が指定されていない状態で作成する場合 教室グループが先に選択されていない場合 初期値は なし。 コンボボックスによる単一選択。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/765886465 を使い、テキストエリアに入力された文字列との中間一致で検索して抽出した企業を選択肢として表示し、表示された選択肢から選択することで「企業番号」が入力される。 教室グループが先に選択された場合 初期値はなし。 選択された教室グループに紐づく企業を選択肢とするセレクトボックスに変わり、単一選択。 必須 存在しない企業（削除済み等） 存在しない企業です。 2 対象教室グループ：教室グループ番号 入力フォーム ／URLパラメータ 選択肢の表示形式は「[教室グループID]_[教室グループ名]」とする。 URLパラメータで教室グループが指定されている状態で作成する場合 入力フォームにせずに、隠しフォームに指定された企業番号を入力する。 入力フォームの代わりに、指定された教室グループを表示する。 URLパラメータで教室グループが指定されていない状態で作成する場合 企業が先に選択されていない場合 初期値は なし。 コンボボックスによる単一選択。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/766083087 を使い、テキストエリアに入力された文字列との中間一致で検索して抽出した教室グループを選択肢として表示し、表示された選択肢から選択することで「教室グループ番号」が入力される。 企業が先に選択された場合 初期値はなし。 選択された企業に紐づく教室グループを選択肢とする セレクトボックスに変わり 、単一選択。 必須 存在しない教室グループ（削除済み等） 存在しない教室グループです。 3 商品 入力フォーム ／URLパラメータ URLパラメータでが指定されている状態で作成する場合は、 指定された値を初期値として入力された状態とし、指定されていない場合は、 初期値は なしとする。 セレクトボックスによる単一選択。 登録済の商品レコードの中で、下記で絞り込んだ商品を選択肢として表示する。 購入可フラグが「購入可」 現在が契約可能月に含まれる 入力フォームごとに指定した商品種別の商品（右記参照） 選択肢の表示形式は「商品ID_対象サイト_商品種別_単価」とする。 画面の表示項目名は下記 「基本契約」 ラジオボタンで「新規に商品を選択して契約」を選択した場合のみ入力可能 必須 商品種別が「基本」の商品のみ選択肢として表され、選択可能 「商品（課金形態1）」 「基本契約」欄のラジオボタンで「既存契約を紐付け」を選択した場合のみ必須。 「商品（課金形態2）」 商品種別が「課金形態」の商品のみ選択肢として表され、選択可能 「商品（課金形態3）」 商品種別が「課金形態」の商品のみ選択肢として表され、選択可能 「商品（課金形態4）」 商品種別が「課金形態」の商品のみ選択肢として表され、選択可能 「商品（課金形態5）」 商品種別が「課金形態」の商品のみ選択肢として表され、選択可能 「商品」 商品種別が「オプション」の商品のみ選択肢として表され、選択可能 必須 番号での保存 商品は数字で指定してください。 存在しない商品（削除済み等） 存在しない商品です。 契約可能月の商品のみ選択可能 対象商品の契約可能月の範囲外です。 4 請求先・振込先 入力フォーム ／URLパラメータ 基本契約を作成する場合のみ登録する。 URLパラメータで指定されている状態で作成する場合は、 指定された値を初期値として入力された状態とし、指定されていない場合は、 初期値は なしとする。 セレクトボックスによる単一選択。 登録済の 【FIX】企業：請求先・振込先マスタ の中で、下記で絞り込んだレコードを選択肢として表示する。 「対象企業：企業番号」欄で入力した企業に紐づく 選択肢の表示形式は「[請求先・振込先マスタ番号]_[名称]」とする。 「基本契約」欄のラジオボタンで「新規に商品を選択して契約」を選択した場合のみ入力可能 必須 5 無料フラグ 入力フォーム 基本契約を作成する場合のみ登録する。 「基本契約」欄のラジオボタンで「新規に商品を選択して契約」を選択した場合のみ入力可能 6 有効期間：開始日時 入力フォーム ／URLパラメータ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E5%80%8B%E5%88%A5%E4%BA%8B%E9%A0%85 の年月日の仕様に準ずる。 選択された値の表示形式は「 yyyy-mm-dd hh:mm:ss」とする。 URLパラメータで「有効期間：開始日時」が指定されている状態で作成する場合 指定された値を初期値として入力された状態とする。 URLパラメータで「有効期間：開始日時」が指定されていない状態で作成する場合 「今すぐ」のチェックボックスにチェックされている場合 レコード作成日時を入力とする。 「今すぐ」のチェックボックスにチェックされていない場合 初期値はなし。 入力された日付と、日付の始まる時刻（0時）を入力とする。 必須 現在日時以降 有効期間：開始日時は現在日時以降で設定してください。 7 親基本契約：契約番号 入力フォーム 選択された値の表示形式は 「[契約番号]_[商品：表示名称]_[有効期間：開始日]-[有効期間：終了日]」 とする。 企業、教室グループが入力されていない場合 入力フォームを入力不可（非活性）とする。 企業、教室グループが入力されている場合 入力フォームを入力可（活性）とする。 初期値は なし。 セレクトボックスによる単一選択。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/766083107 を使い、下記条件の契約のみを選択肢として表示する。 商品種別が基本 有効 入力済みの企業と同じ企業 入力済みの教室グループと同じ教室グループ 8 前契約：契約番号 入力フォーム／URLパラメータ 選択された値の表示形式は 「[契約番号]_[商品：表示名称]_[有効期間：開始日]-[有効期間：終了日]」 とする。 URLパラメータで契約番号が指定されている状態で作成する場合 入力フォームにせずに、隠しフォームに指定された契約番号を入力する。 URLパラメータで契約番号が指定されていない状態で作成する場合 企業、教室グループが入力されていない場合 入力フォームを入力不可（非活性）とする。 企業、教室グループが入力されている場合 入力フォームを入力可（活性）とする。 初期値は なし。 セレクトボックスによる単一選択。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/766083107 を使い、下記条件の契約のみを選択肢として表示する。 商品種別が基本 または課金形態 有効 入力済みの企業と同じ企業 入力済みの教室グループと同じ教室グループ 任意 同じ企業、同じ教室グループの契約のみ登録可能。 番号での保存 前契約は数字で指定してください。 存在しない契約（削除済み等） 存在しない契約です。 9 担当者 入力フォーム 初期値は、操作中の全体管理者とする 。 セレクトボックスによる単一選択。 登録されているすべてのシステム管理者、塾ステーション管理者を、順に登録日時の降順で表示し、選択可能とする。 必須 数値での保存 担当者は数字で指定してください。 10 メモ 入力フォーム 初期値は なし。 テキストボックス。 任意項目。 4.3. 出力 4.3.1. 契約 説明は、 【FIX】契約情報（統合版） の記載を前提とし、本ページに固有の特記事項のみ記載する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714637353 に記載の共通出力項目は項目自体を省略する。 出力項目 出力先 説明 1 契約番号 データベース レコード作成時に自動で連番を発行してデータベースに保存する。 2 企業 （企業番号、企業名） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 保存時は企業番号と、それに紐づく企業名も併せてデータベースに保存する。 3 教室グループ番号 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 保存時は教室グループ番号を保存する。 4 商品 （商品番号、単価、税区分、税率） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 保存時は商品番号と、それに紐づく単価、税区分、税率も併せてデータベースに保存する。 5 請求先・振込先 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 6 無料フラグ データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 7 締結日 データベース レコード作成時に自動で現在日時をデータベースに保存する。 8 有効期間：開始日時 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 9 有効期間：終了日時 データベース/画面 入力された「有効期間：開始日時」に選択した商品の有効期間を足した日付における、終わりの日時（24:00:00）を、画面の対象フォーム内に「yyyy年mm月DD日 hh:mm:ss」形式で出力し、SQLインジェクション対策をしてデータベースに保存する。 10 親基本契約 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 保存時は契約番号を保存する。 11 前契約 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 保存時は契約番号を保存する。 12 担当者 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 保存時は担当者番号を保存する。 13 メモ データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に 入力された改行を維持したまま HTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 14 作成者 データベース 【作成中】帳票共通項目 の定義に従う。 15 作成日時 データベース 【作成中】帳票共通項目 の定義に従う。 16 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 17 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.3.2. 請求基本情報 説明は、 【修正中】請求：基本情報 の記載を前提とし、本ページに固有の特記事項のみ記載する。 【修正中】請求：基本情報 に記載の共通出力項目は項目自体を省略する。 項目名 出力先 説明 1 請求番号 データベース システムで自動発行する。 2 請求ID データベース システムで自動発行する。 3 請求先・振込先マスタ番号 データベース 紐づく 【FIX】契約情報（統合版） （基本契約でない場合はその親契約）に紐づく請求先・振込先マスタ番号を登録する。 4 請求金額 データベース 紐づく 【FIX】請求：請求明細 すべての合計金額を登録する。 5 請求金額：税額 データベース 紐づく 【FIX】請求：請求明細 すべての合計税額を登録する。 6 請求対象年月：年 データベース 紐づく 【FIX】契約情報（統合版） の情報をもとに、本ページ要求事項欄の条件によって、請求対象年を登録する。 7 請求対象年月：月 データベース 紐づく 【FIX】契約情報（統合版） の情報をもとに、本ページ要求事項欄の条件によって、請求対象月を登録する。 8 請求日 データベース 請求対象年月の末日 を登録する。 9 作成者 データベース 【作成中】帳票共通項目 の定義に従う。 10 作成日時 データベース 【作成中】帳票共通項目 の定義に従う。 11 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 12 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.3.3. 請求明細 説明は、 【FIX】請求：請求明細 の記載を前提とし、本ページに固有の特記事項のみ記載する。 【FIX】請求：請求明細 に記載の共通出力項目は項目自体を省略する。 項目名 出力先 説明 1 請求書明細番号 データベース システムで自動発行する。 2 請求番号 データベース 紐づく 【修正中】請求：基本情報 の請求番号を登録する。 3 商品番号 データベース 「契約番号」に紐づく 【FIX】商品マスタ（統合版） の商品番号を登録する。 4 契約番号 データベース 紐づく 【FIX】契約情報（統合版） の番号を登録する。 5 取引日 データベース 紐づく 【修正中】請求：基本情報 の 請求年月の末日 を登録する。 6 請求項目名 データベース 「商品番号」で指定した商品の商品名を出力する。 7 単価 データベース 「商品番号」で指定した商品の単価を出力する。 ただし、掲載課金またはオプションで請求タイミングが「毎月」の場合は、作成された複数の請求明細に対してそれぞれ、下記の様に設定される。 請求明細の数で割った金額を1,000円の位で切り上げた金額が、最初の請求明細から順に設定される。 すべての請求明細の合計が商品の単価と等しくなるように、最終月の請求明細は残りの金額を設定する。 ※例えば、10,000円を3つの請求書明細で（3ヶ月にわけて）毎月請求する場合は、4,000円、4,000円、 2,000 円と設定される。 8 税区分 データベース 「商品番号」で指定した商品の税区分を出力する。 9 税率 データベース 「商品番号」で指定した商品の税率を出力する。 10 数量 データベース 紐づく 【FIX】契約情報（統合版） が課金形態の「採用課金」「応募課金」 「登録課金」 の場合は「0」、 オプション種別が「急募」の場合は 【FIX】契約情報（統合版） の「対象商品：数量」を、 それ以外の場合は「1」を登録する。 11 単位 データベース 「商品番号」で指定した商品の単位を出力する。 12 合計金額 データベース 単価、数量、税率、税区分から自動計算し、登録する。 13 作成者 データベース 【作成中】帳票共通項目 に従う。 14 作成日時 データベース 【作成中】帳票共通項目 に従う。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 4.4.1. 入力画面表示処理 本ページの「入力」（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558#4.2.-%E5%85%A5%E5%8A%9B ）に記載の全ての項目の入力フォームと登録ボタンを配置した画面を表示する。 4.4.2. 新規登録処理 入力フォームからのデータを受け取り、「入力」の定義にしたがって値の妥当性検査をおこなう。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、作成日時、更新日時を操作している現在時刻とし、操作を行なっている全体管理者のユーザー番号を作成者/更新者に設定した上でデータベースに新規レコードとして挿入する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163 ページへリダイレクトし、新規データ登録が完了したことがわかるメッセージを表示する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 新規登録画面を表示した場合に下記フォーマットでログを出力する。 User {全体管理者のユーザー番号} started to create contract. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 新規登録処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {全体管理者のユーザー番号} created contract. contract_number={契約番号} company_number={企業番号} brand _number={教室グループ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 作成したレコード数の数だけログを出力する。 失敗した場合 User {全体管理者のユーザー番号} failed to create contract. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "714637353",
  "parentTitle": "110_【FIX】契約管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/714211558/112_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-05-09T08:29:00.718Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の新規データを1件を新規登録するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが、 【FIX】契約情報（統合版） のデータを新規登録することができる。 本機能へは、下記の導線で遷移する。 https://giginc.atlassian.net/wiki/spaces/CL..."
}