{
  "id": "714670163",
  "title": "111_【FIX】契約一覧閲覧・検索機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが、登録されている 【FIX】契約情報（統合版） を一覧で閲覧することができる。 一覧ページ上部には、以下の要素を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数 表示形式を https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E8%A1%A8%E7%A4%BA にまとめて システム内で統一したい。 新規登録ボタン 押下 すると 112_【FIX】契約新規追加機能 に遷移する。 CSVダウンロードボタン 押下することで、 【不要】116_【作成中】契約情報CSVダウンロード機能 を実行する。 検索結果が1件もなかった場合の動作は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#2.-%E8%A1%A8%E7%A4%BA に従う。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 絞り込み ボタン。押下することで変更されたフィルター項目の一覧適用を実行する。表示可能なレコードがなかった場合の表示は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E8%A1%A8%E7%A4%BA に記載の内容に 準ずる。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 編集ボタン 押下すると 114_【FIX】契約編集機能 に遷移する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 締結日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには以下の項目を表示する。 本ページの「要件定義」-「出力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163#4.3.-%E5%87%BA%E5%8A%9B ）で出力先として「画面」が定義されている項目のうち、契約情報レコードとして定義されている項目 3.1. 権限 110_【FIX】契約管理機能 の記載と同じ 3.2. 帳票 110_【FIX】契約管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 110_【FIX】契約管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=1888-30142&amp;mode=design&amp;t=xg3p531z1W6EWruq-0 4.2. 入力 110_【FIX】契約管理機能 に記載の共通入力・取得項目は省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 全てのレコードを表示 showall URLパラメータ／入力フォーム フィルター項目 全てのレコードを表示するかどうかを指定する真偽値。True（大文字小文字問わず）が指定された場合は削除済みレコードも表示し、True以外の値の場合は削除済みレコードはフィルタする。 True以外の値の場合はFalseと判定する。どんな値でもエラーは発生させない。 任意項目。入力されていない場合はFalseと判定する。 2 企業番号 company_number URLパラメータ／入力フォーム フィルター項目 コンボボックス 。初期状態は何も入力されていないものとする。 企業名を入力することによるサジェスト（ 121-2_【FIX】企業検索API 利用）で企業（企業番号）を選択できる。 選択肢は「企業コード_企業名」の形式で表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 3 商品種別 service_type URLパラメータ／入力フォーム フィルター項目 契約に紐づく商品の「商品種別」で絞り込みを行う。 単一選択のセレクトボックス。 【FIX】商品マスタ（統合版） の 「商品種別」に記載されている選択肢 と「すべて」を選択肢に表示し、初期状態は「すべて」が選択されているものとする。 選択肢内の並び順は、「すべて」を最上部に表示し、それ以降は商品番号の昇順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 4 商品詳細種別（課金形態種別、オプション種別） 商品概要 service_detail_type URLパラメータ／入力フォーム フィルター項目 契約に紐づく商品の「課金形態種別」「オプション種別」で絞り込みを行う。 単一選択のセレクトボックス。 「 商品詳細種別 商品概要」フォームに下記を表示し、初期状態は「すべて」が選択されているものとする。 「すべて」 「なし（基本商品）」 課金形態種別およびオプション種別が登録されていないレコードのこと。必然的に基本商品になるため、この名称とする。 【FIX】商品マスタ（統合版） の 「課金形態種別」に記載されている選択肢 【FIX】商品マスタ（統合版） の「オプション種別」の選択肢 選択肢内の並び順は、「すべて」を最上部に表示し、それ以外は商品帳票の定義順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 5 対象サイト site URLパラメータ／入力フォーム フィルター項目 契約に紐づく商品の「対象サイト」で絞り込みを行う。 単一選択のセレクトボックス。 【FIX】商品マスタ（統合版） の 「対象サイト」に記載されている選択肢 と「すべて」を選択肢に表示し、初期状態は「すべて」が選択されているものとする。 選択肢内の並び順は、「すべて」を最上部に表示し、それ以降はステーション、キャリアの順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 6 担当者 person_in_charge URLパラメータ／入力フォーム フィルター項目 単一選択のセレクトボックス。 登録されている 【FIX】全体管理者登録情報 のシステム管理者と塾ステーション管理者のレコードと「すべて」を選択肢に表示し、初期状態は「すべて」が選択されているものとする。 選択肢は氏名を表示する。 選択肢内の並び順は、「すべて」を最上部に表示し、それ以降はユーザー番号の昇順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 7 有効期限 end_date URLパラメータ／入力フォーム フィルター項目 契約の「有効期間：終了日時」の年月が該当するレコードを絞り込む。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E5%80%8B%E5%88%A5%E4%BA%8B%E9%A0%85 の年月日の仕様に準ずる。 任意項目。入力されていない場合はフィルタリングはおこなわない。 8 無効な契約も表示 &nbsp; URLパラメータ／入力フォーム フィルター項目 チェックが入っていれば有効期限切れの契約も表示する。 任意項目。チェックされていない場合はFalseとして表示する。 9 ページ番号 page URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 全てのレコードを表示 画面 フィルター項目。 入力された「全てのレコード表示」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「全てのレコード表示」のチェックボックスのON/OFFを切り替えて表示する。 5 企業番号 画面 フィルター項目。 「企業番号」が入力された場合、フィルター用コンポーネント内の「企業」のコンボボックスに入力された企業番号が選択された状態として表示する。 6 商品種別 画面 フィルター項目。 入力された「商品種別」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「商品種別」のセレクトボックスで初期選択状態とする。 7 対象サイト 画面 フィルター項目。 入力された「対象サイト」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「対象サイト」のセレクトボックスで初期選択状態とする。 8 有効期限 画面 フィルター項目。 入力された「有効期限」を入力処理にて変換した値を、フィルター用コンポーネント内の「有効期限」のセレクトボックスに表示する。 変換処理及び表示処理はライブラリの仕様に任せる。 9 無効な契約も表示 画面 フィルター項目。 入力された「無効な契約も表示」を入力処理にて変換した値を、フィルター用コンポーネント内の「無効な契約も表示」のチェックボックスに表示する。 10 担当者 画面 フィルター項目。 入力された「担当者」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「担当者」のセレクトボックスで初期選択状態とする。 11 契約情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した契約情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「契約情報：」プレフィックスで始まる出力項目として説明する。 12 契約情報：契約番号 画面 データベースから取得した契約情報1レコードの「契約番号」。登録された「契約番号」文字列を変換せずにそのまま表示し、 113_【修正中】契約詳細閲覧機能 にハイパーリンクする。詳細は 【FIX】契約情報（統合版） を参照。 13 契約情報：企業名 画面 データベースから取得した契約情報1レコードの 「対象企業：企業番号」が示す 【FIX】企業：基本情報 の 「企業名」を適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 14 契約情報：対象教室グループ名 画面 データベースから取得した契約情報1レコードの「教室グループ番号」をもとに「対象教室グループ名」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 15 契約情報：対象商品：商品ID 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「商品ID」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 16 契約情報：対象商品：対象サイト 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「対象サイト」を取得し、設定ファイルから取得した対象サイト選択肢のラベルで表示する。詳細は 【FIX】契約情報（統合版） を参照。 17 契約情報：対象商品：商品種別 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「商品種別」を取得し、設定ファイルから取得した商品種別選択肢のラベルで表示する。詳細は 【FIX】契約情報（統合版） を参照。 18 契約情報：対象商品：表示名称 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「表示名称」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 「商品名称」列に表示する。 19 契約情報：対象商品：課金形態種別 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「課金形態種別」を取得し、設定ファイルから取得した商品種別選択肢のラベルで表示する。詳細は 【FIX】契約情報（統合版） を参照。 「 商品詳細種別 商品概要」列に表示する。 20 契約情報：対象商品：オプション種別 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「オプション種別」を取得し、設定ファイルから取得した商品種別選択肢のラベルで表示する。詳細は 【FIX】契約情報（統合版） を参照。 「 商品詳細種別 商品概要」列に表示する。 21 契約情報：対象商品：単価 画面 データベースから取得した契約情報1レコードの「単価」を適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 22 契約情報：有効期間開始日 画面 データベースから取得した契約情報1レコードの「有効期間：開始日」を「yyyy/mm/dd」の形式で表示する。詳細は 【FIX】商品マスタ（統合版） を参照。 23 契約情報：有効期限 画面 データベースから取得した契約情報1レコードの「有効期間：終了日」を「yyyy/mm/dd」の形式で表示する。詳細は 【FIX】商品マスタ（統合版） を参照。 24 契約情報：担当者 画面 データベースから取得した契約情報1レコードの「担当者」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 25 契約情報：無効化日時 画面 データベースから取得した契約情報1レコードの「無効化日時」。NULLの場合は網掛けなしの状態、NULLではない場合は網掛けありの状態でレコード行を表示する。詳細は 【FIX】契約情報（統合版） を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力欄に記載の項目（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714670163#4.2.-%E5%85%A5%E5%8A%9B ）の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が100,000を超えていた場合、100,000件を超えるレコードは無視し、以降は総件数を100,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の商品データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき商品情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read contract list. page={ページ番号} company_number={企業番号} billing_type={課金形態種別} option_type={オプション種別} site={対象サイト} end_date={有効期限} includes_invalid={true/false} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 最後に閲覧していた https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=714670163 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "714637353",
  "parentTitle": "110_【FIX】契約管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/714670163/111_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-10T08:26:36.479Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが、登録されている 【FIX】契約情報（統合版） を一覧で閲覧することができる。 一覧ページ上部には、以下の要素を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数 表示形..."
}