{
  "id": "717455712",
  "title": "071_ 【FIX】オファー一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】オファー履歴 の登録済みのデータの一覧を閲覧するための機能です。 オファーの種類によるサービスサイト上での名称や動作の違いは ワード・ディフィニション および 521_オファー機能利用条件 を参照すること。 3. 要求事項 サービスサイトにログインできる会員が登録されている 【FIX】オファー履歴 を一覧で閲覧することができる。 １ページあたりの表示数を10件とし、 表示対象のレコードが11件以上の場合 は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 最大1,000件表示可能とする。 1件もない場合は「オファーはございません」と表示する。 ページ上部または下部には下記を表示する。 スカウトとマッチの違いボタン 押下すると 説明モーダル が表示される。 スカウト・マッチの設定変更ボタン 押下すると 053_【FIX】スカウト・マッチ利用設定機能 へ遷移する。 未読のみ表示切り替えトグルボタン 押下すると、一覧を未読（ 【FIX】オファー履歴 の開封日時がないもの）のみに絞り込んで表示する。 デフォルトは未選択（すべて表示）とする。 マイページへ戻るボタン 押下すると 054_【FIX】マイページTOP へ遷移する。 オファー利用状況表示 スカウト利用： 【レビュー中】会員：設定情報（オファー・メール） のスカウト利用が「利用する」の場合「利用中」、「利用しない」の場合「停止中」を表示する。 マッチ利用： 【レビュー中】会員：設定情報（オファー・メール） のマッチ利用が「利用する」の場合「利用中」、「利用しない」の場合「停止中」を表示する。 オファー受信拒否企業設定： 【FIX】会員：設定情報（オファー拒否企業） が1件でも存在する場合「設定中」、1件も存在しない場合「未設定」を表示する。 一覧の各レコードに表示する項目はWFの通りとし、特筆すべき項目のみ以下に記載する。 マッチ・スカウト 【FIX】オファー履歴 の「オファー種別」が「パーソナルオファー」ならば「スカウト」アイコンを、「自動オファー」ならば「マッチ」アイコンを表示する。 教室名または企業名 スカウトの場合： 【FIX】オファー履歴 に紐づく教室名を表示する。 マッチの場合： 【FIX】オファー履歴 に紐づく企業名を表示する。 件名 【FIX】オファー履歴 の件名を表示する。 未読表示 【FIX】オファー履歴 の開封日時がないレコードに未読アイコンを表示する。 送信日時 【FIX】オファー履歴 の「 送信時間 登録日時 」を表示する。 削除ボタン 押下すると、 073_【FIX】オファー削除機能 を実行する。 一覧の並び順は、送信日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードは全体をリンクとし、押下すると 072_【FIX】 オファー詳細閲覧機能 に遷移する。 3.1. 権限 要求に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=65061-29456&amp;mode=design&amp;t=XtGcTHtSKsph0BlS-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read offer list. page={ページ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。",
  "parentId": "717947034",
  "parentTitle": "070_■オファー管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/717455712/071_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-26T02:17:54.451Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】オファー履歴 の登録済みのデータの一覧を閲覧するための機能です。 オファーの種類によるサービスサイト上での名称や動作の違いは ワード・ディフィニション および 521_オファー機能利用条件 を参照すること。 3. 要求事項 サービスサイトにログインできる会員が登録されている 【FIX】オファー履歴 を一覧で閲覧することができる。 １ページあたりの表示数を..."
}