{
  "id": "717979831",
  "title": "072_【FIX】 オファー詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能は、登録済みの 【FIX】オファー履歴 を1件閲覧するための機能です。 オファーの種類によるサービスサイト上での名称や動作の違いは ワード・ディフィニション および 521_オファー機能利用条件 を参照すること。 3. 要求事項 サービスサイトにログインできる会員のみが利用できる。 本機能は 【FIX】オファー履歴 に記載の項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページに表示する項目はWFの通りとし、特筆すべき項目のみ以下に記載する。 共通 上部 前へボタン 押下すると送信日時が一つ新しいオファーの 072_【FIX】 オファー詳細閲覧機能 へ遷移する。 次へボタン 押下すると送信日時が一つ古いオファーの 072_【FIX】 オファー詳細閲覧機能 へ遷移する。 本文 スカウト・マッチアイコン／教室名または企業名／ 件名 ／送信日時 071_ 【FIX】オファー一覧閲覧機能 の定義と同様とする。 求人詳細ボタン 押下すると該当の 012_【FIX】求人詳細閲覧機能 へ遷移する。 また、遷移リンクURLには別途指定する対応表で定義するパラメータを付与する。 下部 メッセージ削除ボタン 押下すると 073_【FIX】オファー削除機能 を実行する。 この企業からのオファーをブロックボタン 押下すると 053_【FIX】スカウト・マッチ利用設定機能 で 定義したオファー非公開企業の追加処理を行う。 処理完了後、画面は遷移せずに処理完了モーダルを表示し、ボタンは「この企業はブロック済みです」という表示にして非活性にする。 オファー希望条件・配信可否の変更リンク 053_【FIX】スカウト・マッチ利用設定機能 へのリンク 過去勤務歴のある企業その他、オファーを受けたくない企業の登録リンク 053_【FIX】スカウト・マッチ利用設定機能 へのリンク スカウトの場合 本文 会員氏名：「$会員氏名$様」 教室名：「こんにちは 、 ！ $教室名$ 採用担当です。」 冒頭文章： 【FIX】オファー履歴 の文頭文章 スカウト求人内容 求人タイトル：紐づく教室の求人の内、 掲載の求人の中で 求人番号が最も若い 求人の更新日時が最も新しい 求人の求人タイトル スカウト送信後、該当スカウトの教室に紐づく全ての求人が非掲載状態となった場合は、求人番号が最も若い求人の求人タイトルを表示するものとする 給与：前記求人の給与情報 最寄り駅：紐づく教室の教室名最寄り駅情報 指導形態：前記求人の指導形態 待遇：前記求人の待遇情報を、「[待遇条件]／[待遇条件]／[待遇条件]／&hellip;」の形式で表示 他の求人を見るボタン 押下すると、紐づく教室グループで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 へ遷移する。 また、遷移リンクURLには別途指定する対応表で定義するパラメータを付与する。 塾の特徴 【FIX】オファー履歴 の塾からのメッセージ 基本テンプレートを使用した場合には、「塾の特徴」を非表示にする。 文末：定型文および「$教室名$採用担当」 オリジナル文面を作成した場合には、「文末」を非表示にする。 画面下部 画面スクロールとともに、画面下部から「他の求人を見るボタン」「求人詳細を見るボタン」を表示し、その後は画面下部に固定で表示される。 他の求人を見るボタン 押下すると、紐づく教室グループで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 へ遷移する。 また、遷移リンクURLには別途指定する対応表で定義するパラメータを付与する。 求人詳細を見るボタン 押下すると該当の 012_【FIX】求人詳細閲覧機能 へ遷移する。 また、遷移リンクURLには別途指定する対応表で定義するパラメータを付与する。 マッチの場合 本文 文中の会員氏名 ：「$会員氏名$様」 マッチした企業 企業名：紐づく企業の企業名 市区町村／都道府県で募集中の求人 エリアは会員住所の市区町村 および都道府県とし、ラベルに表示するとともに、該当エリアにある該当企業の求人の情報を、 掲載の求人の中で 求人番号の若い順に表示する。 ただし、市区町村の欄で表示した求人は、都道府県の欄では除外して抽出する。 市区町村または都道府県の教室のどちらか該当する方が表示されるか、両方該当する場合は 両方 とも表示する。 市区町村／都道府県それぞれ表示は 最大２件 とする。 教室名：該当求人の教室名 給与：該当求人の給与情報 指導形態：該当求人の指導形態 他の教室ボタン 押下すると、該当企業で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 へ遷移する。 また、遷移リンクURLには別途指定する対応表で定義するパラメータを付与する。 存在しないレコードが指定された場合は対象URLのページが存在しないように振る舞う。 未読の 【FIX】オファー履歴 にて本機能でページを表示したら、 【FIX】オファー履歴 の開封日時に表示日時を登録する。 3.1.1. 遷移ボタンURLに付与するパラメータ ページ リンク パラメーター スカウトメッセージ 求人詳細を見る[/job] ?argument=y5Awr3vc&amp;dmai=a65efd42920ea0 他の求人をみる[ / classrooms brand ] ?argument=y5Awr3vc&amp;dmai=a65efd4290ae49 スカウトメッセージ（画面下部追従ボタン） 求人詳細を見る[/job] ?argument=y5Awr3vc&amp;dmai=a686b7f3427e36 他の求人を見る[/brand] ?argument=y5Awr3vc&amp;dmai=a686b7ef106a94 マッチメッセージ 求人詳細を見る[/job]（市区町村で募集中） ?argument=y5Awr3vc&amp;dmai=a65efd4292bb52 求人詳細を見る[/job]（都道府県で募集中） ?argument=y5Awr3vc&amp;dmai=a65efd3fbd8ccc 他の教室を見る[/company] ?argument=y5Awr3vc&amp;dmai=a65efd4293698b 3.1. 権限 サービスサイトにログインできる会員のみ 3.2. 帳票 要求と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. スカウトの場合 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=65061-29605&amp;mode=design&amp;t=XtGcTHtSKsph0BlS-0 4.1.2. マッチの場合 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=122971-97852&amp;mode=design&amp;t=XtGcTHtSKsph0BlS-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read offer detail. offer_number={オファー履歴番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた 071_ 【FIX】オファー一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "717947034",
  "parentTitle": "070_■オファー管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/717979831/072_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-08-06T02:45:41.038Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能は、登録済みの 【FIX】オファー履歴 を1件閲覧するための機能です。 オファーの種類によるサービスサイト上での名称や動作の違いは ワード・ディフィニション および 521_オファー機能利用条件 を参照すること。 3. 要求事項 サービスサイトにログインできる会員のみが利用できる。 本機能は 【FIX】オファー履歴 に記載の項目について、1URL=1レコードで保存され..."
}