{
  "id": "718274801",
  "title": "314_【スコープアウト】請求CSV取り込み詳細閲覧機能",
  "content": "2023-11-08 ミーティング議事録 よりスコープアウトのためチケットをクローズとする。 1. 目次 1 6 false list false 2. 概要 本機能は 関連する帳票のリンクを貼る の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 権限者をリストアップ が利用することができる。 本機能は 関連する帳票のリンクを貼る に記載の全ての項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目 編集ボタン(不要なら削除) 押下することで 編集ページのリンクを貼る に遷移することができる。 一覧に戻るボタン(不要なら削除) 押下することで 一覧ページのリンクを貼る に遷移することができる。 そのほかのボタン(不要なら削除) 押下することで 〇〇 に遷移することができる。 存在しない 〇〇(ページに対応する名称に更新) が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入ったログを出力する。 日時、 管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)または企業管理者ID（ 【FIX】クライアント企業管理者 のユーザー番号：クライアント企業管理者） 、 〇〇 番号( 対応する帳票 の 〇〇 番号)、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 権限者をリストアップ のみ 3.2. 帳票 親ページのリンクを貼る の記載と同じ 3.3. メールテンプレート なければなしと記載、あればリンクを貼る 3.4. ワークフロー 親ページのリンクを貼る の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） Figmaのリンクを貼る 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ ID &nbsp; URLパラメータ 閲覧する 閲覧する内容 を一意に指定するためのID 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 項目名 画面 適切にHTMLエスケープ処理をして出力する。 項目名 画面 適切にHTMLエスケープ処理をし、文頭に「&yen;」をつけた上で、3桁カンマ区切りにして出力する。例） &yen;1,000,000 項目名 画面 保存された値が指し示す選択肢のラベルを出力する。 項目名 画面 適切にHTMLエスケープ処理をし、末尾に「%」を付与して出力する。 項目名 画面 保存された複数の値が指し示す選択肢のラベルを全て出力する。 項目名 画面 入力された改行を維持したまま表示されるように適切にHTMLエスケープ処理をして出力する。 項目名 画面 YYYY-mm-dd H:i:s形式の文字列で出力する。 項目名 画面 保存された管理者IDが示すユーザーの名前を表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合、または管理者権限でログインしていない場合は全体管理者画面のログイン画面にリダイレクトする。 URL文字列から入力されたID文字列を取得し、ID文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 ID文字列を元にデータベースから 【FIX】商品マスタ（統合版） から取得する。対象のIDのデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の商品データが存在したら、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/717455936#%E5%87%BA%E5%8A%9B の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {管理者ID} managed to access on service detail. id={ID} service_id={商品ID} name={商品名称} {URI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた 一覧ページのリンクを貼る のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "717456039",
  "parentTitle": "310_■【スコープアウト】請求CSV取り込み機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/718274801/314_+CSV",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-11-29T01:57:03.702Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "2023-11-08 ミーティング議事録 よりスコープアウトのためチケットをクローズとする。 1. 目次 1 6 false list false 2. 概要 本機能は 関連する帳票のリンクを貼る の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 権限者をリストアップ が利用することができる。 本機能は 関連する帳票のリンクを貼る に記載の全ての項目について、1URL=1レコードで..."
}