{
  "id": "718504234",
  "title": "291_【FIX】請求管理 - 採用者一覧閲覧機能",
  "content": "1. 目次 2. 概要 該当の請求情報に紐づく採用者の一覧を閲覧するための機能。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみ が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 絞り込みで表示する採用者の条件は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/906690562#1.2.-%E6%8E%A1%E7%94%A8%E8%80%85%E4%B8%80%E8%A6%A7%E9%9B%86%E8%A8%88%E5%87%A6%E7%90%86 の通り である。 請求対象に含まれるいずれかの教室に紐付く採用である 採用確認日が請求対象年月に含まれる 採用ステータス（クライアント企業） が「採用」である 一覧ページ上部には、表示可能なレコードの総数、を表示する。 １ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 レコード一覧の上に次のボタンを表示する 請求詳細に戻るボタン 押下すると 273_【FIX】請求詳細閲覧機能 に遷移する。 一覧の各レコードには次の項目を表示する 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目の内、採用者情報レコードとして定義されている項目 3.1. 権限 要求事項の記述に同じ。 3.2. 帳票 該当の 【修正中】請求：基本情報 およびそれに紐づく 【FIX】応募情報 【FIX】求人：基本情報 【FIX】契約情報（統合版） 【FIX】商品マスタ（統合版） 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】クライアント企業への請求・支払いフロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=74740-49102&amp;mode=design&amp;t=v2r5a85pXYcjBDqc-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 請求番号 URLパラメータ 採用者一覧が紐づく請求番号を指定する。 必須 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 レコード番号 画面 1つ目のレコードを1とし、レコードの数だけ連番で数を表示する。なおこれは応募番号ではない。 応募ID 画面 1つ目のレコードを1とし、レコードの数だけ連番で数を表示する。 採用先教室名 画面 応募に紐づく、採用された教室の教室名を適切にHTMLエスケープ処理を行って表示する。 採用者名 画面 応募に紐づく、応募者の姓名を間に 全角スペース を入れて結合し適切にHTMLエスケープ処理を行って表示する。 雇用形態 画面 応募に紐づく 【FIX】求人：基本情報 の雇用形態の保存されている値のラベル名を表示する。 単価（税込） 画面 応募に紐づく教室グループに紐づく 【FIX】契約情報（統合版） の単価を表示する。表示する金額は、 【FIX】契約情報（統合版） で税区分が「内税」の場合はそのまま、「外税」の場合は 1.1「税率」 をかけた数字を表示する。形式は先頭に「&yen;」をつけ、3桁区切りとする。 【FIX】応募情報 に紐づく 【FIX】請求：請求明細 の「単価」に対して、「税区分」に基づき税込価格を計算し表示する。形式は先頭に「&yen;」をつけ、3桁区切りとする。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力された条件からデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が20,000を超えていた場合、以降は総件数を20,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件のデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき採用者情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read hired user list. page={ページ番号} invoice_number={請求番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "718635173",
  "parentTitle": "290_■請求管理採用者管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/718504234/291_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-19T09:25:59.725Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 該当の請求情報に紐づく採用者の一覧を閲覧するための機能。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみ が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 絞り込みで表示する採用者の条件は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/90669..."
}