{
  "id": "718504259",
  "title": "301-2_【機能不要のため削除】全請求書PDF一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】請求：請求書PDF および 【FIX】請求：基本情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、表示可能なレコードの総数を表示する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 作成日時の降順で表示し、並べ替えを行うことはできなくて良い。 レコード一覧の上に次のボタンを表示する 請求管理へボタン 押下すると 271_【作成中】請求一覧閲覧・検索機能 に遷移する。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの 「入力」 - 「検索フィルター・ページネーション」 で入力元として「入力フォーム：フィルター」が定義されている項目 本ページの 「出力」 - 「検索フィルター・ページネーション」 で出力先として「画面」が定義されている項目 検索ボタン 押下するとフィルター項目での一覧絞り込みを実行する。検索結果が1件もなかった場合は、「該当する請求書PDFが見つかりませんでした」と表示する。 リセットボタン 押下するとフィルター項目を全て初期値に戻すとともに、全ての請求書PDFを一覧表示する（＝何も絞り込まない一覧結果を表示する）。 一覧の各レコードには次の項目を表示する 本ページの 「要件定義」-「出力」-「各レコード」欄 で出力先として「画面」が定義されている項目の内、請求書PDF情報レコードとして定義されている項目 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみ 3.2. 帳票 【FIX】請求：請求書PDF 【FIX】請求：基本情報 3.3. メールテンプレート なし 3.4. ワークフロー 270_■請求管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=78007-22901&amp;mode=design&amp;t=a0ZVUwTYd0YFa8sq-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. 検索フィルター・ページネーション 項目名 変数名 入力元 説明 バリデーション ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 取引先企業名 URLパラメータ／入力フォーム：フィルター 1行テキストボックスで入力し、紐づく 【FIX】請求：基本情報 の「請求先：企業番号」に紐づく 【FIX】企業：基本情報 の「企業名」を部分一致でフィルタリングする。 最大文字数は15文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の15文字で検索をかける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 取引金額 URLパラメータ／入力フォーム：フィルター 2つのテキストボックスで入力し、 【FIX】請求：基本情報 の「請求金額」を範囲一致でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 請求対象年月 URLパラメータ／入力フォーム：フィルター 検索期間の開始日時と終了日時について、それぞれ年・月でのデートピッカーで入力し、それ ぞれの入力規制 は 共通要件 に従う。 年は2021〜現在、月は1〜12とする。 検索開始年月からから検索終了年月までの期間での検索とする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 検索フィルター・ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 取引先企業名 画面 入力された「取引先企業名」を入力処理にて変換した値を、フィルター用コンポーネント内の「取引先企業名」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 取引金額 画面 入力された「取引金額」を入力処理にて変換した値を、フィルター用コンポーネント内の「取引金額」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 請求対象年月 画面 検索期間の開始日時と終了日時について、それぞれ年・月について、入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートピッカーで初期選択状態とする。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 請求書PDF情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した企業情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「請求書PDF情報：」プレフィックスで始まる出力項目として説明する。 請求書PDF情報配列：請求番号 画面 データベースから取得した請求書PDF情報1レコードの「請求番号」を表示する。 テキストリンクとし、押下すると 273_【作成中】請求詳細閲覧機能 へ遷移する。 請求書PDF情報配列： ファイル名 画面 データベースから取得した請求書PDF情報1レコードの「ファイル名」を適切にHTMLエスケープして表示する。 テキストリンクとし、押下すると 302_【機能不要のため削除】請求書PDF詳細閲覧機能 へ遷移する。 請求書PDF情報配列：取引先 画面 データベースから取得した請求書PDF情報1レコードの「取引先」を適切にHTMLエスケープして表示する。 請求書PDF情報配列：取引金額 画面 データベースから取得した請求書PDF情報1レコードの「取引金額」を、文頭に「&yen;」をつけ、3桁で「,」区切りで表示する。 請求書PDF情報配列：請求対象年月 画面 データベースから取得した請求書PDF情報1レコードの「請求対象年月」の保存された値が指し示す選択肢のラベルを出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「取引先企業名」「取引金額」「請求対象年月」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が 200,000 を超えていた場合、以降は総件数を200,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の請求書PDFデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき請求書PDF情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read invoice_pdf_files list. page={ページ番号} company_name={取引先企業名} billing_price={取引金額} billing_year_and_month={取引対象年月} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "718635198",
  "parentTitle": "300_■請求書PDF管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/718504259/301-2_+PDF",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-12-12T06:02:06.906Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】請求：請求書PDF および 【FIX】請求：基本情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、表示可能なレコードの総数を表示する。 1ペー..."
}