{
  "id": "723353762",
  "title": "106_【編集機能へ統合のため削除】商品公開フラグ切り替え機能",
  "content": "目次 概要 本機能は 【レビュー中】商品マスタ（統合版） の登録済みのデータの公開・非公開を切り替えるための機能です。複数の商品を指定して一度に公開、一度に非公開を行うことができます。 要求事項 管理画面にログインすることができる全体管理者のみが本機能を利用することができる。 本機能は画面を持たないRESTful APIで良い。 登録されている 【レビュー中】商品マスタ（統合版） が表示されている 101_【作成中】商品管理一覧閲覧機能 のうち同一ページ内に表示されている複数のデータと公開/非公開を指定して、指定された状態に一度に切り替えることができる。 本機能の実行でエラーが発生した場合はその旨を一覧画面でエラー内容を把握することができる。 サーバーサイドのHTTPレスポンスステータスが200以外の場合はフロントエンドでステータスと適切なメッセージを表示する。 要件定義 ユーザーインターフェース（画面） RESTful APIとし、リクエストボディをJSON / レスポンスボディもJSON形式とする。 入力 変数名、説明、バリデーションは、 【レビュー中】商品マスタ（統合版） の記載を前提とし、本ページに固有の特記事項のみ記載する。 100_【作成中】商品管理機能 に記載の共通入力・取得項目は項目自体を省略する。 「制限」に「必須」とある場合に入力がない場合のエラーメッセージは統一して「{項目名}を入力してください」とする。 項目名 変数名 入力元 説明 バリデーション ID id リクエストボディ 編集する対象の商品の商品番号を配列形式で複数入力することができる。 入力がない、または、要素のうち一つ以上が自然数ではない、または指定番号の商品レコードがデータベースに存在しない場合 エラーメッセージは出力せず存在しない商品番号をスキップして正しい番号に対してのみ処理を実行する。 公開フラグ open リクエストボディ 指定された複数の商品データをTrueなら公開し、Falseなら非公開にする。指定された商品データの元々の状態は確認しなくて良い。 True/False以外が指定された場合はFalseとして扱い、エラーは発生させない。 出力 説明は、 【レビュー中】商品マスタ（統合版） の記載を前提とし、本ページに固有の特記事項のみ記載する。 100_【作成中】商品管理機能 に記載の共通出力項目は項目自体を省略する。 出力項目 出力先 説明 成功商品ID JSONボディ 公開フラグを指定の状態に変更できた商品の商品番号配列を各要素JSONエスケープ処理をして出力する。 失敗商品ID JSONボディ 公開フラグを指定の状態に変更できなかった商品の商品番号配列を各要素JSONエスケープ処理をして出力する。 公開フラグ JSONボディ 入力で指定された公開フラグを処理した値をJSONエスケープして出力する。 処理 ログイン状態を確認し、ログイン認証されていない場合、または管理者権限でログインしていない場合はレスポンスステータスを401 Unauthorizedを出力してサーバーサイドの処理を終了し、フロントエンドの処理でログイン画面にリダイレクトする。 管理者権限でログインしていた場合に、商品の変更権限がない場合は403 Forbiddenを出力してサーバーサイドの処理を終了し、フロントエンドの処理で「変更権限がありません」とメッセージを表示する。 リクエストボディからJSONをパースして入力された公開フラグを確認しTrue以外の値であればFalseとして以降の処理を実行する。 リクエストボディからJSONをパースして商品番号の配列を取り出し、各要素に指定された商品が存在するか確認をおこなって、存在する商品番号のみの配列と存在しない商品番号のみの配列を生成する。 存在する商品番号のみの配列に含まれる商品の公開フラグをリクエストボディで入力された公開フラグの値に一括更新する。 入力された公開フラグと、存在する商品番号のみの配列、存在しない商品番号のみの配列をJSON形式に格納し、レスポンスボディに出力して処理を終了する。 エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 ログ 一覧を表示した場合に下記フォーマットでログを出力する User {管理者ID} managed to access on service open. id={商品番号,商品番号,商品番号&hellip;} open={True/False} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 制限事項 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "704676285",
  "parentTitle": "100_【FIX】商品管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/723353762/106_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-18T02:31:02.207Z",
  "author": "ejiri_yusuke",
  "excerpt": "目次 概要 本機能は 【レビュー中】商品マスタ（統合版） の登録済みのデータの公開・非公開を切り替えるための機能です。複数の商品を指定して一度に公開、一度に非公開を行うことができます。 要求事項 管理画面にログインすることができる全体管理者のみが本機能を利用することができる。 本機能は画面を持たないRESTful APIで良い。 登録されている 【レビュー中】商品マスタ（統合版） が表示されている..."
}