{
  "id": "724435027",
  "title": "【FIX】求人：勤務条件・指導科目",
  "content": "1. 概要 クライアント企業から提供された 求人フォーマット（本システム外） をもとに、全体管理者が全体管理画面の、あるいはクライアント企業管理者がクライアント企業向け管理画面の、それぞれ対象の教室の求人管理ページに登録する求人の付帯情報。 【FIX】求人：基本情報 1件に対して1レコード作成される。 2. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】求人登録・公開・削除フロー 3. 詳細 入力項目 変数名 値の形式 制限 説明 1 求人番号 数値 自然数 指定した番号の 【FIX】求人：基本情報 が存在すること 2 勤務条件 複数選択 「短期OK」「長期勤務歓迎」「平日のみOK」「週末のみOK」「 夕方（16時）からの勤務歓迎 」「 夜（18時）からの勤務歓迎 」「曜日固定ナシ」「複数教科指導歓迎」「他塾かけもちOK」「他塾かけもち不可」 「 副業可 」「 副業不可 」 「在宅勤務可」から選択する。 「副業可」と「副業不可」は同時に選択不可とする。 「他塾かけもちOK」と「他塾かけもち不可」は同時に選択不可とする。 雇用形態が「正社員」「契約社員」の場合のみ選択可能な選択肢。 「時短勤務あり」 3 会社・職場の特徴 複数選択 「雇用形態」が「正社員」「契約社員」の場合のみ選択可能とする。 雇用形態が「正社員」「契約社員」の場合のみ選択可能な選択肢。 「残業月20時間以内」「固定残業無し」「オフィス内禁煙・分煙」「頑張りをしっかり評価」 4 最低勤務期間 数値 自然数 1〜24 単位は「ヶ月」とする。 5 最低勤務期間：補足説明 文字列 50文字以下 共通要件 の定義に従う 6 勤務時間：平日（開始時間） 時刻 共通要件 の定義に従う。 7 勤務時間：平日（終了時間） 時刻 勤務時間：平日（開始時間）より前の時間は登録できない。 共通要件 の定義に従う。 8 勤務時間：土曜（開始時間） 時刻 共通要件 の定義に従う。 9 勤務時間：土曜（終了時間） 時刻 勤務時間：土曜（開始時間）より前の時間は登録できない。 共通要件 の定義に従う。 10 勤務時間：日曜（開始時間） 時刻 共通要件 の定義に従う。 11 勤務時間：日曜（終了時間） 時刻 勤務時間：日曜（開始時間）より前の時間は登録できない。 共通要件 の定義に従う。 12 勤務時間：補足説明 文字列 200文字以下 共通要件 の定義に従う 13 勤務可能最低日数 単一選択 「週1日からOK」「週2日～週3日からOK」「週4日以上からOK」から選択する。 14 勤務可能曜日 複数選択 「月」「火」「水」「木」「金」「土」「日」「祝」から選択する。 15 勤務可能曜日：補足説明 文字列 50文字以下 共通要件 の定義に従う 16 勤務可能曜日：補足説明 文字列 20文字以下 共通要件 の定義に従う 17 指導学年 複数選択 「幼児」「小学生指導（補習）」「小学生指導（中学受験）」「中学生指導（補習）」「中学生指導（高校受験）」「高校生指導（補習）」「高校生指導（大学受験）」「浪人生」「その他」から選択する。 18 指導科目 ：小学生 複数選択 指導可能科目 を参照する。 19 指導科目：中学生 複数選択 指導可能科目 を参照する。 20 指導科目：高校生 複数選択 指導可能科目 を参照する。 21 指導科目：その他 複数選択 指導可能科目 を参照する。 22 指導科目：その他：その他 文字列 50文字以下 「その他」を選択された場合、記入が必要。 共通要件 の定義に従う 23 指導経験 複数選択 雇用形態によらず選択可能な選択肢。 「塾アルバイト経験者歓迎」「集団指導経験者歓迎」「中学受験指導経験者歓迎」「高校受験指導経験者歓迎」「大学受験指導経験者歓迎」 雇用形態が「正社員」「契約社員」の場合のみ選択可能な選択肢。 「教室長経験者歓迎」「教員経験歓迎」 24 服装・髪型 複数選択 選択肢内 「私服OK」「置きスーツOK」 「オフィスカジュアル」 「茶髪可」「茶髪不可」 から選択する。 「茶髪可」と「茶髪不可」は同時に選択不可とする。 25 服装規定 文字列 200文字以下 共通要件 の定義に従う 26 【作成中】帳票共通項目 で定める項目を持つ。 27 【作成中】帳票共通項目 で定める項目を持つ。 28 【作成中】帳票共通項目 で定める項目を持つ。 29 【作成中】帳票共通項目 で定める項目を持つ。 30 【作成中】帳票共通項目 で定める項目を持つ。 31 【作成中】帳票共通項目 で定める項目を持つ。",
  "parentId": "686129350",
  "parentTitle": "【FIX】求人：基本情報",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/724435027/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-10T04:01:47.473Z",
  "author": "isamu saito",
  "excerpt": "1. 概要 クライアント企業から提供された 求人フォーマット（本システム外） をもとに、全体管理者が全体管理画面の、あるいはクライアント企業管理者がクライアント企業向け管理画面の、それぞれ対象の教室の求人管理ページに登録する求人の付帯情報。 【FIX】求人：基本情報 1件に対して1レコード作成される。 2. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】求人登..."
}