{
  "id": "729907317",
  "title": "【FIX】Amazonギフト券発行・金額確認フロー",
  "content": "1 7 1. 概要 全体管理者が、採用お祝いフローにおけるお祝い①口コミ登録のお礼としてAmazonギフト券を登録し、その利用部署の紐付けを行いつつAmazonギフト券の発行し、会員へギフト券を送信するフロー。 また、一定月ごとに発行金額の確認を行うフロー。 ここでは 【FIX】採用お祝い/口コミ確認・公開フロー をもとにフローを記述していますが 以下の登録理由の場合 においても本フローを使用するとする。 お祝い② お祝い③ キャンペーン商品 謝礼 インタビュー謝礼 t-newsポイント交換 ※登録はAmazonギフト券のデータ自体の保存を指し、発行は登録済みのAmazonギフト券を有効化する処理を指し、送信は会員へギフトコードを メール で送信する処理を指す。 2. Amazonギフト券登録 フロー 内容 誰が 1 【FIX】採用お祝い/口コミ確認・公開フロー ステップ8もしくはステップ10において、 【作成中】採用お祝い申請 の承認ステータスを「承認」で登録作業が行われる。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、新規登録ボタンを押下する。 全体管理者 4 【FIX】Amazonギフト券情報 登録に必要な情報をフォームに入れ、登録ボタンを押下する。 利用部署、発行理由は 登録済みの部署 、登録理由が選択できる。 全体管理者 3. Amazonギフト券編集 フロー 内容 誰が 1 登録済みの 【FIX】Amazonギフト券情報 において、編集したいという要請を受ける、もしくは自ら編集したいという 【FIX】Amazonギフト券情報 を見つける。 編集するケースとしては以下のパターンが想定される 会員IDを間違って記述してしまい会員を間違えているため、会員IDを編集する。 Amazonギフト券を登録後会員からメールアドレスを変更した旨を受け、メールアドレスを編集する 婚姻したことにより、名字を変更したため氏名を変更したいという旨を受け、氏名を編集する。 当初想定していた部署に経費として計上する想定だったが、別の部署の経費として計上したいという旨を受け、利用部署を編集する。 発行理由を採用お祝いフローにおける、お祝い①を選択していたが、キャリアの採用でお祝い②だということをが発覚し発行理由を編集する。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し編集ボタンを押下する。 全体管理者 4 【FIX】Amazonギフト券情報 編集に必要な情報をフォームに入れ、更新ボタンを押下する。 利用部署、発行理由は登録済みの 【不要のため削除】部署 、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/732004689 が選択できる。 全体管理者 4. Amazonギフト券削除フロー 内容 誰が 1 登録済みの 【FIX】Amazonギフト券情報 において、削除したいという要請を受ける、もしくは自ら削除したいという 【FIX】Amazonギフト券情報 を見つける。 削除するケースとしては以下のパターンが想定される 誤って同じ 【FIX】Amazonギフト券情報 を重複して作成してしまった場合、対象の 【FIX】Amazonギフト券情報 を削除する。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し削除ボタンを押下する。 全体管理者 4 削除しても良いかのダイアログが表示され、OKを押した場合は削除対象の 【FIX】Amazonギフト券情報 は削除される。 全体管理者 5. Amazonギフト券発行フロー 内容 誰が 1 登録済みの 【FIX】Amazonギフト券情報 において、発行したいという要請を受ける、もしくは自ら発行したいという 【FIX】Amazonギフト券情報 を見つける。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し詳細ボタンを押下する。 全体管理者 4 ギフト券発行ボタンを押下する。発行が成功した場合はギフト券管理一覧ページへリダイレクトされる。失敗した場合は、時間をおいて再度発行する旨を表示し、ギフト券詳細画面ページへリダイレクトする。 全体管理者 6. Amazonギフト券発行取消フロー ※システム管理者のみ実行可能とする 権限についての詳細は以下を参照する 権限 内容 誰が 1 発行済みの 【FIX】Amazonギフト券情報 において、発行取消したいという要請を受ける、もしくは自ら発行取消したいという 【FIX】Amazonギフト券情報 を見つける。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し詳細ボタンを押下する。 全体管理者 4 発行取消ボタンを押下すると「発行済のギフト券を発行取消してもよろしいですか？」と確認ダイアログが表示され、OKを押下した場合は発行取消処理を行う。 キャンセル を押下した場合は処理を行わない。 全体管理者 5 発行取消処理が成功した場合はギフト券管理一覧ページへリダイレクトされる。失敗した場合は、時間をおいて再度発行取消する旨を表示し、ギフト券詳細画面ページへリダイレクトする。 本システム 7. Amazonギフト券送信フロー(バッチ) 内容 誰が 1 Amazonギフト券発行フローおいて、発行済の 【FIX】Amazonギフト券情報 を定期的なバッチ処理にて、すべて会員宛にギフトコードを メール （ 採用お祝い進呈メール（会員宛） ）で送信する形で自動進呈する。 本システム 2 送信されたメールは メール送信履歴 として保存されるが、本フローの場合は本文のギフト券番号はマスクした状態で保存される。 本システム 8. Amazonギフト券送信フロー(手動) 内容 誰が 1 発行済みの 【FIX】Amazonギフト券情報 において、送信したいという要請を受ける、もしくは自ら送信したいという 【FIX】Amazonギフト券情報 を見つける。 送信するケースとしては以下のパターンが想定される。 緊急で会員にAmazonギフト券を送信する必要がある。 何かしらの理由でバッチによる送信が失敗している場合。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し詳細ボタンを押下する。 全体管理者 4 ギフト券送信ボタンを押下する。送信が成功した場合はギフト券管理一覧ページへリダイレクトされる。失敗した場合は、時間をおいて再度送信する旨を表示し、ギフト券詳細画面ページへリダイレクトする。 全体管理者 5 送信時に対象会員へ、 【FIX】Amazonギフト券情報 のギフト券番号が掲載された メール が送信される。 本システム 6 送信されたメールは メール送信履歴 として保存されるが、本フローの場合は本文のギフト券番号はマスクした状態で保存される。 本システム 9. Amazonギフト券再送信フロー 内容 誰が 1 送信済みの 【FIX】Amazonギフト券情報 において、再送信したいという要請を受ける、もしくは自ら再送信したいという 【FIX】Amazonギフト券情報 を見つける。 発行するケース としては以下のパターンが想定される。 メールを受信した会員から再送信の依頼があった場合 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込み、対象 【FIX】Amazonギフト券情報 を検索し詳細ボタンを押下する。 全体管理者 4 ギフト券再送信ボタンを押下する。再送信が成功した場合はギフト券管理一覧ページへリダイレクトされる。失敗した場合は、時間をおいて再送信する旨を表示し、ギフト券詳細画面ページへリダイレクトする。 全体管理者 5 対象会員へ、 【FIX】Amazonギフト券情報 のギフト券番号が掲載された メール が送信される。 本システム 6 送信されたメールは メール送信履歴 として保存されるが、本フローの場合は本文のギフト券番号はマスクした状態で保存される。 本システム 10. Amazonギフト券集計フロー 内容 誰が 1 月に一度部署ごとに 【FIX】Amazonギフト券情報 の合計を経費に計上する必要がある。その際に管理画面で 【FIX】Amazonギフト券情報 の合計を確認する。 全体管理者 2 全体管理画面にログインを行う。 全体管理者 3 全体管理画面の 【FIX】Amazonギフト券情報 管理ページにアクセスし、集計対象を、ID/リクエストID、ステータス、ギフト券番号、ギフト券ID、メールアドレス、氏名、会員ID、金額、利用部署、発行理由、登録日時、ギフト券発行日時、有効期限、送信日時、更新日時で絞り込む。 全体管理者 4 絞り込んだ結果すべてのギフト金額合計をページに表示する。 本システム 11. 帳票 【FIX】Amazonギフト券情報 12. 関連用語 13. メール オシゴトQ＆A質問通知メール（クライアント企業管理者宛） 採用お祝い進呈メール（会員宛） 14. 関連チケット CTJ-461 0f376871-0459-35fc-b139-2a34c915ec22 System JIRA",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/729907317/FIX+Amazon",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-06-07T05:34:02.801Z",
  "author": "ejiri_yusuke",
  "excerpt": "1 7 1. 概要 全体管理者が、採用お祝いフローにおけるお祝い①口コミ登録のお礼としてAmazonギフト券を登録し、その利用部署の紐付けを行いつつAmazonギフト券の発行し、会員へギフト券を送信するフロー。 また、一定月ごとに発行金額の確認を行うフロー。 ここでは 【FIX】採用お祝い/口コミ確認・公開フロー をもとにフローを記述していますが 以下の登録理由の場合 においても本フローを使用する..."
}