{
  "id": "740163745",
  "title": "125_【FIX】企業詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】企業：基本情報 【FIX】企業：設定情報（全体管理者向け） 【FIX】企業：設定情報（クライアント企業向け） 【FIX】企業：請求先・振込先マスタ の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが利用することができる。 本機能は 【FIX】企業：基本情報 【FIX】企業：設定情報（全体管理者向け） 【FIX】企業：設定情報（クライアント企業向け） 【FIX】企業：請求先・振込先マスタ に記載の全ての項目について、1URL=1レコードで保存された値を表示して閲覧することができる。 本ページには以下を表示する ボタン群 担当者管理 押下すると 131_【FIX】企業担当者一覧閲覧機能 に遷移する。 教室管理 押下すると 161_【FIX】教室一覧閲覧機能 に遷移する 。 メッセージテンプレート管理 押下すると 141_【作成中】メッセージテンプレート一覧閲覧機能 に遷移する。 パーソナルオファー代行 押下すると （ 192_【統合により削除】オファー一覧閲覧機能（企業単位） は削除）該当企業で絞り込まれた状態の 191_【FIX】オファー 一覧閲覧機能 に遷移する。 自動オファー代行 （ステーション） 押下すると 対象サイトを「ステーション」に絞った内容の 194_【FIX】自動オファー設定機能 に遷移する。 自動オファー代行（キャリア） 押下すると対象サイトを「キャリア」に絞った内容の 194_【FIX】自動オファー設定機能 に遷移する。 教室アクセス集計 押下すると 128_【作成中】教室毎アクセス集計期間設定機能 に遷移する。 契約管理 押下すると 111_【FIX】契約一覧閲覧・検索機能 に遷移する。 請求先・振込先マスタ管理 押下すると 472_【FIX】請求先マスタ一覧閲覧機能 に遷移する。 応募者移管 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/1488027653/215_?atlOrigin=eyJpIjoiNTk2ZDJiMjVjNGQ5NDJmNWI2YTE4YzNiZDExMThhNGUiLCJwIjoiYyJ9 に遷移する。 本ページの 「要件定義」-「出力」欄 で出力先として「画面」が定義されている項目 編集ボタン 押下することで 123_【FIX】企業編集機能 に遷移する。 削除ボタン 押下すると、 124_【FIX】企業削除機能 の定義に従って削除処理を実行する。 一覧に戻るボタン 押下することで 121_【FIX】企業一覧閲覧機能 に遷移する。 存在しない企業が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入った ログ を出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、企業番号( 【FIX】企業：基本情報 の企業番号)、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみ 3.2. 帳票 120_【FIX】企業管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 120_【FIX】企業管理機能 の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=2109-34545&amp;t=nGyEaqDZcand6mWG-4 4.2. 入力 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 &hellip; URLパラメータ 閲覧する企業を一意に指定するためのID &hellip; 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 企業番号 画面 HTMLエスケープ処理をして出力する。 2 企業コード 画面 HTMLエスケープ処理をして出力する。 3 企業名 画面 HTMLエスケープ処理をして出力する。 4 企業名カナ 画面 HTMLエスケープ処理をして出力する。 5 電話番号 画面 HTMLエスケープ処理をして出力し 、 形式は(例）「0123456789」のように表示する。 6 メールアドレス 画面 HTMLエスケープ処理をして出力する。 7 郵便番号 画面 HTMLエスケープ処理をして出力し 、形式は(例)「〒1234567」のように表示する。 8 都道府県 画面 保存された値が指し示す選択肢のラベルを出力する。 9 市区町村 画面 保存された値が指し示す選択肢のラベルを出力する。 10 以降の住所 画面 HTMLエスケープ処理をして出力する。 11 管理メモ1 画面 入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 12 管理メモ2 画面 入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 13 教室グループ 画面 企業に紐づく教室グループ名をHTMLエスケープ処理をして表示し、押下すると 153_【FIX】教室グループ詳細閲覧機能 へ遷移する。 14 パーソナルオファー利用可フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 15 広告CSV出力フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 16 採用確認CSV利用可フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 17 群・キャリア 画面 保存された値が指し示す選択肢のラベルを出力する。 18 群・ステーション 画面 保存された値が指し示す選択肢のラベルを出力する。 19 教室情報表示フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 20 Station口コミ表示 画面 保存された値が指し示す選択肢のラベルを出力する。 21 採用確認タイプ 画面 保存された値が指し示す選択肢のラベルを出力する。 22 一発応募 画面 保存された値が指し示す選択肢のラベルを出力する。 23 オシゴトQ＆A機能表示フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 24 オシゴトQ＆Aメール通知フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 25 非掲載教室の表示可フラグ 画面 保存された値が指し示す選択肢のラベルを出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 URL文字列から入力された企業番号文字列を取得し、企業番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 企業番号文字列を元にデータベースから 【FIX】企業：基本情報 【FIX】企業：設定情報（全体管理者向け） 【FIX】企業：設定情報（クライアント企業向け） を取得する。対象の企業番号のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の企業データが存在したら、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745#4.3.-%E5%87%BA%E5%8A%9B の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read company detail. company_number={企業番号} company_code={企業コード} company_name={企業名} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 特になし",
  "parentId": "704675888",
  "parentTitle": "120_【FIX】企業管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/740163745/125_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-16T05:03:48.877Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】企業：基本情報 【FIX】企業：設定情報（全体管理者向け） 【FIX】企業：設定情報（クライアント企業向け） 【FIX】企業：請求先・振込先マスタ の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが利用することができる。 本機能は 【FIX】企業..."
}