{
  "id": "743473812",
  "title": "721_【作成中】学年自動更新バッチ",
  "content": "1. 概要 本バッチ処理は以下の処理を行う。 対象会員の学年を自動で更新する。 対象会員の現在の職業を自動で更新する。 本バッチは毎月2日0:00(JST)に自動実行するように設置する。 2. 要求事項 2.1. 共通 コマンドラインで実行できるものとする。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 バッチ処理を終了したらバッチ処理が終了した旨のメッセージと終了日時を含むログを出力する。 本仕様で問題なく処理を実行できる目安となる件数は50,000件である。2時間以内に最大50,000件の処理を行えるパフォーマンスを確保する。 2.2. 学年更新 以下を全て満たす会員を抽出する。 条件1 「入学年・月：年」が設定されている 「入学年・月：月」が当月である 「現状の職業」 が以下のいずれか 高校生（卒業見込み） 大学生 大学院生 「大学：学年」以下のいずれか 大学1~6年生 修士1~2年生 博士1~3年生 入学見込み 「学年更新日」がNULL もしくは 1ヶ月以上前 「会員ステータス」が「正常」 条件2 下記で算出した「入学からの経過年数」が 表1の条件 を満たしている。 入学からの経過年数 = 当年 - 「入学年・月：年」 抽出した会員において、表2の 学年更新処理 を行う。 「大学：学年」を下記表の通り更新する。 「学年更新日」に実行日を入れる。 「学年更新ステータス」に 2 を入れる。 表1 「入学からの経過年数」ごとの対象判定条件 入学からの経過年数 対象となる条件 7 以上 対象外 6 「大学：学年」が「学部6年生」 5 「大学：学年」が「学部6年生」ではない 4 「大学：学年」が「学部5年生」「学部6年生」ではない 3 「大学：学年」が「学部4年生」「学部5年生」「学部6年生」ではない 2 「大学：学年」が「学部3年生」「学部4年生」「学部5年生」「学部6年生」「博士3年生」ではない 1 「大学：学年」が「学部2年生」「学部3年生」「学部4年生」「学部5年生」「学部6年生」「修士2年生」「博士2年生」「博士3年生」ではない 0 「大学：学年」が「入学見込み」 -1以下 対象外 表2 学年の更新内容 更新前 更新後 入学見込み 学部1年生 学部1年生 学部2年生 学部2年生 学部3年生 学部3年生 学部4年生 学部4年生 学部5年生 学部5年生 学部6年生 学部6年生 卒業 修士1年生 修士2年生 修士2年生 卒業 博士1年生 博士2年生 博士2年生 博士3年生 博士3年生 卒業 2.3. 現在の職業の更新 下記の条件を全て満たす会員は、「現在職業」を「大学生」にする。 「現在の職業」が「高校生（卒業見込み）」 「大学：学年」に「中退」「卒業」以外の値が設定されている 「入学年・月：年」「入学年・月：月」を組み合わせた入学年月が当月以前 2.4. メールテンプレート なし 2.5. ワークフロー なし 3. 要件定義 3.1. 入力 3.2. 出力 3.3. 処理 バッチ処理を開始したら、バッチ処理を開始した旨のログを出力する。 書式については https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/743473812/721_#3.5.-%E3%83%AD%E3%82%B0 を参照する。 各レコードごとに値の更新処理を実施したら、実施結果に応じたログを出力する。 書式については https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/743473812/721_#3.5.-%E3%83%AD%E3%82%B0 を参照する。 バッチ処理終了時には、バッチ処理が終了した旨のメッセージと終了日時を含んだログを出力する。 書式については https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/743473812/721_#3.5.-%E3%83%AD%E3%82%B0 を参照する。 3.4. エラー処理 下記通知先にエラーログ通知を行う。 【FIX】バッチエラー時通知先 3.5. ログ バッチ略称はuser grade update (UGU) とする。 バッジ処理全体が開始した時と終了した時に以下のログを出力する。 開始時 [721_UGU] Started at {処理開始日時}. 終了時 [721_UGU] Finished at {処理終了日時}. 学年を更新時 成功時 [721_UGU] updated user grade. user_id={ユーザー番号} grade=[変更前],[変更後] time={現在時刻}. 失敗時 [721_UGU] failed to update user grade. user_id={ユーザー番号} time={現在時刻}. 現在の職業を更新時 成功時 [721_UGU] updated user current_occupation. user_id={ユーザー番号} current_occupation=[変更前],[変更後] time={現在時刻}. 失敗時 [721_UGU] failed to update user current_occupation. user_id={ユーザー番号} time={現在時刻}. 4. スコープ外・制限事項 -",
  "parentId": "744816858",
  "parentTitle": "720_■会員情報関連バッチ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/743473812/721_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-03-31T04:47:41.036Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 本バッチ処理は以下の処理を行う。 対象会員の学年を自動で更新する。 対象会員の現在の職業を自動で更新する。 本バッチは毎月2日0:00(JST)に自動実行するように設置する。 2. 要求事項 2.1. 共通 コマンドラインで実行できるものとする。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 バッチ処理を終了したらバッチ処理が終了した旨のメッ..."
}