{
  "id": "744325261",
  "title": "762_【FIX】採用後6ヶ月アンケート回答依頼メール送信バッチ",
  "content": "1. 概要 本バッチ処理は以下の処理を行う。 1回目の採用お祝い進呈処理が完了した日を起点に6ヶ月（180日）経過後、アンケート依頼メールを該当の会員に送付する。 正式指導開始日の6ヶ月後同日の翌日に、アンケート依頼メールを送付する 本バッチは毎日9:05(JST)に自動実行するように設置する。 2. 要求事項 コマンドラインで実行できるものとする。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 【レビュー中】採用お祝い申請 から以下の条件のデータを抽出し、採用お祝い申請ごとにメール送信処理を行う。 アンケート番号が1である。 紐ついた 【FIX】Amazonギフト券情報 のギフト券送信日時が処理時点の日付から、180日以前である。 紐づく 【レビュー中】お祝い申請：質問・回答 の「正式指導日」の6ヶ月後同日の翌日である。 同じ応募番号でアンケート番号が3の 【レビュー中】採用お祝い申請 が存在しない。 採用後6ヶ月アンケート回答依頼メール送信日時が空である。 会員が退会していない。 801_【FIX】バウンスメール処理バッチ で保存したバウンスしているメールアドレスかどうか確認し、バウンスメールアドレスに該当するならメール送信処理は行わず以下の情報が入ったログを出力する。 実行日時、お祝い申請番号、メール送信をスキップしたことがわかる情報 バウンスメールアドレスに該当しないなら 6ヶ月後採用お祝い申請期間開始通知メール（会員宛） を 【レビュー中】採用お祝い申請 に紐ついた応募者の メールアドレスに送信する。 メール送信を実行したら以下の情報が入ったログを出力する。 実行日時、採用お祝いID、会員ID、対象メールアドレス、アクション（成功or失敗） メール送信に成功した場合は 【レビュー中】採用お祝い申請 の「採用後6ヶ月アンケート回答依頼メール送信日時」に現在時刻を登録する。 メール送信が失敗した場合はリトライ処理を行わない 必達終了時間は9:05(JST)開始の場合は10:05(JST)とする。処理開始日時から処理終了日時まで1時間以内に完了するようにパフォーマンスを確保する。 上記仕様で問題なく処理を実行できる目安となる件数は10,000件である。1時間以内に最大10,000件の処理を行えるパフォーマンスを確保する。 バッチ処理終了時には、バッチ処理が終了した旨のメッセージと終了日時を含んだログを出力する。 本機能からメールを送信した際、 【作成中】メール送信履歴 を保存する。 2.1. メールテンプレート 6ヶ月後採用お祝い申請期間開始通知メール（会員宛） 2.2. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 3. 要件定義 3.1. 入力 入力項目 変数名 入力方式 説明 バリデーション アンケート番号 データベース 帳票を参照 【レビュー中】採用お祝い申請 ギフト券送信日時 データベース 帳票を参照 【FIX】Amazonギフト券情報 採用後6ヶ月アンケート回答依頼メール送信日時 データベース 帳票を参照 【レビュー中】採用お祝い申請 3.2. 出力 出力項目 出力方式 説明 送信対象メールアドレス メールテンプレート 送信対象のメールアドレス。 6ヶ月後採用お祝い申請期間開始通知メール：会員の氏名 メールテンプレート 【FIX】応募情報 から対象の会員を紐付け可能 6ヶ月後採用お祝い申請期間開始通知メール：教室グループ名 メールテンプレート 【FIX】応募情報 から 【FIX】求人：基本情報 に紐付け、 【FIX】教室：基本情報／所在地 対象の教室グループを紐付け可能 6ヶ月後採用お祝い申請期間開始通知メール：教室名 メールテンプレート 【FIX】応募情報 から 【FIX】求人：基本情報 から対象の教室を紐付け可能 6ヶ月後採用お祝い申請期間開始通知メール： 贈呈金額 メールテンプレート デフォルトを2,000円とし、採用お祝い金の可変化機能を実装した後はその金額を表示する。 3.3. 処理 3.4. エラー処理 下記通知先にエラーログ通知を行う。 【FIX】バッチエラー時通知先 3.5. ログ バッチ略称はsend questionnaire request mail (SQRM) とする。 バッジ処理全体が開始した時と終了した時に以下のログを出力する。 開始時 [762_SQRM] Started at {処理開始日時}. 終了時 [762_SQRM] Finished at {処理終了日時}. メール送信時 成功時 [762_SQRM] Succeeded to send a questionnaire request mail for user={ユーザー番号} gift_request_number={お祝い申請番号} time={現在時刻} . 失敗時 [762_SQRM] Failed to send a questionnaire request mail for user={ユーザー番号} gift_request_number={お祝い申請番号} time={現在時刻} . バウンスメール対応でメール未送信時 [762_SQRM] Sending pending because of bounce mail for user={ユーザー番号} gift_request_number={お祝い申請番号} time={現在時刻} . 4. スコープ外・制限事項 なし",
  "parentId": "744325304",
  "parentTitle": "760_■採用・採用お祝い関連バッチ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/744325261/762_+FIX+6",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-09T05:49:58.913Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 概要 本バッチ処理は以下の処理を行う。 1回目の採用お祝い進呈処理が完了した日を起点に6ヶ月（180日）経過後、アンケート依頼メールを該当の会員に送付する。 正式指導開始日の6ヶ月後同日の翌日に、アンケート依頼メールを送付する 本バッチは毎日9:05(JST)に自動実行するように設置する。 2. 要求事項 コマンドラインで実行できるものとする。 バッチ処理を開始したらバッチ処理を開始した旨の..."
}