{
  "id": "744423733",
  "title": "763_【FIX】採用お祝い自動承認・関連メール送信バッチ",
  "content": "1. 概要 本バッチ処理は以下の処理を行う。 A：採用お祝い申請（1stと2ndを問わず）を自動で承認する。 B：採用お祝い申請（1stと2ndを問わず）が承認された時、Amazonギフト券を発行し進呈メールを送信する。 C：採用お祝い申請（1stと2ndを問わず）が自動承認できなかった時、その内容を会員に通知メールを送信する。 D： 応募者の採用ステータスと企業側の採用ステータスが異なった場合、 不一致確認が必要な採用お祝い申請について 、その内容を全体管理者とクライアント企業管理者に通知メールを送信する。 E：1つの企業に同じ会員から複数の応募があったときに、全体管理者に通知メールを送信する。 本バッチは 毎日2:(JST)に 自動実行するように設置する 。 2. 要求事項 コマンドラインで実行できるものとする。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 A~Eに共通の処理は以下の通りである。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/743506548 で保存したバウンスしているメールアドレスかどうか確認し、バウンスメールアドレスに該当するならメール送信処理は行わず以下の情報が入ったログを出力する。 バウンスメールアドレスに該当しない場合、メール送信を実行する。 メール送信成功時にログを出力する。 連続してメール送信する場合は、各メールごとに0.1秒間スリープ処理を行う。 メール送信が失敗した場合はリトライ処理を行わない。 以降、A~Eの個別の処理の内容を記載する Aの処理 【レビュー中】採用お祝い申請 から、 次の条件のレコード を 抽出する。 承認ステータスが「未承認」である これは紐づく 【FIX】応募情報 の在籍確認がされている これは紐づく 【FIX】応募情報 の請求確定日がセットされている これは紐づく 【FIX】応募情報 の確認完了がされている 退会済みの会員ではない 以下の処理を 行う。 該当の 【レビュー中】採用お祝い申請 の承認ステータスを「承認」とする。 Bの処理 【レビュー中】採用お祝い申請 から、 次の条件のレコード を 抽出する。 承認ステータスが「承認」である。 アンケート番号が1か3である。 紐づく 【FIX】Amazonギフト券情報 があり、 「ギフト券番号」 が空ではない。 紐づく 【FIX】Amazonギフト券情報 の「ギフト券送信日時」が空である。 紐づく 【FIX】Amazonギフト券情報 がない。 退会済みの会員ではない。 以下の処理を行う。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704446727 を実行する。 利用部署は「講師求人部門」とする。 発行理由は 【レビュー中】採用お祝い申請 に応じて「【塾講師ステーション】採用お祝い」または「【塾講師ステーション】6ヶ月後アンケート謝礼」とする。 登録された 【FIX】Amazonギフト券情報 に対し 、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/762446227 を実行する。 進呈メール を送信する。メールテンプレートは以下の通り。 アンケート番号が1の場合は Amazonギフト券進呈メール（会員宛） アンケート番号が3の場合は 2nd勤務アンケート進呈メール（会員宛） 【FIX】Amazonギフト券情報 の 「ギフト券送信日時」に現在日時を設定する。 【FIX】Amazonギフト券情報 に紐づく 【レビュー中】採用お祝い申請 の 「採用お祝い申請番号」 を登録する。 Cの処理（次月待機） 【レビュー中】採用お祝い申請 から、 次の条件のレコードを 抽出する。 承認ステータスが「未承認」である。 採用ステータス（クライアント企業） が「採用」である。 在籍確認が空である。 研修初日が処理時点で同じ月である。 次月待機メール送信日時が空である。 以下の処理を行う。 次月待機メール（会員宛） を送信する。 次月待機メール送信日時に現在日時を設定する。 Cの処理（保留待機） 【レビュー中】採用お祝い申請 から、 次の条件のレコードを 抽出する。 承認ステータスが「未承認」である。 採用ステータス（クライアント企業）が「保留」である。 保留待機メール送信日時が空である。 以下の処理を行う。 保留待機メール（会員宛） を送信する。 保留待機メール送信日時に現在日時を設定する。 Dの処理 【レビュー中】採用お祝い申請 から、 次 の条件グループ①または②に該当するレコードを 抽出する。なお前月以前とは、起点となる日付の前月末日以前のことを指し、次月以降とは起点となる日付の翌月1日以降のことを指す。 ①②共通の条件 承認ステータスが「未承認」である。 ①の条件： 以下のいずれも合致し ない 採用ステータス が採用かつ、在籍確認が「○」または空欄である 採用ステータスが未登録かつ、 【レビュー中】お祝い申請：質問・回答 の 研修開始日 が処理時点の前月同日（前月同日が存在しない場合は前月末日）以降である ②の条件：以下のいずれかに合致する 提出ステータス が未提出、かつ採用ステータスが採用、かつ在籍確認が空欄、かつ以下のいずれかに合致する 研修初日が研修開始日の次月以降 研修初日が空欄、かつ研修開始日が処理時点の前月以前 提出ステータスが提出中、かつ採用ステータスが採用、かつ以下いずれかに合致する。 研修初日が研修開始日の次月以降 研修初日が「未定」かつ研修開始日が処理時点の前月以前 以下の処理を行う。 ①に該当する場合 不一致通知メール（全体管理者） を送信する。 ①の条件を満たし、かつ提出ステータスが「未提出」で 「クライアント向け不一致確認依頼メール送信日時」が空 だった場合、 不一致確認依頼メール（クライアント） も送信する。 「クライアント向け不一致確認依頼メール送信日時」に処理時間を登録する。 ②に該当する場合 「クライアント向け不一致確認依頼メール送信日時」が空の場合、 不一致確認依頼メール（クライアント） を送信する （ただし条件②-bに該当する場合は送信しない） 。 「クライアント向け不一致確認依頼メール送信日時」に処理時間を登録する。 不一致通知メール（全体管理者） を送信する。 Eの処理 【レビュー中】採用お祝い申請 から、 次の条件 のレコードを 抽出する。 承認ステータスが「未承認」である。 そのお祝い申請をした会員が、応募先の教室が属する企業に複数の応募をしている。 同一企業・別応募メール送信日時が空である。 以下の処理を行う。 同一企業・別応募メール（全体管理者） を 送信する。 対象の全ての採用お祝い申請レコードで、同一企業・別応募メール送信日時に現在日時を設定する。 バッチ処理終了時には、バッチ処理が終了した旨のメッセージと終了日時を含んだログを出力する。 必達終了時間は10:50(JST)とする。処理開始日時から処理終了日時まで1時間以内に完了するようにパフォーマンスを確保する。 上記仕様で問題なく処理を実行できる目安となる件数は10,000件である。1時間以内に最大10,000件の処理を行えるパフォーマンスを確保する。 本機能からメールを送信した際、 【作成中】メール送信履歴 を保存する。 2.1. メールテンプレート 要求定義に記載のテンプレート。 2.2. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 3. 要件定義 3.1. 入力 要求にて定義している内容に従う。 3.2. 出力 要求にて定義している内容に従う。 3.3. 処理 3.4. エラー処理 下記通知先にエラーログ通知を行う。 【FIX】バッチエラー時通知先 3.5. ログ バッチ略称はapprove gift request and send related mails (AGRSRM) とする。 バッジ処理全体が開始した時と終了した時に以下のログを出力する。 開始時 [ 763_AGRSRM ] Started at {処理開始日時}. 終了時 [763_AGRSRM] Finished at {処理終了日時}. Aの処理 成功時 [763_AGRSRM] Succeeded to approve gift request. gift_request_number={採用お祝い番号} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to approve gift request. gift_request_number={採用お祝い番号} time={現在時刻}. Bの処理 成功時 [763_AGRSRM] Succeeded to send amazon gift card. gift_request_number={採用お祝い番号} amazon_gift_card_number={Amazonギフト券情報番号} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to send amazon gift card. gift_request_number={採用お祝い番号} amazon_gift_card_number={Amazonギフト券情報番号} time={現在時刻}. Cの処理（次月待機） 成功時 [763_AGRSRM] Succeeded to send next month stand by mail. gift_request_number={採用お祝い番号} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to send next month stand by mail. gift_request_number={採用お祝い番号} time={現在時刻}. Cの処理（保留待機） 成功時 [763_AGRSRM] Succeeded to send pending stand by mail. gift_request_number={採用お祝い番号} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to send pending stand by mail. gift_request_number={採用お祝い番号} time={現在時刻}. Dの処理 成功時 [763_AGRSRM] Succeeded to send mismatch mail. gift_request_number={採用お祝い番号} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to send mismatch mail. gift_request_number={採用お祝い番号} time={現在時刻}. Eの処理 成功時 [763_AGRSRM] Succeeded to send gift request duplication mail. gift_request_numbers={採用お祝い番号をカンマ区切りで表示する} time={現在時刻}. 失敗時 [763_AGRSRM] Failed to send gift request duplication mail. gift_request_numbers={採用お祝い番号をカンマ区切りで表示する} time={現在時刻}. バウンスメール対応でメール未送信時 [763_AGRSRM] Sending pending because of bounce mail for user={送信できなかったユーザーのユーザー番号をカンマ区切りで} time={現在時刻}. 4. スコープ外・制限事項",
  "parentId": "744325304",
  "parentTitle": "760_■採用・採用お祝い関連バッチ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/744423733/763_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-02T09:35:46.106Z",
  "author": "isamu saito",
  "excerpt": "1. 概要 本バッチ処理は以下の処理を行う。 A：採用お祝い申請（1stと2ndを問わず）を自動で承認する。 B：採用お祝い申請（1stと2ndを問わず）が承認された時、Amazonギフト券を発行し進呈メールを送信する。 C：採用お祝い申請（1stと2ndを問わず）が自動承認できなかった時、その内容を会員に通知メールを送信する。 D： 応募者の採用ステータスと企業側の採用ステータスが異なった場合、..."
}