{
  "id": "744751326",
  "title": "701_【FIX】契約切れ企業ステータス変更＆教室非掲載および契約更新おすすめメール送信バッチ",
  "content": "1. 概要 本バッチ処理プログラムは以下2種類の処理を行うことができる 契約切れの企業のステータスを変更し、紐付く教室を非掲載にする。 参考： 015_【作成中】教室および求人の公開/掲載の条件 契約終了日までの期間に応じて企業宛に 契約更新促進メール（クライアント企業管理者宛） を送信する。 終了または開始したプラン契約に合わせて教室プランを最新化する。 本バッチ処理プログラムは毎日2回条件で自動実行するように設置する。 1回目：10:30(JST)に上記a, b, c 両方 の処理を実行するように設置する。 2回目：14:30(JST)に上記aのみ実行し、 1回目に契約更新に失敗している契約の無効化処理をリトライ するように設置する。 2. 要求事項 コマンドラインで実行し、 契約更新促進メール（クライアント企業管理者宛） を送信をするかどうかをコマンドラインオプションで指定できる。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 概要のcの処理で契約を更新した場合、「classroom_basic_informations」テーブルの「plan」カラムの値と併せて、「plan_priority」カラムの値も更新する。 【FIX】契約情報（統合版） から「 有効期間：終了日時」が、 1週間前 2ヶ月前 〜26日後の 基本契約とその契約に紐づく企業を 抽出 し、契約と企業ごとに以下の処理をおこなう。 ただし、同じ企業＆同じ教室グループ＆同じ対象サイトに対する、現在有効な基本契約（＝更新された基本契約）がある場合は以下の処理は行わない。 実行中の現在日時が 【FIX】契約情報（統合版） の「有効期間：終了日時」を過ぎている場合は、 対象の「無効化日時」に現在日時を挿入して契約を無効化し 、 対象の企業とグループ と対象サイト に紐づく教室の 【FIX】求人：基本情報 の 掲載フラグを非掲載にして 以下の情報が入ったログを出力する。 また、フラグの保存が完了したら エリア平均給与算出共通処理 を実行する。 処理日時、契約番号、企業番号、企業名、教室番号、非掲載にした求人番号（複数の場合はカンマ区切り）、アクション（成功or失敗） 実行中の現在日時が 【FIX】契約情報（統合版） の「有効期間：終了日時」よりも前で、 契約更新促進メール（クライアント企業管理者宛） 送信オプションが指定されている場合、現在の日付が、「有効期間：終了日時」から数えて下記指定日数に該当するなら以下の処理を実行する。 この際、該当有無は、「指定日数＝（契約終了日時-現在日時）[h] / 24[h] の小数点以下切り捨て」で判定する。（例えば、契約終了日時が4/28 1:00で、バッチ実行日時が4/27 10:30の場合、4/28 1:00 - 4/27 10:30 = 14.5h となり、24時間で割ると、14.5h / 24h ≒ 0.6 のため切り捨てて0日前（＝当日）となる。同様に、契約終了日時が4/28 22:00の場合、4/28 22:00 - 4/27 10:30 = 35.5h となり、24時間で割ると、35.5h / 24h ≒ 1.5 のため切り捨てて1日前となる。） ただし、下記の場合は以下の処理は行わない。 ただし、 【FIX】契約情報（統合版） の「更新辞退フラグ」が有効な場合 は以下の処理は行わない。 対象の契約に対して、下記条件を満たす有効な基本契約がすでに存在する場合 同じ企業 同じ対象サイト 契約終了日が後（つまり、リマインド対象の契約の終了日 ＜ すでに存在する契約 の終了日 の場合） 指定日数は下記の通りとする。 25日前 14日前 7日前 5日前 3日前 2日前 1日前 0日前（＝当日） 801_【FIX】バウンスメール処理バッチ で保存したバウンスしているメールアドレスかどうか確認し、バウンスメールアドレスに該当するならメール送信処理は行わず以下の情報が入ったログを出力する。 実行日時、契約ID、企業ID、企業名、メール送信をスキップしたことがわかる情報 バウンスメールアドレスに該当しないなら 契約更新促進メール（クライアント企業管理者宛） を企業基本情報のメールアドレスに送信する。 ただし、該当する契約の内、紐づく「企業」「対象サイト」「有効期間：終了日時」がすべて同じ契約が複数あった場合は、それらのメールは複数送らず、契約番号が最も小さい契約のみをメール送信の対象とする。 メール送信を実行したら以下の情報が入ったログを出力する。 実行日時、契約ID、企業ID、企業名、対象メールアドレス、アクション（成功or失敗） メール送信が失敗した場合のリトライ処理は行わない。 【FIX】契約情報（統合版） から「有効期間：終了日時」が、 1週間前 2ヶ月前 以降 〜26日後 のプラン契約とその契約に紐づく企業を抽出し、契約と企業ごとに以下の処理をおこなう。 実行中の現在日時が​ 【FIX】契約情報（統合版） の「有効期間： 終了 日時」を過ぎている場合は、対象の契約の「無効化日時」に現在日時を挿入し、対象の企業とグループと対象サイトに紐づく教室（ 【FIX】教室：基本情報／所在地 ）の​教室プラン およびプラン優先度 をその時点で有効な契約のプランへ変更して以下の情報が入ったログを出力する。 処理日時、契約番号、企業番号、企業名、教室番号（複数の場合はカンマ区切り）、アクション（成功or失敗） 【FIX】契約情報（統合版） から、実行時点で有効な契約であり、「有効期間：開始日時」が1週間前以降のプラン契約とその契約に紐づく企業を抽出し、契約と企業ごとに以下の処理をおこなう。 対象の企業とグループと対象サイトに紐づく教室（ 【FIX】教室：基本情報／所在地 ）の​教室プラン およびプラン優先度 をその時点で有効な契約のプランへ変更して以下の情報が入ったログを出力する。 処理日時、契約番号、企業番号、企業名、教室番号（複数の場合はカンマ区切り）、アクション（成功or失敗） 必達終了時間は、10:30(JST)開始の場合は12:30(JST)、14:30(JST)開始の場合は16:30(JST)とし、処理開始日時から処理終了日時まで 2時間以内に 完了するようにパフォーマンスを確保する。 上記仕様で問題なく処理を実行できる目安となる処理件数は10,000件とし、2時間以内に最大10,000件の処理を行えるパフォーマンスを確保する。 バッチ処理終了時には、バッチ処理が終了した旨のメッセージと終了日時を含んだログを出力する。 バッジ処理の実行方法は下記の通りとする。 10:30(JST)、14:30(JST)にcronで自動的に毎日実行を行う。 10:30(JST)の実行時には 契約更新促進メール（クライアント企業管理者宛） 送信を実行するオプションを指定して実行する。 14:30の実行時には 契約更新促進メール（クライアント企業管理者宛） 送信実行オプションを指定しないで実行し、契約更新処理のみ行う。 本機能からメールを送信した際、 【作成中】メール送信履歴 を保存する。 2.1. メールテンプレート 契約更新促進メール（クライアント企業管理者宛） 2.2. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 3. 要件定義 3.1. 入力 入力項目 変数名 入力方式 説明 バリデーション 契約番号 データベース 帳票を参照 【FIX】契約情報（統合版） 自然数 企業番号 データベース 帳票を参照 【FIX】企業：基本情報 自然数 企業名 データベース 帳票を参照 【FIX】企業：基本情報 255文字以下 送信対象メールアドレス データベース 企業基本情報のメールアドレス 教室番号 データベース 帳票を参照 【FIX】教室：基本情報／所在地 自然数 求人番号 データベース 帳票を参照 【FIX】求人：基本情報 自然数 コマンドラインオプション コマンドライン コマンドラインで実行する際に、 メールを送信をするかどうかをコマンドラインに引数で指定できるように実装する。 メールテンプレート ファイル メールの本文のテンプレート 3.2. 出力 出力項目 出力方式 説明 契約更新促進メール : 企業名 メール本文 詳細は以下を参照する。 契約更新促進メール（クライアント企業管理者宛） 送信対象メールアドレス メールテンプレート 送信対象の企業基本情報のメールアドレス。 契約終了日時までの日数 メールテンプレート 契約期間：終了日時を使用し、終了までの日数を計算し、メールテンプレートに出力する。 契約終了日時までの日数によりメールテンプレートで文言を出し分ける。 契約無効化処理 : 無効日時 データベース 無効日時をに現在時刻を挿入する 帳票を参照 【FIX】契約情報（統合版） 契約無効化処理 : 非掲載フラグ データベース 教室を非掲載にする。 帳票を参照 【FIX】教室：基本情報／所在地 契約無効化処理 : 掲載フラグ データベース 求人を非掲載にする。 帳票を参照 【FIX】求人：基本情報 3.3. エラー処理 メール送信失敗時、契約無効化失敗時は下記通知先にエラーのログ通知を行う。 【FIX】バッチエラー時通知先 3.4. ログ バッチ略称はsend extend contract term recommend mail (SECTRM) とする。 バッジ処理全体が開始した時と終了した時に以下のログを出力する。 開始時 [701_SECTRM] Started at {処理開始日時}. 終了時 [701_SECTRM] Finished at {処理終了日時}. メール送信時 成功時 [701_SECTRM] Succeeded to send a recommendation email for contract_number={契約番号} company_number={企業番号} company_name={企業名} time={現在時刻} . 失敗時 [701_SECTRM] Failed to send a recommendation email for contract_number={契約番号} company_number={企業番号} company_name={企業名} time={現在時刻} . バウンスメール対応でメール未送信時 [701_SECTRM] Sending pending because of bounce mail for contract_number={契約番号} company_number={企業番号} company_name={企業名} time={現在時刻} . 契約を無効化時 成功時 [701_SECTRM] Succeeded in voiding the contract for contract_number={契約番号} company_number={企業番号} company_name={企業名} classroom_number={教室番号} job_number={求人番号 (カンマ区切り) } time={現在時刻} . 失敗時 [701_SECTRM] Failed in voiding the contract for contract_number={契約番号} company_number={企業番号} company_name={企業名} classroom_number={教室番号} job_number={求人番号 (カンマ区切り) } time={現在時刻} . 教室プランを更新時 成功時 [701_SECTRM] updated plan. contract_number={契約番号} company_number={企業番号} company_name={企業名} classroom_number={教室番号} plan=[変更前],[変更後] time={現在時刻}. 失敗時 [701_SECTRM] failed to update plan. contract_number={契約番号} company_number={企業番号} company_name={企業名} classroom_number={教室番号} time={現在時刻}. 4. スコープ外・制限事項 並行処理・分散処理には対応しない。",
  "parentId": "744554697",
  "parentTitle": "700_■契約関連バッチ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/744751326/701_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-17T02:24:06.529Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 本バッチ処理プログラムは以下2種類の処理を行うことができる 契約切れの企業のステータスを変更し、紐付く教室を非掲載にする。 参考： 015_【作成中】教室および求人の公開/掲載の条件 契約終了日までの期間に応じて企業宛に 契約更新促進メール（クライアント企業管理者宛） を送信する。 終了または開始したプラン契約に合わせて教室プランを最新化する。 本バッチ処理プログラムは毎日2回条件で自..."
}