{
  "id": "825229313",
  "title": "【不要】会員新規登録機能",
  "content": "1. 目次 2. 概要 エンドユーザーがサービスサイトにて会員登録を行うための機能 3. 要求事項 サービスサイトにアクセスするすべてのエンドユーザーが本機能を利用し、 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：指導可能科目 【FIX】会員：指導経験 【レビュー中】会員：設定情報（オファー・メール） 【FIX】会員：設定情報（オファー拒否企業） データを新規登録することができる。 会員登録画面では以下の項目を表示する。 本ページの 要件定義ー「入力」ーユーザーメールアドレス登録機能 欄で入力元が「入力フォーム」と定義されている項目 会員登録するボタン すでに登録済みの方はこちらボタン 登録用ボタンを押下した際、内容に問題があればエラーメッセージが表示される。問題がなければ会員登録用URLを含むメールが送信され、会員登録_メール送信完了ページへ遷移する。 会員登録用URLの取り扱いは以下の通りとする。 有効期限は24時間とする。有効期限を超過したURLは無効とする。 一度再設定が完了したURLは無効となる。 同一メールアドレス宛に再設定用URLを2通以上送信した場合は、最新のURLのみを有効とし、それ以外の過去のURLは無効とする。 無効となった再設定用URLにアクセスした場合、ステータス404（Page Not Found）のページを表示する。 届いたメールにあるトークン付きの登録用URLをクリックすることで会員情報登録画面へ遷移する。 会員情報登録画面には以下の項目を表示する。 本ページの 要件定義ー「入力」ーユーザー情報登録機能 欄で入力元が「入力フォーム」と定義されている項目 本ページの 要件定義ー「出力」ーユーザー情報登録機能 欄で出力形式が「画面」と定義されている項目 入力内容を確認するボタン 押下すると、入力内容にエラーがあればエラーの内容を表示しページ遷移をしない。問題がなければ会員情報登録確認画面に遷移する。 会員情報登録確認画面には以下の項目を表示する。 本ページの 要件定義ー「出力」ーユーザー情報登録確認機能 欄で出力形式が「画面」と定義されている項目 登録するボタン 登録ボタンを押下すると、入力内容にエラーがあれば保存はせずにエラーの内容を表示する。エラーがなければそのまま表示されている内容をデータベースに保存し、システム全体に適用し、会員登録が完了する。 この時同時にログインが行われ、ログイン履歴も記録される。 会員登録完了後には、ユーザーにその旨をメールで通知し、会員情報登録完了画面に遷移する。 会員情報登録完了画面には総合TOPページへリンクするボタンを配置する。 ユーザーが会員登録に成功した場合、以下の情報が入ったログを出力する。 アクセスURI、日時、ユーザーID、アクセス元IPアドレス、ユーザーエージェント、アクション（成功） 3.1. 権限 エンドユーザー 3.2. 帳票 040_■アカウント管理機能 の記載と同じ。 3.3. メールテンプレート 【作成中】会員登録用URL通知メール（会員宛） 【作成中】会員登録完了通知メール（会員宛） 3.4. ワークフロー 040_■アカウント管理機能 の記載と同じ。 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. メールアドレス入力画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=12349-64597&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.1.2. 登録用URLメール送信完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=12349-64610&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.1.3. 会員情報登録画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=12349-64620&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.1.4. 会員情報登録確認画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=12349-64631&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.1.5. 会員登録完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=12349-64639&amp;mode=design&amp;t=fMwtnIRPWpeIo4j9-4 4.2. 入力 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. ユーザーメールアドレス登録機能 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 メールアドレス 入力フォーム 2 利用規約/個人情報保護方針に同意する agreement 入力フォーム &nbsp;チェックボックス accepted 利用規約/個人情報保護方針に同意が必要です。 3 ユーザ登録認証メールテンプレート &nbsp; ファイル ユーザ登録フォームでバリデーションチェックに問題がない時にのみ、ファイルから取得する。テンプレートは 【作成中】会員登録用URL通知メール（会員宛） とする。 文字列長及び書式チェックはプログラムにおいては行わない。メールに記載する内容は、本表以下に記載する。 &nbsp; 4 トークン &nbsp; データベース ユーザ登録認証メールテンプレートに表示させるURLに仕様されるトークン &nbsp; 5 登録認証用のtoken有効期限 &nbsp; 設定ファイル 設定ファイルに記述した、tokenの有効期限（分）。 設定可能な値は1-1440の数値とする。 設定ファイルの記述の数値が不正な場合、または取得できなかった場合は、デフォルト値を60として処理する。 &nbsp; 4.2.2. ユーザー認証機能 入力項目 変数名 入力方式 説明 バリデーション トークン &nbsp; URL 会員仮登録完了メールテンプレートに表示させるURLに使用されるトークン 必須 4.2.3. ユーザー情報登録機能 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 トークン URL 会員仮登録完了メールテンプレートに表示させるURLに使用されるトークン 必須 2 氏名（姓） 入力フォーム 必須 3 氏名（名） 入力フォーム 必須 4 氏名（フリガナ）（姓） 入力フォーム 必須 5 氏名（フリガナ）（名） 入力フォーム 必須 6 パスワード 入力フォーム 必須 7 電話番号 入力フォーム 必須 8 性別 入力フォーム 必須 9 生年月日 入力フォーム 必須 10 都道府県 入力フォーム 必須 11 市区町村 入力フォーム 必須 12 最寄り駅 入力フォーム 13 メルマガ購読可否 入力フォーム 必須 14 現在の職業 入力フォーム 必須 15 最終学歴 入力フォーム 「現在の職業」にて「高校生（卒業見込み）」「大学生」「短大・専門学生」「大学院生」以外を選んだ場合に表示する。 「現在の職業」にて「高校生（卒業見込み）」「大学生」「短大・専門学生」「大学院生」以外を選んだ場合、必須 16 学年 入力フォーム 「現在の職業」にて「大学生」を選んだ場合は「学部1年生」から「中退」「卒業」までを選択肢とする。 「現在の職業」にて「大学院生」を選んだ場合は「修士1年生」から「中退」「卒業」までを選択肢とする。 「現在の職業」にて「大学生」「大学院生」を選んだ場合、必須 17 大学：入試区分 入力フォーム 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合に表示する。 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合、必須 18 所在地 入力フォーム 必須 19 学校名 入力フォーム 必須 20 学校名（かな） 入力フォーム 必須 21 学部名 入力フォーム 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合に表示する。 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合、必須 22 学科名 入力フォーム 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合に表示する。 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合、必須 23 文理 入力フォーム 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」「高校」の場合に表示する。 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」「高校」の場合、必須 24 入学年・月 入力フォーム 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合に表示する。 「現在の職業」が「高校生（卒業見込み）」「大学生」「大学院生」、または「最終学歴」が「大学・大学院」の場合、必須 25 卒業年 入力フォーム 「最終学歴」を選択した場合、または「学年」で「卒業」を選んだ場合に表示する。 「最終学歴」を選択した場合、または「学年」で「卒業」を選んだ場合、必須 26 高校受験経験 入力フォーム 「最終学歴」が「高校」の場合に表示する。 「最終学歴」が「高校」の場合、必須 27 中学受験経験 入力フォーム 「最終学歴」が「中学」の場合に表示する。 「最終学歴」が「中学」の場合、必須 4.2.4. ユーザー情報登録確認機能 項目名 変数名 入力元 説明 制限とエラーメッセージ 4.3. 出力 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. ユーザーメールアドレス登録機能 1 出力項目 出力方式 説明 2 トークン データベース ユーザ登録ページにて、バリデーションに問題がない場合のみ、生成されるトークン。招待用テーブルに保存される。 バリデーションに問題があった場合はなにもしない。 3 メールアドレス データベース ユーザ登録ページにて、バリデーションに問題がない場合のみ、招待用のテーブルに保存する。 バリデーションに問題があった場合はなにもしない。 4 ユーザ登録認証メール メール ユーザ登録ページにて、バリデーションに問題がない場合のみ、ユーザ登録認証メールテンプレートを元に必要な変数を差込変換して送信する。 4.3.2. ユーザー認証機能 出力項目 出力方式 説明 ログイン履歴 データベース ユーザ登録成功時にログイン履歴を保存する。 4.3.3. ユーザー情報登録機能 出力項目 出力方式 説明 1 氏名（姓） 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 2 氏名（名） 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 3 氏名（フリガナ）（姓） 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 4 氏名（フリガナ）（名） 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 5 パスワード 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 6 電話番号 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 7 性別 入力フォーム 入力された値に対応するラベルを出力する。 8 生年月日 入力フォーム 入力された値に対応するラベルを出力する。 9 都道府県 入力フォーム 入力された値に対応するラベルを出力する。 10 市区町村 入力フォーム 入力された値に対応するラベルを出力する。 11 最寄り駅 入力フォーム 入力された値に対応するラベルを出力する。 12 メルマガ購読可否 入力フォーム 入力された値に対応するラベルを出力する。 13 現在の職業 入力フォーム 入力された値に対応するラベルを出力する。 14 最終学歴 入力フォーム 入力された値に対応するラベルを出力する。 15 学年 入力フォーム 入力された値に対応するラベルを出力する。 16 大学：入試区分 入力フォーム 入力された値に対応するラベルを出力する。 17 所在地 入力フォーム 入力された値に対応するラベルを出力する。 18 学校名 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 19 学校名（かな） 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 20 学部名 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 21 学科名 入力フォーム 入力された値をHTMLエスケープ処理をして出力する。 22 文理 入力フォーム 入力された値に対応するラベルを出力する。 23 入学年 入力フォーム 入力された値に対応するラベルを出力する。 24 入学月 入力フォーム 入力された値に対応するラベルを出力する。 25 卒業年 入力フォーム 入力された値に対応するラベルを出力する。 26 高校受験経験 入力フォーム 入力された値に対応するラベルを出力する。 27 中学受験経験 入力フォーム 入力された値に対応するラベルを出力する。 4.3.4. ユーザー情報登録確認機能 出力項目 出力方式 説明 1 氏名（姓 ） 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 2 氏名（名） 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 3 氏名（フリガナ）（姓） 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 氏名（フリガナ）（名） 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 5 パスワード 画面／データベース 管理者登録成功時にハッシュ化したパスワードを保存する。 6 電話番号 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 7 性別 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 8 生年月日 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 9 都道府県 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 10 市区町村 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 11 最寄り駅 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 12 現在の職業 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 13 学校種 データベース 入力された「最終学歴」が「中学」の場合は「中学」、「高校」の場合は「高校」を、それ以外は「大学」として、それぞれSQLインジェクション対策をしてデータベースに保存する。また「現在の職業」が「大学院生」の場合は、追加で「大学院」のレコードもSQLインジェクション対策をしてデータベースに保存する。 14 大学入試区分 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 15 所在地 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 16 学校名 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 17 学校名（かな） 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 18 学部名 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 19 学科名 画面／データベース 対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 20 文理 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 21 学年 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 22 入学年 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 23 入学月 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 24 高校受験経験 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 25 中学受験経験 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 26 メルマガ購読可否 画面／データベース 画面の対象フォーム内に、保存された値に対応するラベルを出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 27 作成者 データベース 【作成中】帳票共通項目 の定義に従う。 28 作成日時 データベース 【作成中】帳票共通項目 の定義に従う。 29 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 30 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. ユーザー登録処理 処理の詳細説明です。 4.4.2. ユーザー認証処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 2段階認証機能は提供しない",
  "parentId": "721289315",
  "parentTitle": "040_■アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/825229313",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-12-19T06:14:58.790Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 エンドユーザーがサービスサイトにて会員登録を行うための機能 3. 要求事項 サービスサイトにアクセスするすべてのエンドユーザーが本機能を利用し、 【FIX】会員：アカウント情報 【FIX】会員：プロフィール情報 【FIX】会員：学歴情報 【FIX】会員：指導可能科目 【FIX】会員：指導経験 【レビュー中】会員：設定情報（オファー・メール） 【FIX】会員：設定情報（オファ..."
}