{
  "id": "833093645",
  "title": "043_2【作成中】プロフィール編集機能（指導経験タブ）",
  "content": "1. 目次 2. 概要 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3. 要求事項 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 「指導経験（家庭教師を含む）」で「あり」を選択すると以下の入力欄を表示する。「なし」を選択すると以下の入力欄は表示しない。 すでに表示されている指導経験の入力欄が4つ以下の場合、指導経験の入力部分の下に「指導経験を追加する」ボタンを表示する。ボタンを押下すると、すでに表示されている指導経験の入力欄が4つ以下の場合、新たに 指導経験の入力欄 を表示する。追加する入力欄に含む入力項目は以下の通り。 指導学年 指導形態 指導年数 指導経験の入力欄が2つ以上の場合、各入力欄の右上に削除アイコンを含むボタンを表示する 。ボタンを押下するとその入力欄を画面から削除する。 3.1. 権限 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3.2. 帳票 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3.3. メールテンプレート 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3.4. ワークフロー 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 4.1.1. 指導・指導経験編集タブ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29598-45628&amp;mode=design&amp;t=T7YBfQRMMW7lqO7M-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 入力項目 変数名 入力元 説明 制限とエラーメッセージ 1 ユーザー番号 入力フォーム 隠しフォーム 編集する対象の会員の 【FIX】会員：アカウント情報 におけるユーザー番号 必須 2 指導可能科目（小学生） 入力フォーム 初期値＝データベースから読み込んだ値 3 指導可能科目（中学生） 入力フォーム 初期値＝データベースから読み込んだ値 4 指導可能科目（高校生） 入力フォーム 初期値＝データベースから読み込んだ値 5 指導可能科目（その他） 入力フォーム 初期値＝データベースから読み込んだ値 6 指導経験（家庭教師を含む） 入力フォーム 初期値＝その会員に紐づく 【FIX】会員：指導経験 が1件以上あれば「あり」、なければ「なし」とする。 必須 7 指導学年 入力フォーム 初期値＝データベースから読み込んだ値 表示されている場合は必須 8 指導形態 入力フォーム 初期値＝データベースから読み込んだ値 表示されている場合は必須 9 指導年数 入力フォーム 初期値＝データベースから読み込んだ値 表示されている場合は必須 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 指導可能科目（小学生） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 2 指導可能科目（中学生） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 3 指導可能科目（高校生） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 4 指導可能科目（その他） データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 5 指導経験（家庭教師を含む） 画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。 6 指導学年 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 7 指導形態 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 8 指導年数 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 9 更新者 データベース 【作成中】帳票共通項目 に従う。 10 更新日時 データベース 【作成中】帳票共通項目 に従う。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。",
  "parentId": "704053299",
  "parentTitle": "043_【FIX】プロフィール編集機能（基本情報タブ）",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/833093645/043_2",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-23T09:09:22.624Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 3. 要求事項 043_【FIX】プロフィール編集機能（基本情報タブ） の記載を参照。 「指導経験（家庭教師を含む）」で「あり」を選択すると以下の入力欄を表示する。「なし」を選択すると以下の入力欄は表示しない。 すでに表示されている指導経験の入力欄が4つ以下の場合、指導経験の入力部分の下に「指導経験を追..."
}