{
  "id": "880607390",
  "title": "301_【FIX】請求書PDF一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能はある1つの 【修正中】請求：基本情報 に紐づく 【FIX】請求：請求書PDF データの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには次の項目を表示する 本ページの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/880607390#4.3.-%E5%87%BA%E5%8A%9B 欄で出力先として「画面」が定義されている項目の内、請求書PDF情報レコードとして定義されている項目 削除ボタン 署名の有無に関わらずボタンは活性である。 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/717685118 へと遷移する。 承認ボタン デフォルトでは表示せず、そのレコードに紐づくPDFファイルが署名済みの場合のみボタンを表示する。 押下すると 【FIX】請求：請求書PDF のステータスを「承認」に更新し、「承認日時」に現在日時を設定する。 ステータスが「承認」になればボタンは再び非表示とする。 押下すると、エラーがなければ「承認しました」とポップアップを表示する。ポップアップには閉じるボタンを配置し、押下すると閉じる。 この時点で各請求書PDFが署名済みかを確認し 、署名済みであれば 【FIX】請求：請求書PDF の署名フラグを「真」とする。 3.1. 権限 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみ 3.2. 帳票 概要の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704414005 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） ※画面全体ではなく、リンク先の「請求書PDF一覧」の部分のみが本機能に対象です。 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=77650-20995&amp;mode=design&amp;t=oGnH1tWWgBdu6AQq-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション 請求番号 URLパラメータ どの請求に紐づく請求書PDF一覧を表示するかを指定するための番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しない番号が指定された場合はいずれも404エラーを表示する。 不正な値が入力された場合は404エラーを表示する。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 PDF番号 画面 データベースから取得した請求書PDF明細情報1レコードの「請求書PDF番号」をそのまま表示する。 ファイル名 画面 データベースから取得した請求書PDF明細情報1レコードの「ファイル名」を適切にHTMLエスケープして表示する。 PDFファイルが署名済みの場合はテキストリンクとし、押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/717947318 を実行する。 ステータス 画面 データベースから取得した請求書PDF情報1レコードの「ステータス」に保存された値が指し示す選択肢のラベルを出力する。 請求金額（税込） 画面 データベースから取得した請求書PDF情報1レコードの「請求金額（税込）」の値を3桁のコンマ区切りで、文頭に&yen;を付けて出力する。 値がNULLの場合は空白（何も表示しない）とする。 承認日時 画面 データベースから取得した請求書PDF情報1レコードの「承認日時」をYYYY/MM/DD hh:mm:ssの形式で表示する。 発行通知日時 画面 データベースから取得した請求書PDF情報1レコードの「発行通知日時」をYYYY/MM/DD hh:mm:ssの形式で表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が100を超えていた場合、以降は総件数を100件として処理を続行する。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の請求書PDFデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき請求書PDF明細情報100件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read invoice pdf file list . invoice_number={請求番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} PDFを承認した場合に下記フォーマットでログを出力する。 成功した時 User {全体管理者のユーザー番号} approved invoice pdf file . invoice_pdf_file_number={請求PDF番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した時 User {全体管理者のユーザー番号} failed to approve invoice pdf file . invoice_pdf_file_number={請求PDF番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "718635198",
  "parentTitle": "300_■請求書PDF管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/880607390/301_+FIX+PDF",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-23T08:31:44.133Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能はある1つの 【修正中】請求：基本情報 に紐づく 【FIX】請求：請求書PDF データの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには次の項目を表示..."
}