{
  "id": "885260833",
  "title": "596_【FIX】応募・採用管理 - 一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧・編集するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 左メニューおよび画面上のボタンでの遷移時に、指定した対象サイトに絞った内容のみ表示し、画面の背景色は対象サイトごとに異なる色にする。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 なおクライアント管理画面のサイドメニューのうち、応募管理「応募・採用確認管理」のタブから遷移したときは全ての応募を一覧で表示し、採用確認のメニュータブから遷移したときは「採用確認状況」が未完了「当月期限超過かつ採用確認未完了」の条件で絞込んだのものだけ絞り込んで表示する。 なおクライアント管理画面のサイドメニューのうち 、「応募・採用確認管理」のタブから遷移したときは全ての応募を一覧で表示し、 採用確認状況が未完了のものがあれば、その件数 提出ステータスが「未提出」、提出期限が「今月末」の件数 を含めて検索コンポーネントの下に「採用確認が未提出のものが N 件あります。 こちらをクリックして対応をお願いします。」と表示する。 「こちらをクリック」を押下すると、 採用確認状況が「未完了」「指定なし」、 提出ステータスが「未提出」、提出期限が「今月末」 で絞り込まれた一覧を表示する。 一覧フィルター用コンポーネントの表示項目は全てAND結合とし、「 絞り込み 検索 」ボタンを表示するまでフィルター項目の変更は適用されないものとする。表示項目はWFを基本参照し、追加で説明が必要なものだけドキュメントに記載する。 応募番号 コンマ区切りで、複数検索できるようにする。 教室プラン 選択肢は 【FIX】商品マスタ（統合版） の「付与プラン」のそれとする 提出ステータス 選択肢は以下 すべて 未提出 提出中 差戻し 完了 在籍確認 選択肢は以下 ○ &times;： すでに退職済み 1か月以内退職 提出期限 選択肢は以下 今月末 絞り込みの条件は、以下のいずれかの条件を満たすものを対象とする。 絞り込みを実行した月の月末 の が 提出期限の応募 で、提出ステータスが『未提出』の応募 。 提出期限が過ぎて（「期限超過」） おり、かつ提出ステータスが「未提出」の いる応募。 期限超過 提出期限が過ぎて（「期限超過」） おり、かつ提出ステータスが「未提出」の いる応募。 オファー応募 選択肢は以下 指定なし パーソナル 自動 パーソナル＆自動 採用確認状況 選択肢は以下 すべて 完了 不一致がない かつ 採用ステータスが未登録、保留、 採用以外 である または採用ステータスが採用で、在籍確認も完了している 未完了 完了以外の条件は全て未完了とする。 不一致のみ 採用ステータス（企業）が採用ではないのに採用お祝い申請1stが送られているもののみフィルターする 検索ボタンを押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、「該当する応募が見つかりませんでした」と表示する。 CSVダウンロードボタンを押下することで、絞り込んだ内容で https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/1019281488 を実行する。検索結果が1件もなかった場合はダウンロードは実行されず「データがありません」とポップアップを表示する。ポップアップには閉じるボタンを配置し、押下すると閉じる。 応募一覧は作成日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには以下の項目を出力する。 表示項目はWFを基本参照し、追加で説明が必要なものだけドキュメントに記載する。 紐づく対象サイトが「ステーション」のレコードは該当行を薄いオレンジに、「キャリア」のレコードは該当行を薄い青色とする。 「採用確認状況」が完了のものを表示するときも、そのレコードは背景色を灰色で表示する。 応募番号 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705396737 へ遷移する。 また不一致が発生している場合は 緑色の ⚠️アイコンを表示する。アイコンにホバーすると不一致の旨を伝えるツールチップが表示され、その中のリンクをクリックすると不一致確認モーダルを開く。 提出ステータスが「提出中」の場合はロックマークを表示する。 提出条件を満たしている状態で保存して提出するボタンを押した場合のみロックマークを表示する。 提出ステータスが「差し戻し」の場合は赤丸ドッキリマークを表示する。 雇用形態/指導形態 指導形態が複数ある場合は「、」区切りで全て表示する。 オファー応募 オファー（パーソナル/自動）経由者の場合は、「パーソナル」「自動」「パーソナル＆自動」のいずれかを表示する。オファー経由の応募では無い場合は「空白」とする。 表示条件は以下 企業が会員に対してオファーを送信した場合、 会員がマイページ内より該当のオファーを閲覧し、 そのオファーを確認したかどうかに関わらず 、該当企業の教室の求人に対して、経路問わずに応募があった際に応募をカウントする。 ただし、オファー送信後3ヶ月以内の応募に限る ただし応募時点から3ヶ月以内にオファーが送信された応募に限る 提出期限 期限前の場合は期限までの日数を表示をする。 超過しており、かつ提出ステータスが「未提出」の場合は「期限超過」を表示する。 それ以外の場合は提出期限の日付を表示する。 応募に対して 採用ステータスを登録 していない場合 応募日 の を起点とした 翌月末までの日数を表示する。 それを超過している場合、赤文字で「期限超過」と表示する。 採用後の在籍確認をしていない場合 契約している 採用課金 が1ヶ月の場合は研修初日の翌月末が提出期限なので、そこまでの日数を表示する。 契約している採用課金が3ヶ月の場合は研修初日の3ヶ月後の末日が提出期限なので、そこまでの日数を表示する。 以下の定義のいずれかの期限を超過した場合、かつ提出ステータスが「未提出」の場合、赤文字で「期限超過」と表示する。 採用ステータス「採用」、研修初日「未定」もしくは採用ステータス「保留」で提出した場合は、提出した月の翌月末が提出期限になる。 上記のステータスで提出すると、翌月に提出ステータスが「未提出」に変わる。 採用ステータス「採用」、研修初日「当月」で提出した場合、提出した月の翌月末が提出期限になる。 採用ステータス「採用」、研修初日「当月以降」で提出した場合、入力した研修初日の「日付」の翌月末が提出期限になる。 それぞれ超過している場合、赤文字で「期限超過」と表示する。 選考状況 ステーションの表示画面の場合レコードはカラム名およびレコード上の入力・表示欄に何も表示しない（空白）とする。 「契約社員」「正社員」求人に対する応募レコードのみ、入力欄を表示し入力・表示可能とする。 保存されている値が無い（NULL）状態は「未登録」という名称として表示され、選択できる。 「採用ステータス（クライアント企業）」で「 採用、不合格、連絡取れず、辞退、欠席、 保留」が選択された場合は入力を必須とする。 このとき、入力されていない状態の場合は「選考状況を選択してください」というメッセージを表示する。 操作時点での提出ステータスに関わらず、選考状況だけ編集して提出しても「提出ステータス」は変更しない。 提出ステータスが「完了」または確認完了が「完了」の場合、編集できない。 採用ステータス 提出ステータスが「未提出」の場合のみ 入力可能な項目である。 【FIX】応募情報 の「採用ステータス（企業）」の選択肢から選択できる。 ただし、「対象外」は除く。 「対象外」が選択された場合は、提出ステータスは「完了」となる。 「採用」で提出後は、採用ステータスを変更することは出来ない。 研修初日 デフォルトでは非活性となっており、 提出ステータスが未提出 、採用ステータスが「採用」 の場合のみ入力可能な項目である。 ただし提出ステータスが「提出中」であっても、採用ステータスが「採用」でかつ研修初日が未定ならば、提出期限と同じ月のうちに限り入力可能 入力可能時に空白の場合は、「未定」と表示する。 ただし、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/744718525 の応募データ更新処理10、12実行後、採用ステータスが「採用」でも、研修初日の「未定」テキストを非表示にする。 デフォルトでは非活性となっており、採用ステータスが「採用」の場合に限り活性になる。 デートピッカーとする。 入力されると、入力された日付から一定期間後の日付を 【FIX】応募情報 の「提出期限」に登録する。 採用課金の期間が1ヶ月の場合は、入力された日付の1ヶ月後の末日 採用課金の期間が3ヶ月の場合は、入力された日付の3ヶ月後の末日 在籍確認 提出ステータスが「未提出」の場合のみ入力可能な項目である。 デフォルトでは非活性となっており、採用ステータスが「採用」の場合に限り活性になる。 デフォルトでは任意項目とし、 「採用課金：確定時期」 課金形態 が1ヶ月の場合は研修初日から1ヶ月後の 同日 該当月以降 、3ヶ月の場合は3ヶ月後の 同日 該当月以降には必須とする。 選択肢の制限は以下とする。 「○」は以下の条件をともに満たす場合は選択できない。 採用ステータスが「採用」 研修初日が「未定」または研修初日が 在籍確認月 でない 在籍確認月とは 、研修初日の翌月以降のことである（ CTJ-3948 0f376871-0459-35fc-b139-2a34c915ec22 System Jira より、当面は課金形態に関わらず翌月と固定する） 「&times;： すでに退職済み 1ヶ月以内退職 」は、提出ステータスが「提出中」の場合でも以下の条件なら選択できる 採用ステータスが「採用」かつ研修初日が「当月以降」 メモ テキストエリア とする。 その時点での提出ステータスに関わらず、メモだけ編集して提出しても「提出ステータス」を「提出中」に更新しない。 提出ステータスが「完了」または確認完了が「完了」の場合、メモは編集できない。 面接日設定アイコンボタン 押下すると 面接日設定モーダル を開く。 メッセージアイコンボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429505 へ遷移する。 お問い合わせアイコンボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703824101 へ遷移する。 面接日時設定 モーダルには次の項目を表示する。 日時設定のデートタイムピッカー 現時点より後の日時を選択しないとエラーとする。 面接日時補足のテキストボックス 面接日時を設定するボタン 押下すると、入力内容にエラーがあれば更新はせずにエラーの内容を表示する。エラーがなければその内容で更新する。更新が完了したら面接日設定モーダルを閉じて「更新に成功しました。」という更新成功ポップアップを表示する。閉じるボタンを押下するとポップアップを閉じる。 キャンセルボタン 押下するとモーダルを閉じる。 各レコードの採用ステータスを 「応募重複」 に変更すると、それを証明する資料の提出が必要になる旨のポップアップを表示する。ポップアップの文言は以下とする。閉じるボタンを設置し、押下するとポップアップを閉じる。 応募重複選択時はそれを証明する資料の提出が必要になります。 （資料の例） ・他媒体からの応募日時が確認出来る「応募通知メールの画面コピー」「他Web求人媒体 応募管理画面のコピー」 ・応募者の電話番号、もしくは日時が確認できる通話履歴 ・メールのやりとり ・「応募エントリー日」「面接予定日」が記入された書面（面接時利用の面談シート等） ※弊社に開示いただけない箇所は塗りつぶしていただいて構いません。 不一致対応 モーダル 採用ステータスの選択肢は「採用」「不採用」「採用したが すでに 退職」 の3つ である。 「採用」の場合のみ 、 研修初日 のデートインプットを表示する。 「採用」を押下し研修初日のデートインプットで日付を入力し、更新ボタンを押下すると、採用ステータス（企業）と研修初日をそれぞれ更新する。 「不採用」を選ぶと、不採用の詳細セレクトボックスと理由記入欄を表示する。 不採用の詳細の選択肢は「不合格」「連絡取れず」「辞退」「欠席」「応募重複」とする。 全て入力した上で更新ボタンを押下すると、不採用の詳細を採用ステータス（企業）に、 研修初日 はそのまま更新する。また入力された理由は下の 定型文 に含めてメモ欄に入力する。 「不採用」で更新した場合、 【FIX】応募情報 の研修初日にNullを入れる 「採用したがすでに退職」 を選ぶと、最終出勤日と退職手続日のデートインプット、理由記入欄を表示する。 全て入力した上で更新ボタンを押下すると、研修初日を更新する。また入力された、最終出勤日、退職手続日、理由は下の 定型文 に含めてメモ欄に入力する。 定型文は以下とする 採用お祝い不一致確認 ＄YYYY/MM/DD hh:mm:ss＄ 不採用の詳細：＄選択された理由を出力（「採用したがすでに退職」の場合は非表示）＄ 最終出勤日：＄選択された日付を出力＄ 退職手続日： ＄選択された日付を出力＄ ＄理由を出力＄ ※こちらの履歴は消去されないようご注意ください。 一覧下部の 「保存し提出する」ボタン を押下すると「この内容で採用情報を更新しますか？」とのテキストを含む確認モーダルが表示される。「更新する」を押下すると、入力内容にエラーがあれば更新はせずにモーダルを閉じ入力画面でエラーの内容を表示する。エラーがなければ入力された内容で 更新される 。また 【FIX】応募情報 の 「提出ステータス」を「提出中」 に更新する。 提出内容によって提出期限を以下の通り更新する。 採用ステータス「採用」、研修初日「未定」or採用ステータス「保留」で提出した場合、提出した月の翌月末に更新する。 なお上記のステータスで提出すると、翌月に提出ステータスが「未提出」に変わる。 採用ステータス「採用」、研修初日「当月」で提出した場合、提出した月の翌月末に更新する。 採用ステータス「採用」、研修初日「当月以降」で提出した場合、入力した研修初日の「日付」の翌月末に更新する。 キャンセルを押下するとモーダルを閉じる。 更新に成功すると、確認モーダルを閉じた上で、「更新に成功しました。」という更新成功ポップアップを表示する。閉じるボタンを押下するとポップアップを閉じる。 在籍確認が○であれば、そのレコードについては 【FIX】応募情報 の「 請求確定 日」に処理日を入れ、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/906690562#2.2.-%E5%9C%A8%E7%B1%8D%E7%A2%BA%E8%AA%8D%E5%A4%89%E6%9B%B4%E3%81%AB%E3%82%88%E3%82%8B%E8%AB%8B%E6%B1%82%E3%81%B8%E3%81%AE%E5%8F%8D%E6%98%A0%E5%87%A6%E7%90%86 を行う。 3.1. 権限 要求事項の記述に同じ。 3.2. 帳票 概要の記述に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705036289 の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） 一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=80153-50801&amp;mode=design&amp;t=xlwkBlhDhrI8zNP4-0 不一致確認モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=110811-37021&amp;mode=design&amp;t=h75jeqV1sGRwMOR8-4 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {企業管理者のユーザー番号} read application list. company_number={企業番号} page={ページ番号} application_number={応募番号} application_name={氏名} email_address={メールアドレスを 匿名化して出力 } classroom_number={教室番号} classroom_prefectures={教室の都道府県} classroom_group_name={教室グループ名} job_type={雇用形態} submission_status={提出ステータス} hiring_status={採用ステータス} working_confirmation={在籍確認} submission_due={提出期限} classroom_plan={教室プラン} hiring_confirmation={採用確認状況} mismatch={不一致のみ} application_created_date={応募日} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 編集処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {クライアント管理者のユーザー番号} updated applications. company_number={企業番号} application_number={更新した応募の応募番号} hiring_status_change={[応募番号, 変更前の値, 変更後の値][]} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {全体管理者のユーザー番号} failed to update applications. company_number={企業番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項",
  "parentId": "705036289",
  "parentTitle": "590_■応募管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/885260833/596_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-05-26T08:39:45.102Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧・編集するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 左メニューおよび画面上のボタンでの遷移時に、指定した対象サイトに絞った内容のみ表示し、画面の背景色は対象サイトごとに異なる色にする。 ..."
}