{
  "id": "1013448709",
  "title": "求人検索一覧の残りタスク",
  "content": "※要修正点というのは、要件定義またはデザインの修正・追加をすることが必要 ※要対応点というのは、実装することが必要 011_【作成中】求人一覧閲覧・検索機能 3.2. PC画面検索コンポーネント（サイドバー） 5.検索フィルター用コンポーネントの表示項目は、下の項目とし、すべてAND検索とする。（要修正点） g.特徴から選択 モダールの表示内容はまだ定義されてないですので。WFと現行システムを参考して実装しています。 変更がある場合、仕様変更チケットを作成していただけますと幸いです。 3.3. SP画面検索コンポーネント（ページ上部に追従） 2.ページ下部に検索フィルター用コンポーネントを表示する。ページスクロールに追従する。（要修正点） &rArr;こちらは該当するデザインが見つかりませんでした。実装不要かと認識しています。 3.デフォルトで表示されているのは上の部分のみであり、そのうちの「条件を変更」を押すと初めて下のの2つのボタンが表示され、それぞれを押すとそれぞれに対応した検索モーダルが表示される。（要修正点） ◆指導形態タブと雇用形態タブを統合するデザインはないですしたので。一旦、下記のキャプチャーのようにする。 3.4. 検索モーダル（勤務地・指導形態・給与） 2.検索モーダルには以下の3つのタブを表示する。 a.勤務地を選択 i.路線・駅から探す（要修正点） デザインはないですので、勤務地を参考しました。 それが問題なければ、デザインの作成が不要です。 3.5. 検索モーダル（フリーワード・勤務期間・特徴） 2.PC画面では本モーダルは特徴を選択するモーダルとし、SP画面ではフリーワード検索・勤務期間・特徴を選択できるモーダルとする。 デザインをいただきたいと思います。（要修正点） デザインができたら、仕様変更のチケットを作成していただけますと幸いです。 デザインがいただいたら、対応する予定です。（要対応点） 3.7. 求人カード・教室グループカード一覧 1. 一覧の求人情報カードは以下の条件で並べる。 a.検索条件に合致する急募求人を1件ランダムで抽出し、最も上に表示する。 急募に関する機能はまだ実装してないですので。それを実装した後に対応する予定です。（要対応点） ※仕様変更のチケットは不要 2.各求人情報カードには次の項目を表示する。なお051_【FIX】最近見た求人一覧閲覧機能の求人カー a.急募かどうか、新着かどうか 新着タグのデザインをいただきたいと思います。現状は急募タグと同じデザインを使用している。（要修正点） デザインができたら、仕様変更のチケットを作成していただけますと幸いです。 デザインがいただいたら、対応する予定です。（要対応点） e.特徴 ii.SP画面では待遇とタイトルをつけ、デフォルトは閉じたアコーディオンとする。閉じた状態では2つだけ特徴を表示し、アコーディオンを開くと全ての特徴を表示する。（要修正点？） デザインは上記の定義と比べると、異なっている デザインは&darr;&darr;&darr;&darr;&darr;&darr;&darr; デフォルトは5つ表示 実装しているのは&darr;&darr;&darr;&darr;&darr;&darr;&darr; デフォルトは2つ表示 e.口コミ 「もっと見る」をデザインに追加して、仕様変更チケットを作成していただけますと幸いです。 3.8. 求人カード一覧の下のサブコンテンツ 1.社員やプロ講師などの求人をお探しのたかはこちら ステーションサイトの場合、「社員やプロ講師などの求人をお探しのたかはこちら」のバナーを表示する。 バナーを押下すると、キャリアトップに遷移する キャリアサイトの場合、「塾講師バイトなどをお探しの大学生はこちら」を表示する （要修正点） バナーを押下すると、全体トップに遷移する 2.［地域］の塾講師正社員求人はこちら 「表示の出しわけ条件は出しわけシートを参照し」を追記していただきます。（要修正点） ※仕様変更のチケットは不要 6. 塾の仕事内容 ｂ.表示する内容は以下である。（要修正点） このコメント に記載している内容の通りに実装している [/company/XXXX]というURLのみに表示する。(出しわけシートの通り、/classrooms/XXXで表示する) 問題なければ、要件定義に反映していただけますと幸いです。 10.都道府県から塾講師バイトを探す 03月27日の コメント の内容はまだ対応してないですので。こちらは仕様変更のチケットを作成していただけますと幸いです。 II. その他 1.出しわけシート ・要件定義に基づいてURLを修正する ・「エリアの特徴」と「エリアの塾講師求人の特徴」は路線で表示することはなく、下記の各駅のURLで表示する。 都道府県 駅名 北海道 あいの里教育大 北海道 あいの里公園 北海道 さっぽろ 北海道 サッポロビール庭園 北海道 すすきの 北海道 トマム 北海道 ニセコ 北海道 バスセンター前 北海道 ひばりが丘 北海道 ほしみ 北海道 ラベンダー畑 北海道 ロープウェイ入口 北海道 愛し野 北海道 愛山 北海道 愛別 北海道 旭川 北海道 旭川空港 北海道 旭川四条 北海道 芦別",
  "parentId": "1261043793",
  "parentTitle": "メモ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1013448709",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-13T08:48:43.069Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "※要修正点というのは、要件定義またはデザインの修正・追加をすることが必要 ※要対応点というのは、実装することが必要 011_【作成中】求人一覧閲覧・検索機能 3.2. PC画面検索コンポーネント（サイドバー） 5.検索フィルター用コンポーネントの表示項目は、下の項目とし、すべてAND検索とする。（要修正点） g.特徴から選択 モダールの表示内容はまだ定義されてないですので。WFと現行システムを参考..."
}