{
  "id": "1159200769",
  "title": "2024-8-22 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) 片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 GIG 小竹 全体 先週残っていた本番反映待ちのチケットと学歴情報アップロードが完了いたしました 新しい運用フローを開始しました（8/21から） 本日の本番反映枠（12:00-15:00）で本番反映するチケット CTJ-4160 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4134 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4141 0f376871-0459-35fc-b139-2a34c915ec22 System Jira &rarr;本日会議完了後に開始でOK GIG 小竹 こちら の件について説明させていただきます。 別途、こちらは小竹さんだけというよりは、 御社のPMとのやり取りの中で感じた課題感についてお伝えさせていただきます。 まず、今回の改修案件の意図について、ご理解されていますでしょうか？同じ用途のメールなのに、文面が違うこと／付与パラメーターに差異があるということが問題で、揃えたいというのが今回の改修意図になっております。そこから考えると、それぞれのメールが違う状態になっているということに違和感を持つものではないでしょうか。大塚さんとのやり取りの中でも感じてはおりましたが、案件の目的についてご理解されてないのか、 案件の解像度が浅く、抜け漏れがあった時に気づくことができないような場面がありました。またはコミュニケーションコストが増加しております。前提として、要件定義時点で抜けれもなく定義することやそのための工夫をすることは重要だと承知しておりますが、 どれだけ工夫してもヒューマンエラーなどはあると思います。上記を踏まえると、御社が仲介してディレクションする価値とは、そのような部分ではないでしょうか。 テキスト通りのものを開発会社に渡すだけなら、仲介する必要はないと私は考えております。リニューアル時はバタバタしており、お伝えするのを後回しにしておりましたが、 今後も続くと困るので、お伝えさせていただきました。 よろしくお願いいたします。 こちらのご指摘の通り、弊社として至らぬ点が多く、大変ご迷惑をおかけし誠に申し訳ございません。 ご指摘いただいた点につきましては、おっしゃる通りかと思います。まず弊社として改善のご依頼をいただいた時点で、 サービス視点で他に付随して影響する箇所がないか、修正方針として問題ないか等、 気付いた上で正しい改善を行えるようにすることが必要であり、弊社の落ち度であったと考えております。修正・改善を行う意図につきましても、 理解し認識を合わせた上で進めることがマストと考えており、 こちらに関しても至らぬ点があったと感じております。今後はこのようなことが発生しないよう、 弊社内でのフローの再検討を含め対策を検討、実施いたします。改めて、この度はご迷惑をおかけし申し訳ございません。 現状：チケット起票-&gt;（見積もり）-&gt;実装依頼-&gt;定義の更新や不明点があれば先方と擦り合わせる-&gt;実装 問題点 チケット起票内容から背景や意図を汲み取った上で、実装方針や定義の更新箇所の認識合わせができていなかった チケット内での追加要望に対して認識齟齬があり、対応漏れが発生してしまった（チケットの範囲でのバイアス） 今後：チケット起票-&gt; 目的のすり合わせ -&gt; 内容の擦り合わせ -&gt; 改善内容の提案 -&gt;（見積もり）-&gt;定義の更新-&gt; 更新箇所の先方確認 OK-&gt;実装対応 そのほか 【GIG記入】 以下の2チケットについては過去の本番反映に巻き込まれてしまい、本番反映されていました。管理が行き届かなく大変申し訳ありません。 CTJ-3184 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-3622 0f376871-0459-35fc-b139-2a34c915ec22 System Jira インフラのRI / スペックダウンについて現在整理しておりますので、週明け26日（月）迄にまとめたものを情報展開させていただきます。 【トモノカイ記入】 先週～月曜にかけて、コンフリクト対応ありがとうございました。改めて、8月の対象案件ですが、請求／契約更新／採用確認周りの現在進んでいてる案件を中心に対応をお願いしても良いでしょうか。だいぶスケジュールよりも遅れており、かつ8月中に対応を終えたいものになります。 【GIG記入】 工数管理表にてタイトルの背景色を青色にしているものが該当するチケットだと認識しています。 &rarr;トモノカイ様：対象に漏れ・誤りがないか本日確認する。 まず以下のチケットの解決を行います（理由：このチケットの解決により解決されるであろうチケットが複数あるため） CTJ-4275 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 1 のチケット付随しているチケットを確認/対応します 上から順に青色のタイトルのチケットから対応してまいります &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1159200769/2024-8-22",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-08-22T03:14:40.069Z",
  "author": "Shogo Ishikura",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) 片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 GIG 小竹 全体 先週残っていた本番反映待ちのチケットと学歴情報アップロードが完了いたしました 新しい運用フローを開始しました（8/21から） 本日の本番反映枠（12:00-15:00）で本番反映するチケ..."
}