{
  "id": "1159168061",
  "title": "2024-8-16 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) 片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗状況 GIG 小竹 本番反映について 予定通り実施できず大変申し訳ありません 本日以下のチケットについて本番反映する予定ですが、現在もコンフリクトの解決に向けた対応中です（進展はしていますが、目処は立っていない状況です） 本番反映OKチケット 構造化データマークアップの適用（ CTJ-4006 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） オファー送信対象者の抽出に「オファーメールを通知する：ON」のフラグが入ってしまっている（ CTJ-4149 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） T-newsの再開（ファイル置き先の修正） dev環境へのコンフリクトの解決対応中のチケット 応募兼会員登録画面-会員登録通知メール：メール本文文面の調整（ CTJ-2635 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） コンフリクト起こっているチケットがSTGに反映後に、STGに反映するチケット（学歴情報のアップロード） 優先的にあげたい CTJ-4159 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 共有事項 GIG 小竹 新しいフローの説明（今回の本番反映が解決した後のお話です） https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/1169883169 トモノカイ様が検証する環境がDEV環境（開発環境）からを想定 本番反映する頻度が毎週火曜日と木曜日の週2回を想定 チケットは種別ごとに説明欄に記載いただきたい項目をデフォルトで設定いたしました 確認内容 新しいフロー（8/9月）の検討箇所（今回の本番反映が解決した後のお話です） 本番反映の曜日と時間枠（火/木の12:00-15:00枠で実施で問題ないか） STG反映の日は月、水、金で問題ないか ■トモノカイ記載 開発予算と消化ペースの乖離について確認 改めて今月が残り2週間となりましたが、現在の開発予算の消化ペースをみると105人日分の消化が難しいように見えるのですが、御社の見解をお聞きしても良いでしょうか。 また、実際に消化できなかった場合、余剰分の予算についてもお支払いは必須でしょうか。契約上は開発工数を確保して頂くということで、基本的にはお支払いする理解をしておりますが、遅延の大きな原因が弊社起因でないのを考慮すると疑問があるので、ご質問になります。 &rarr;GIG見解まとめ 基本的には契約金額通りの支払いでお願いできればと考えておりますが、全体的に、見積もり時点より、実績として工数が増える見込み（理由は後述）であるため、現状のシートの数値より、工数消化割合は大きくなると考えております。 想定より工数が増える理由 今後の改善フェーズの進行効率化のための運用フロー策定・調整（初期特有） 先月末に立ち上げた開発環境の利用を開始したことによる下記問題 環境ごとの利用用途・ソース反映フローの調整・設定反映（初期特有） トモノカイ様確認をSTGのみとしていたことによる、一部本番反映NG対応の発生（初期特有） 複数の課題を並行して環境へ反映しつつ、一部のみ本番反映するフローによって起こる、ソース間のコンフリクト発生（今後も発生の可能性あり★１） 仕様や改修箇所の認識齟齬による、再修正対応（今後も発生の可能性あり★２） 今後も発生する想定との差分を減らす対策 ★１に対して コンフリクトの発生はゼロにはできないので、見積もりで予め考慮した工数を設定する。 ★２に対して （ご提案いただいた内容踏まえた）チケットの記載内容の見直しで認識相違解消 &rarr;GIG：工数管理シート上で、進行中・済みのものの並びを変更して上に移動する。★ デザインが必要な開発について 開発依頼の中で、デザインが必要なものがあった際に、弊社側でどこまで用意したほうが良いか確認させてください。 アピリッツ社とは、ある程度どのように変更したいかのビジュアルで分かるものを用意はしてましたが、コードまでは用意することはなかったので、そこまで必要なのかどうか確認したいです。 CTJ-4222 0f376871-0459-35fc-b139-2a34c915ec22 System Jira &rarr;GIG：デザインについて、弊社からの作成提案ができておらず申し訳ございません。コードはもちろん不要ですし、デザイン自体も、（契約上はデザイナー確保はしていませんでしたが）リソース確保・調整して対応可能かを確認して進め方提案させていただきます。 CTJ-4275 0f376871-0459-35fc-b139-2a34c915ec22 System Jira の件 &rarr;トモノカイ様：営業時間外の１時間などであれば、予め決めて一時的に管理者を全削除するというやり方でもOK。 &rarr;GIG：その選択肢も含めて検討する。 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1159168061/2024-8-16",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-08-16T04:01:59.370Z",
  "author": "ejiri_yusuke",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( ) 片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗状況 GIG 小竹 本番反映について 予定通り実施できず大変申し訳ありません 本日以下のチケットについて本番反映する予定ですが、現在もコンフリクトの解決に向けた対応中です（進展はしていますが、目処は立っていない状..."
}