{
  "id": "1198424065",
  "title": "2024- 9-11 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 全体：検証に時間を要するや再実装をしているチケットが多い状況 現在dev/stg環境に上がっているチケットの状況について 実装中 CTJ-4259 0f376871-0459-35fc-b139-2a34c915ec22 System Jira dev環境で追加要望をいただき再実装中 dev環境反映済み CTJ-4121 0f376871-0459-35fc-b139-2a34c915ec22 System Jira GIG検証中 CTJ-4258 0f376871-0459-35fc-b139-2a34c915ec22 System Jira dev環境でのトモノカイ様確認OK ※stg反映のタイミングは、4259のチケットと合わせて対応 stg環境反映済み CTJ-4002 0f376871-0459-35fc-b139-2a34c915ec22 System Jira GIG検証中（応募データの操作必要なチケット） 本番反映済みだがGIGで検証中 CTJ-4076 0f376871-0459-35fc-b139-2a34c915ec22 System Jira GIG検証完了し問題なかったためクローズいたしました ※下記トモノカイ様記載の質問のチケット 2024/09/12の本番反映について 現時点でstg環境でトモノカイ様確認OKのチケットがないため見送りとさせていただきたいです。 そのほか 工数管理表の完了予定日の定義について（GIG小竹） 元々は、GIG側のdev環境での検証が終わる日付と定義していたが、その後再実装やstg環境での検証待ちなども考慮して完了予定日を更新していました それにより完了予定日の定義が曖昧になっていました 今後：再度、完了予定日（新：検証可能日）の定義を「開発環境でトモノカイ様が検証可能な予定日」として運用いたします トモノカイ様には検証可能日を開発環境で検証開始できる目安として捉えていただけると幸いです。 キューワーカーの再起動により大量のメール送信された件の調査結果について（GIG小竹） 事象：9/5の12時54分頃にdev環境/stg環境でメール送信機能のキューワーカーを再起動させたため、それまで溜まっていたメール送信系の機能のキュー（メール）が大量に送信されてしまった いつからキューワーカーが停止していたか：2024-07-23 15:45:00 なぜキューワーカーが停止していたか：OS再起動によるプロセス停止が発生し、開発環境およびSTG環境で自動起動が無効となっていた。（本番環境は有効化済み） 対策： 開発環境およびSTG環境において自動起動を有効にし、再起動が発生した場合でもプロセスが自動起動するように設定を行いました。 本番環境で起こることはあるのか？-&gt;本番環境では発生しない認識 もし発生した場合は？-&gt;プロセス単位での監視も可能なのでその辺りを再度確認する 懸念点：採用不一致 t-newsバッチ処理の停止の原因について（GIG小竹） 原因；前回と同様に契約データの重複 対応：重複データの削除まで完了し、バッチを正常に動いています 請求書発行の通知バッチについて（GIG小竹） 本番反映完了し、本日テスト可能です 開発案件の計上月について確認。（トモノカイ池田） 現在、工数管理表のD列を「対象月」として設定しておりますが、こちらの「対象月」は開発物の計上月として認識して良いでしょうか。 8月の予算で消化した案件について社内で報告する必要があり、計上についてお聞きしたいです。 対象月の定義は、月末時点（8月末時点）でU列が「対応済み」または「修正中」のチケットになります。そのため、8月のチケットの中には、まだ対応完了（リリース完了）されていないものも含まれます。（GIG小竹） &rarr;トモノカイ様にて完了日列（完了を）を追加いただく 10-11月の予算について（トモノカイ池田） 前回のMTGでお話した予算追加について、会社の承認下りましたので、10-11月についても、500万円／月でご依頼しても良いでしょうか。 工数管理表の35行目に記載されている CTJ-4076 0f376871-0459-35fc-b139-2a34c915ec22 System Jira こちらの案件について質問です。（トモノカイ池田） こちらの案件対応中になっておりますが、教室プランのバッチは正常動作している認識なので、何か対応が残っているようでしたら、改めて聞いてもよいでしょうか。 トモノカイ様には検証いただく必要はありませんが、GIGで検証中です（GIG小竹） CTJ-4283 0f376871-0459-35fc-b139-2a34c915ec22 System Jira の認識合わせ（GIG江尻） &rarr;過去は、前ベンダーアピリッツ社において毎年バッチで出していただいていたが、今回は一旦バッチ作らず、CSVダウンロード機能を使う形で良いので、対応不要で良い。 旧STG環境を利用させていだきたく、環境の起動など準備をお願いします。フェーズ５に向けた情報局機能の確認のため。（G IG江尻） &nbsp;アクション事項 15 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1198424065/2024-+9-11",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-09-12T00:47:06.925Z",
  "author": "ejiri_yusuke",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 全体：検証に時間を要するや再実装をしているチケットが多い状況 現在dev/stg環境に上がっているチケットの状況について 実装中 CTJ-4259 0f376871-0459-35fc-b139-2a34c..."
}