{
  "id": "1198424085",
  "title": "2024-9-25 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 小竹 全体：現時点での工数管理表の上から順に対応中 現在dev環境に上がっているチケットの状況について 工数管理表にてタイトルが緑色に変わっているものがdev環境に上がっています。 GIG確認が終わったものは順次お渡しいたします 2024/09/26の本番反映について CTJ-4347 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4260 0f376871-0459-35fc-b139-2a34c915ec22 System Jira そのほか 小竹/トモノカイ様 CTJ-4386 0f376871-0459-35fc-b139-2a34c915ec22 System Jira こちら確認（GIG小竹） CTJ-4121 0f376871-0459-35fc-b139-2a34c915ec22 System Jira こちらの案件は次月に跨ぐものなので、今月で実装完了しておきたいです。（トモノカイ池田） dev環境実装ステータスですが、弊社検証可能はいつになりうそうでしょうか。次月跨ぐと本番環境検証が11月頭になるので、避けたいです。 最低賃金対応周りの進捗について共有をお願いしても良いでしょうか。（トモノカイ池田） CTJ-4282 0f376871-0459-35fc-b139-2a34c915ec22 System Jira （GIG江尻） company_billing_accountsの一部データを削除依頼させて頂くことは可能でしょうか。請求先IDが違う企業についているものがあったのですが、有効な契約があるため管理画面から削除ができませんでした。PDF発行に関連するので、今週中にご対応頂きたいのですが。。（トモノカイ片岡） 操作は可能だが開発チームと確認後にトモノカイ様に連絡（GIG小竹） 今週中に対応目処をお伝えする CTJ-4329 0f376871-0459-35fc-b139-2a34c915ec22 System Jira こちらの案件優先順位を上げさせていただきました。 弊社の仮説としては、抽出条件がログインから１年以内になっているのではないか？というものがあるので、まずは現在のパーソナル／自動オファーの配信対象者の抽出ロジックを確認いただけますでしょうか。（トモノカイ池田） 現状の仕様を調査する（GIG小竹） 5年 or 1年なのか（ロジックの確認） 移行前のデータにログイン日時に入っていない可能性がある（データの確認） なぜ配信されていないか調査 インフラ周りの状況に関しまして（GIG石倉） 現在の構成では特に問題は発生しておりません。 ライターインスタンス、リーダーインスタンスともに平均30%ほどの利用率となっている。（ライターについては定期的に70%ほどのピークが発生している） 上記から現在のスペックのまま「1AZにライターインスタンス、1AZにリーダーインスタンスを持ったAuroraクラスタ構成 」にすることがよいと考えています。 「ライターインスタンスのみdb.r5.largeにする」案についてはピークに耐えられない可能性がある。（ピークの原因はまだ分かってはいない状況です） 2日に1回に発生している模様 オファーの配信履歴の影響？ メール配信の影響？ 上記の認識で問題ない場合、以下のスケジュールで進めるのはいかがでしょうか。 [XX/XX] DBインスタンスを2台構成に変更 （直近で変更可能です） 〜1週間 or 2週間 [XX/XX] リザーブドインスタンスの購入 フェーズ5について 先週いただいた要望について認識合わせしたい点があります。（GIG小竹） プレビュー機能についての検討事項 保存前か保存後にプレビューなのか verごとに見られるようにできるようにするか 現状：現在公開されているものが確認できる 改修後：現状に合わす サイトマップxmlについての認識合わせ 今回必要かどうか 必要な場合はサイトマップ作成のバッチ処理の改修または新規で作成する https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/744423704 必要 差分比較の機能の要望すり合わせ 本文の箇所のみで認識間違いないか 他にあるとした場合はパンくずの履歴を残してパンくずの差分も確認するなど トモノカイ様確認いただく 旧STGではピックアップ記事管理があったと思いますがフェーズ5では必要か不要か 必要な場合は記事管理機能の中で実装予定です トモノカイ様に確認いただく WebPについて 新規のものは問題なし WebPの自動変換の対応で既存から記事移行してきた画像も含めて対応する場合は工数（実装/テスト）が現状よりも多くかかります 他の機能の工数と調整して進めます 見積もりを出してトモノカイ様にお送りする（GIG小竹） 確認はトモノカイ様で実装と主要記事のリンクの差し替えを入れて見積もり &nbsp;アクション事項 15 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1198424085/2024-9-25",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-09-25T06:42:55.746Z",
  "author": "Shogo Ishikura",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 小竹 全体：現時点での工数管理表の上から順に対応中 現在dev環境に上がっているチケットの状況について 工数管理表にてタイトルが緑色に変わっているものがdev環境に上がっています。 GIG確認が終わったもの..."
}