{
  "id": "1198358529",
  "title": "2024-9-4 ミーティング議事録",
  "content": "（トモノカイ鈴木） &nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 GIG 小竹 全体：工数管理表記載の完了予定日より遅れが生じている 原因：再実装や検証に時間が必要なものがあるため 個別 臨時の本番反映があったが予定通り反映完了 火曜日の本番反映自体も予定通り反映完了 9月の見積もり作業も工数管理表の上から順に進行中 来週月曜日にはスペックダウン作業があります そのほか 以前対応していただいたindex.phpというページへまだアクセスできるようでして、Google広告のLPとして読み込まれてしまっております。（トモノカイ池田） 2024-8-14 ミーティング議事録 改めて、前回対応いただいた内容を確認してもよいでしょうか。 Googleのボットが読み込んでしまっているようなので、完全にアクセスできないようにして欲しいです。確認できたページだけですが、下記です。 area brand job feature search &rarr;対応完了（ https://gig-inc.slack.com/archives/C04E48QPVC0/p1725335696497689 ） 弊社窓口（PM）の変更（トモノカイ池田） リニューアルからスピード重視の意思決定体制を取っておりましたが、運用体制も少し落ち着いてきたので、弊社の窓口を池田&rarr;鈴木に変更いたします。 これまで通り、個別の案件については、池田、片岡も対応していきますが、下記について鈴木がメインで担当します。確認や質問などは、まず鈴木メンションでご連絡いただくようお願いいたします。 開発全体の進捗管理 週次定例でのアジェンダ準備と進行 各リリース曜日（火木）の案件の確認と調整 フェーズ5についてご相談。（トモノカイ鈴木） このままいくと年内を越してしまう気がしまして、改めてどのように動かしていくのか、その場合の体制をどうするのか、着手時期はどうするのかを貴社目線でまずご意見を頂けますでしょうか。 -&gt;来週金曜日にGIGから説明★ ペンディングしている機能の再開や改善に影響がでないように進める 明日9/5(木)のリリース案件について（トモノカイ鈴木） 明日リリースに進められる案件の確認と、リストアップをお願いできますでしょうか？(工数管理シートで構いません) &rarr;今後、工数管理シートの行タイトルを、本番反映Readyなものはオレンジ色にして共有する運用にする。 最低賃金更新対応にあたっての進め方についてご相談（トモノカイ鈴木） 最低賃金バリデーションチェックの作りがほぼ意味のない作りになっている事が発覚しまして、こちらの対応を元々依頼していた最低賃金マスタ更新対応に併せて9月実施をしていただく必要が出てきました。差し込みとなり恐縮ですが、お見積りと開発会社とのコミュニケーションをお願いできますでしょうか。 データアップロードについて（トモノカイ片岡） 本日採用確認、急募の依頼を追加してもよろしいでしょうか。採用確認はバッチ不備の修正（提出完了でないものが完了になっているなど）、急募はデータ移行漏れの補填が急務なものがございまして。。 -&gt;対応済み 祝日などあるため急募と契約更新アップを月曜ではなく当日にお願いすることは可能でしょうか。。 ・ 金曜~17時までにデータお渡し、当日中にアップ頂く ・対象：9/6(金)、9/13(金)、9/20(金) -&gt;GIG対応可能（営業時間後の可能性あり） 開発環境でのデータベースアクセス（GIG） 目的：開発環境で検証時に画面から確認できないレコードの参照やデータ取得などが必要になる場面があるため 現状は踏み台サーバがないためそれをどうするか 電子署名サーバを流用して踏み台として接続できるようにする。 設定完了後、アクセス情報を共有する。 参考： インフラ要件 データアップロード「#62 急募アップロード@8/23」について（GIG石倉） 重複されて作成されたレコードを手動で削除いただいたご認識であっておりますでしょうか？ &rarr;トモノカイ様にて状況確認いただく スペックダウンの費用の確認（GIG石倉） Slackにて一次回答済み（ https://gig-inc.slack.com/archives/C04E48QPVC0/p1725422372307569?thread_ts=1724659517.350189&amp;cid=C04E48QPVC0 ） -&gt;削減できる部分についてはできるだけ削減したい &rarr;１〜２週間を目処に、AWS全体で削減できる部分があるかGIGにて確認する。 スペックダウンの作業時間の確認（GIG小竹） 9/9（月）9:00開始 トモノカイ様の立ち合い必要あるかないか？ -&gt;GIGでの作業だけで問題なし 開始後にGIGからトモノカイ様に連絡する &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1198358529/2024-9-4",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-09-04T07:46:38.992Z",
  "author": "kotake_jin",
  "excerpt": "（トモノカイ鈴木） &nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 GIG 小竹 全体：工数管理表記載の完了予定日より遅れが生じている 原因：再実装や検証に時間が必要なものがあるため 個別 臨時の本番反映があったが予定通り反映完了 火曜日の本番反映自体も..."
}