{
  "id": "1198391297",
  "title": "2024-9-9 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 共有 GIG 小竹 基本的に要望や依頼系は、トモノカイ様にチケット化いただき、工数管理表に記載いただけると助かります。 優先度が特にない場合は下に記載いただいて問題ないです。 確認内容 スペックダウンについて（GIG小竹） 問題なく完了いたしました t-newsバッチ処理の停止の原因について（GIG小竹） 停止タイミングから過去に停止した原因と同じく契約データの重複が原因と推測しています。それを踏めて調査/対応中です。 以下チケットのリリースタイミングについて（GIG小竹） 自動オファー：通知メールの文面の変更（ CTJ-4258 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） オファーのメール通知のリンクパラメーターをステーションとキャリアを分ける（ CTJ-4259 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） 上記の2つのチケットは、同時に開発しているため4259の実装が完了し、検証OKのタイミング後に同時に本番反映とさせてください 木曜日に進捗共有 案件の確認について(トモノカイ鈴木) 求人編集：応募条件・研修情報の「研修給与」必須条件をなくしてほしい という案件ですが、一度修正反映&rarr;不備があって差戻しの状態でとまっており、こちらは修正に時間かかりそうでしょうか？ 内部から相談があり、すぐに正しい内容に修正ができそうであれば優先度を上に上げて完了にしてしまいたいと考えております。 先週発生した検証環境の採用確認メールが大量送信された事象に関して(トモノカイ鈴木) 本番環境にて採用確認機能をオープンする際、当然ながらバッチ再開も行う事になりますので、その際に必ず同事象が発生しないようになっていることを確認の上、再開していただく様お願いいたします。 工数管理表の着手順について(トモノカイ鈴木) 改めての確認となりますが、工数管理表に記載した案件を上から捌いていくという内容かと思いますが、下の方にあるものが開発物として動いているのはリソースの関係で動かしているもので認識あっていますでしょうか？ 自動オファー：通知メールの文面の変更 求人一覧閲覧：求人一覧の静的ページのみ上部の検索コンポーネントを変更する &rarr;改修途中のチケットを止めて他を優先したい場合は、チケット上で改修作業中断のご依頼をいただく。 請求明細データの追加と通知バッチの調整依頼（T_片岡） PDF承認が直ったので発行テストとPDF内容の確認、クライアント画面での表示や通知が飛ぶかのテストを本番環境で行いたいです。 ご相談事項 ①8月明細の本番UPを9/10データお渡し9/11UPは可能でしょうか。 こちら可能でございます（GIG石倉） ②発行通知の確認テストもしたいのですが、 ・特定の日だけ本番環境でのPDF発行通知メールを飛ばすようにすることは可能でしょうか。その日に弊社アカウント分でテストする想定です。（※ほかに良い方法があればそちらでも結構です。） こちら可能です（GIG小竹） ③ ②可能な場合はいつがご都合よいでしょうか。希望としては～9/13(金)までのいずこかで実施したいです。 水曜日または木曜日が候補になりそうです（GIG小竹） 最低時給の件 CTJ-4347 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 契約期間の件 CTJ-3622 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 採用６ヶ月後アンケート送信バッチの再開について https://gig-inc.slack.com/archives/C04E48QPVC0/p1725251339194199?thread_ts=1725245562.397619&amp;cid=C04E48QPVC0 お待たせしており申し訳ございません。今週〜来週で対応できればと思いますが、チケット作成いただき、シートの優先順位通りに記載いただければと思います。 10月以降の契約の上限を上げるのが可能か（トモノカイ様池田様） デットライン2月の中旬 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1198391297/2024-9-9",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-09-10T00:27:56.754Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 共有 GIG 小竹 基本的に要望や依頼系は、トモノカイ様にチケット化いただき、工数管理表に記載いただけると助かります。 優先度が特にない場合は下に記載いただいて問題ないです。 確認内容 スペックダウンについて（GIG..."
}