{
  "id": "1234468946",
  "title": "2024-10-04 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 GIG小竹 16 16 complete パーソナルオファーのロジックの調査 19 19 incomplete 原因判明いたしました 17 17 complete 契約データをお渡しする 18 18 complete 契約アップロードの検討 確認内容 パーソナルオファー/自動オファーのロジック調査結果（GIG小竹） 原因：学校種「3:高校」AND「4:中学」のデータ（中学・高校受験経験）がNULLな場合にオファーの検索対象から外れていたため 複数テーブルをjoinしているため学校種のデータがない場合は検索できる検索対象から外れていた 対応：学校種「3:高校」AND「4:中学」のデータ（中学・高校受験経験）がNULLな場合でも、オファーの検索対象に含める 対応目処：本日中に修正予定 火曜日リリース予定 ※学校種のデータがNULLな理由は別途調査いたします 1年前のユーザがほぼNULLなのかどうか スペックダウンについて（GIG石倉） 今回の変更（3台から2台に減らす変更）について 本日を予定していましたが来週月曜日AMでの対応いたします。 この予定で進める ①口コミの仕様を現在どう修正し、改善する想定なのか(旧環境のクエリ等はお渡ししており、弊社からお伝え可能な情報はお伝えしてある認識です) ※現在そもそも原因の詳細がわかっている状態なのか -&gt;現状は、アクセス毎に全レビューを計算して表示しているため、処理が重くなっています。 それを解消するためにバッチ処理を行うように改修 新たなテーブルを追加するのか既存のテーブルかは検討 作成したデータをどのように保存するかは別途トモノカイ様に共有 ②口コミのオープン後に最適なスペックを判断して購入するとなった場合、RI購入ができるのはいつになるのか ※こちらはざっくりではなくRI購入に移行できる確実な想定時期を教えていただきたいです。 -&gt;結論現時点では何月と断定できませんが、11月ごろRI購入可能想定です。 理由は下記になります ①2台構成にする時点でCPU利用率60%台で推移することになる上で、口コミ処理がプラスされることで、大幅に処理が改善できそうではあるがどれくらい負荷がかかるかは断言できない ②総合評価計算処理以外にも負荷の高い処理が存在する可能性がある RI購入を進めるため にやること バッチ処理の要件定義/実装/テストを実施する（10月中） こちらチケット化し進めてまいります その他口コミ関連で起票されているチケットでリリース時に解消必須のチケットの対応完了 まずはトモノカイ様に口コミ関連で起票されているチケットのリストアップをお願いいたします。 その後、工数管理表に優先度を考慮して追加お願いいたします 口コミの改修を待たずに購入は進める 2台への変更（来週月曜日AM） 9:00に作業開始 RIの購入（来週水曜日） &nbsp;アクション事項 15 15 incomplete &nbsp;決定事項 口コミの改修を待たずに購入は進める 2台への変更（来週月曜日AM） 9:00に作業開始 RIの購入（来週水曜日） b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1234468946/2024-10-04",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-10-07T00:28:40.885Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 GIG小竹 16 16 complete パーソナルオファーのロジックの調査 19 19 incomplete 原因判明いたしました 17 17 complete 契約データをお渡し..."
}