{
  "id": "1234501664",
  "title": "2024-10-02 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 GIG小竹 16 16 complete パーソナルオファーの配信対象ロジック調査（CTJ-4329関連） 17 17 complete CTJ-4315 0f376871-0459-35fc-b139-2a34c915ec22 System Jira の採用のみ変更で進める 18 18 incomplete 検証環境のバッチエラー通知の停止 19 19 incomplete 進捗：開発チームにバッチエラー通知停止対応中で本日中に対応完了予定になります（現在、dev反映済、stg反映中） 20 20 complete パーソナルオファーの送られていないサンプル作成 進捗確認 全体：現時点での工数管理表の上から順に対応中 現在dev環境に上がっているチケットの状況について 工数管理表にてタイトルが緑色に変わっているものがdev環境に上がっています。 GIG確認が終わったものは順次お渡しいたします 2024/10/03の本番反映について 現時点ではないです。 いくつかのチケットはトモノカイ様の確認待ちのものがありますのでそれらが候補になります。 検証にOKいただいた3個 そのほか 現状下記のチケット/事象の調査/対応を進めています（GIG小竹） 事象「現在、adminの採用確認画面で、採用：在籍確認◯or&times;が入って確認完了していたものが、すべて確認完了チェックが外れて、未提出にステータスが変更になっております。」 暫定対応：対象レコードに対して元に戻す処理を実施した 原因：こちらのバッチの12と13の処理に在籍確認の条件が入っておらずバッチ処理の対象なり更新されてしまった 今後の対応：バッチ処理の定義にて条件を修正し実装をする 対象レコード（条件）、処理を明確にしてトモノカイ様と合意とった上で実装対応に進む 今回の事象に対しては提出ステータス、在籍確認の条件を追加する -&gt;修正したらこのチケットでやり取り CTJ-4121 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4329 0f376871-0459-35fc-b139-2a34c915ec22 System Jira （GIG小竹） 調査の進捗をお伝えします。 パーソナルオファーのお話し 結論、オファー対象になるはずの会員が表示されないのは確認いたしまいした。 なぜ出てこないのか原因は調査中です。 オファーのロジックではなく、 クライアントのオファー一覧の検索結果の表示件数の上限が2000件であったため、検索結果に表示されませんでした。表示の問題もあります。 検索結果に表示される順番はIDの降順（新規登録時点が降順） 定義には検索結果の1ページあたりの表示件数は50件と記載ありますが、検索結果の上限を記載していなかったですが実装では2000件になっていました。そこが原因の1つとして考えています。 対応： クライアントのオファー一覧の表示件数の上限を変更 クライアントのオファー一覧の表示順 パーソナルオファーの対象（自動オファーは5年以内） インフラ環境の見直しに関しまして(トモノカイ鈴木) slackで石倉様と話をしましたが、最終的に一番いい案じゃないかと話になっている案で進めて問題ないと考えております。(現在のスペックのまま1AZにライターインスタンス、1AZにリーダーインスタンスを持ったAuroraクラスタ構成にする) 簡単に概要の説明だけメンバー向けにお願いいたします。 対応スケジュールなどは追って決められればと思いますが、早めに切り替えは進めたいと考えております。 以下、GIG石倉記載。 9/9に実施したDBインスタンスのスペックダウンによる問題は発生しておりません。 CPU利用率は添付画像の通りとなっており、ライターインスタンス、リーダーインスタンスともに平均30%ほどの利用率となっております。 ライターについては定期的に70%ほどのピークが発生している 上記のリソース状況から現在のスペックのまま「1AZにライターインスタンス、1AZにリーダーインスタンスを持ったAuroraクラスタ構成 」にすることが可能と考えております。 ★一番良い案かと考えております。 第2案として、Aurora構成ではなくRDSのSingleAZインスタンスを2台という構成にすると大きく費用削減できますが、自動でのフェイルオーバーがなく、可用性は下がってしまうため要検討と考えています。（負荷分散と可用性の両立のためRDSのMultiAZインスタンス2台とした場合は、おそらくRDSの方が費用が高くなると考えています。） 実行スケジュール 最速金曜日から着手する 口コミなどの重い機能のリリースした場合の影響は？ 足りない場合も可能性としてはあり得る（オートスケーリングの設定をしておくことで対処できる想定） 口コミのテストは要検討 採用者一覧のアップについて（トモノカイ片岡） ・契約アップロードはご相談させていただいた形式は可能でしょうか。 ・今すでに契約がある応募者データはご指定頂いた形で作成済みです。先んじていくつかお渡しした場合、バッチ作成やテスト実行は進められますでしょうか。 15 15 incomplete パーソナルオファーのロジックの調査 21 4f2c8655-a1ea-4a9e-a563-39e77b3b9cbe incomplete 契約データをお渡しする 22 8b5a96d8-8520-4676-8f32-423770f56b6b incomplete 契約アップロードの検討 &nbsp;決定事項 スペックダウンの作業の着手を今週金曜日から始める b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1234501664/2024-10-02",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-10-04T01:11:57.631Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 GIG小竹 16 16 complete パーソナルオファーの配信対象ロジック調査（CTJ-4329関連） 17 17 complete CTJ-4315 0f376871-0459..."
}