{
  "id": "1234501684",
  "title": "2024-10-09 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 16 6f3658a2-186a-4856-abb8-65ff6f865edb complete パーソナルオファー/自動オファーのロジックの調査 進捗確認 CTJ-4329 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 詳細ページの500エラーに関しては修正し先ほど本番反映いたしました。 今週木曜日に反映予定のチケット STG反映OKのチケットになります そのほか 昨日夜に起きたサービスサイト/アドミン/クライアントのダウンについて（GIG石倉） 発生期間 ダウンした日時：2024/10/08 19:46:00 復旧した日時：2024/10/08 20:15:04 直接原因： https://www.juku.st/search にアクセスが集中したことでデータベース負荷が高まってしまったため。 DB側のオートスケーリング設定については適用前であったため、自動でスケールアウトされずに負荷が高まってしまいました（現在では設定済みとなっております） 口コミリリース前に対応するよう進めていたのですが、本来インフラ設計時点、台数変更時点で考慮して設定を適用するべき項目でした。誠に申し訳ございません。 根本原因 ログ調査の結果、該当時間帯からdmai=のパラメータのついたアクセスが増えておりました。（ 調査資料 ） サンプルログ（以下へのアクセスが増えている） /search?argument=y5Awr3vc&amp;dmai=a66a32765dfa20 このパラメータはadebisで利用されているパラメータであり、おそらくこの時間帯に広告配信されたことでアクセスが集中したものと考えております。 dmaiパラメータを含む/searchへのアクセス数（Webサーバ1台分） 19時10分台：29件 19時20分台：13件 19時30分台：7件 19時40分台：277件 19時50分台：406件 追記：以下トモノカイ様からの回答も踏まえ改めて調査した結果、同一IPからの検索ページへのアクセスが607件となっておりましたため攻撃に近いアクセスが要因と考えております。 質問：実際に広告配信が行われたかどうか 議論：再発防止策について DBのオートスケーリング設定により、負荷が増大した場合でもスケールアウトする仕組みとする&rarr;対応済み WAFによる同一IPからの大量アクセスのブロック（しきい値検討中） これを実施する 同一ページに対してアクセスした場合をまずはやる（サービスサイト側のみ） 以下、トモノカイ池田記載。 弊社マーケチーム確認したところ、該当の時間帯に施策を実施した事実はないことでした。実際にアクセスがあったページについていくつかサンプルを頂いても良いでしょうか。 また、今回のデータベースの負荷上昇によるダウンは、月曜日に行ったインフラの影響ではない認識で良いでしょうか。 パーソナルオファー/自動オファーのロジックの調査（GIG江尻） 原因；高校、中学レコードが無い会員がオファー対象外であった オファー対象外の会員は、2023年6月7日以前に新規登録された人で間違いないか-&gt;間違いない 2023-06-07 18:05:00 以前のユーザーのみ 以下、トモノカイ池田記載。 私の方でも昨日時点の会員登録月別配信数をモニタリングしました。参考までに資料添付いたします。 https://drive.google.com/file/d/1JXWl8cV8UfIhrTMHjcGosMLOCqvSwB48/view?usp=sharing 現状：画面上の最大件数2000件 仕様上このままで GIG：現状、一回に送信できる上限は制限を設けていない。 &rarr;池田さん：上限を300件と設けるかどうかは検討する。 RIの購入について（GIG石倉） 今回購入するものの合計「$9,229.44（約1,370,073円）」が10月分に上乗せされる見込みになります。 【購入内容】 以下、トモノカイ池田記載。 11月以降の月毎の請求額を頂いても良いでしょうか。以前50万円／月程度になるとおしゃっていましたが、そこから特に変更はなさそうでしょうか。 11月以降についてはおよそ以下の請求金額になる見込みでございます（2台構成に変更したため、前回からさらに請求金額が下がっております） $1330.97（約197,619円）※前払い分除外 $2100.08（約311,748円）※前払い分を月ごとに按分 ※オートスケーリングが発生した場合はその分が上乗せされる 購入タイミング-&gt;本日対応（GIG対応） --（トモノカイ片岡）-- 請求データアップ（トモノカイ片岡） ①過去分のアップ ┝企業から過去分を見たいと言われるため ┝2024年4月以降のUPできていない数か月分 ┝明細＋採用者一覧+不要な明細削除 ┝10/21に実施したいです ┝当日発行まで行うため通知メールのバッチ停止 ②10月分11月請求のアップ ┝明細＋採用者一覧+不要な明細削除 ┝11/1に実施したいです。データは当日早めにお渡しします。 https://giginc.atlassian.net/browse/CTJ-4445 についてなるべく早く対応をしたく10月中いつ頃リリース可能か目途が立ち次第お伺いできれば幸いです https://giginc.atlassian.net/browse/CTJ-4226については11月中対応でも問題ございませんので今月は優先度下げて頂いて結構です。 https://giginc.atlassian.net/browse/CTJ-4384 の急募リリースですが、client画面での本番検証後にフルオープンしたく、弊社だけ本番で見れるようにIP制限等かけてリリース頂くことは可能でしょうか。 https://giginc.atlassian.net/browse/CTJ-4353の件ですが、貴社で発見頂いたバグかなと思いまして、後程経緯と状況をお伺いできれば幸いです。 ------------------------ 現在、急募機能を一時的に閉じて頂いておりますが、トモノカイの社内IPだけ復活させることは可能でしょうか。（トモノカイ池田） 急募機能のリリースに向けて、本番環境で正常に動作するか確認をしたいです。 一時的に復活させる時は直接URLにアクセスできるユーザを制限する（GIG対応） &nbsp; アクション事項 一時的に復活させる時は直接URLにアクセスできるユーザを制限する（GIG対応） チケットにて返信 請求データアップの準備 RIの購入（本日） パーソナルオファーの送信の仕様の確認 WAFによる同一IPからの大量アクセスのブロック（しきい値検討中）（GIG) これを実施する 同一ページに対してアクセスした場合をまずはやる（サービスサイト側のみ） &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235976240",
  "parentTitle": "議事録_2024年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1234501684/2024-10-09",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-10-09T08:25:53.091Z",
  "author": "Shogo Ishikura",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回出たネクストアクションの進捗 16 6f3658a2-186a-4856-abb8-65ff6f865edb complete パーソナルオファー/自動オファーのロジックの調査 進捗確認 CTJ-4329 0f3..."
}