{
  "id": "1242693655",
  "title": "記事カテゴリ",
  "content": "1. カテゴリ 名称 概要 備考 1 初めての塾講師ガイド 塾講師バイトを始める前のよくある質問・用語集や応募時の留意点・必要書類など、塾講師バイトを始める際の分からないことについてお答えします！ ステーション向け 2 塾講師の面接・テスト対策 選考（書類/面接/試験/模擬授業）カテゴリーでは、塾講師アルバイトを開始するために合格しなければならない面接や模擬授業について、面接内容、スーツの着方などの服装、自己紹介の方法、頻出の質問と対策方法、書類の書き方、模擬授業で押さえるべきポイントやコツなど、合格に役立つ情報・コツを紹介しています。 ステーション向け 3 塾ブランドの特徴 時給・テストや面接、評判などの特徴を各塾ブランドごとに40ブランド以上紹介。自分に合う塾ブランドがきっと見つかります！ ステーション向け 4 大学別おすすめ塾 大学別おすすめ塾では、全国の大学ごとにおすすめの塾ブランドや教室を紹介します。大学周辺の人気塾や通学路線、各大学の学生が住んでいる地域などのデータをもとにおすすめ塾をピックアップしています。 ステーション向け 5 塾講師の指導法 小学生、中学生の算数・国語・理科・社会・英語から高校生の全科目まで、塾講師が生徒の学習指導に使える指導法・指導のコツを一挙紹介！初めて塾講師アルバイトに携わる方でも、記事を読めば個別・集団問わず生徒を惹きつける授業ができるようになります！ ステーション向け 6 転職Q&amp;A 塾業界への転職に関する疑問や不安を解消するためのQ&amp;A集です。未経験からの挑戦や必要な資格、給与・待遇、キャリアパスなど、よくある質問に詳しくお答えします。 キャリア向け 7 転職ガイド 塾業界への転職を考えている方のために、応募から入社までのスケジュールやポイントを詳しく解説します。選考対策、面接のコツなど初めての転職でも安心して進められるよう、役立つ情報をご紹介します。 キャリア向け 8 塾講師キャリアコラム 塾講師としての働き方やキャリアパス、教育業界を深掘りするコラムを多数掲載。転職のヒントや職場選びのポイント、講師として成長するためのスキルアップ情報など、現役講師やこれから目指す方に役立つ情報が満載です。塾業界をより深く知りたい方におすすめです！ キャリア向け 9 塾講師 正社員解説 塾講師として正社員を目指す方へ、仕事内容や勤務時間、給与・年収、キャリアパスなど、正社員としての働き方を詳しく解説します。未経験からの挑戦や異業種からの転職を考えている方にも役立つ情報が満載です！ キャリア向け 10 プロ講師/家庭教師 副業解説 プロ講師や家庭教師として副業を始めるためのノウハウを徹底解説します。始め方や必要なスキル、報酬の目安、注意点など、具体的な情報を豊富に提供。副業を通じてキャリアアップや収入増加を目指す方に役立つ情報が満載です！ キャリア向け 11 求人特集 地域別や職種別など、分類した塾業界の求人情報を幅広く紹介します。未経験でも応募可能な求人から高待遇・正社員採用まで、あなたに合った求人がきっと見つかります！ キャリア向け 12 インタビュー 塾業界への転職を経験した方々の体験談を紹介しています。転職のきっかけや選考時のエピソード、塾業界で働く魅力や苦労など、リアルな声を通じて業界の実情をお届けします。 キャリア向け 2. 関連チケット CTJ-913 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4823 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "697925750",
  "parentTitle": "選択肢マスタ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1242693655",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-08T02:17:59.711Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. カテゴリ 名称 概要 備考 1 初めての塾講師ガイド 塾講師バイトを始める前のよくある質問・用語集や応募時の留意点・必要書類など、塾講師バイトを始める際の分からないことについてお答えします！ ステーション向け 2 塾講師の面接・テスト対策 選考（書類/面接/試験/模擬授業）カテゴリーでは、塾講師アルバイトを開始するために合格しなければならない面接や模擬授業について、面接内容、スーツの着方など..."
}