{
  "id": "1343815853",
  "title": "2025-01-15 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、原口様、前橋様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 complete 採用お祝いのチケットの2/3のところのチケットの優先度について来週の定例で確認して入れ替える検討する（小竹） 17 17 complete こちら検討しましたが、現在の優先度で問題ないため現状の優先度で進めさせていただきます。もし、本日以降で急ぎのチケットが起票された場合はその際に判断し、優先度のご調整の相談をGIGからいたします。 18 18 complete JIRAの記入項目の整理（片岡） 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 今週木曜日に反映予定のチケット CTJ-4702 0f376871-0459-35fc-b139-2a34c915ec22 System Jira そのほか スロークエリの対応の進捗について（GIG小竹） 進捗：GIGにて修正されたクエリの確認と修正方針を整理している形になります 予定していた本番環境での検証が遅れている理由： 昨年の12/15にダウンして以降現在までにダウンしていないため、他にリソースを使用していたため 開発チームが修正したクエリにさらなる改善が必要であることが発覚しその対応が増えたため 共有事項 改善作業を進める中で、各種クエリの定義の変更（例：応募数のカウントの期間など）の相談をチケット上でさせていただく形になります。 TOPページ/キャリアTOPの応募数は期間1年間-&gt;進める 工数管理表での管理について（GIG小竹） いくつかのチケットの管理をするために整理を行いました。1月に対応が継続して必要なものは、別途行を設けて1月の工数を記載するようにいたしました。 https://gig-inc.slack.com/archives/C04E48QPVC0/p1736836264158769 （GIG小竹） 現在、自動オファーの成果悪化が著しい状況でして、原因調査を行っております。 実機で確認して仮説が出たのですが、確認をお願いしても良いでしょうか。 自動オファーのメール通知をオフにするとメッセージ自体もオフになり、送られなくなる可能性があるので、 バッチの配信設定を改めて、ご確認して頂けますでしょうか。 調査結果 結論、現在の実装では下記が自動オファーの対象となりバグが起きております。申し訳ございません。 実装：自動オファーの利用と自動オファーのメール受信の設定が両方ともONの場合 仕様：自動オファーの利用がONの場合 対応していること 定義通りの実装になるように現在修正中になります 明日DEV環境にて検証を行う想定です。 別途バグについて 特定の教室で1日だけ自動オファーが3万件送られる事象が発生 1教室しかない。 オファー設定は、2022年ごろから更新されていない。 別途チケット化して対応 https://gig-inc.slack.com/archives/C04E48QPVC0/p1736481818351979 （GIG小竹） Amazonギフト券の一括発行ができない事象について 進捗共有 本番環境にて一括発行の動作していることは確認いたしました 具体的な原因調査のために本番環境にログコードを反映しましたので、一括発行の操作をトモノカイ様にてお願いいたします。操作後にslackにて操作した時間、操作したアカウントの情報を小竹宛にご共有お願いいたします -&gt;slackにて片岡さんとやりとりをして手動発行は正常であるため一括発行の対応は停止することになりました。 https://gig-inc.slack.com/archives/C04E48QPVC0/p1736323435552179 （GIG小竹） JIRAへの追加項目の対応 例： CTJ-4814 0f376871-0459-35fc-b139-2a34c915ec22 System Jira また、下記の項目については弊社内にて検討し、名称変更または一旦項目としては追加せずの形になりました。 ======================= 担当 「トモノカイ担当者」に名称変更させていただきました。理由は、GIG、HT社と複数社の担当がいるため、項目名だけで判別できるように変更いたしました。 GIG状況 こちらの項目は、工数管理表と２重管理になるため、追加しない（工数管理表のみの管理）とさせていただきました。こちらについては一旦追加しないという形ですので、JIRAに統合できるタイミングなどになりましたら追加も検討いたします。 リリース予定日 こちらの項目も工数管理表のG列の「検証可能日」と2重管理の側面があるため、追加しない（工数管理表のみの管理）とさせていただきました。こちらの項目自体、現在工数管理表にて適切に更新できていない面もあり申し訳ございません。 -&gt;2項目についてJIRAから値を参照してスプレッドシートに該当行に反映する形を想定 -&gt;リリース予定日の定義について（今の運用のslackで連絡しているものを想定している） -&gt;GIGにて確認して回答する。 下記のバグで求人の画像がno imageになっているものを特定する方法はありますでしょうか。。SQLで見れるバックデータに規則性が無い？ので特定が目視になっています。そこまで頻度は無いのですが、エラーログや何か規則があればお伺いしたいです。Ex.塾様がクライアント画面から大規模コピーを行って求人画像がno imageになりました、など。（トモノカイ片岡） https://giginc.atlassian.net/browse/CTJ-4503 https://giginc.atlassian.net/browse/CTJ-4714 -&gt;GIGにて確認して対応 JIRAの項目について、下記を足していただくことは可能でしょうか。。 GIG状況 リリース予定日 JIRAの取得は現在工数管理表に吐き出す形で行っておりまして、工数管理への反映は関数等、自動ででき、2重にはならないかと思っていまして。。過去データへの反映が手間、などございましたら、ある時点で未完了のJIRAのみ記載する運用でも問題ないです。（トモノカイ片岡） 4月以降の予算の期限はいつまでに決める必要がある？ -&gt;2月末頃までに決定想定 &nbsp;アクション事項 15 15 incomplete 特定の教室で1日だけ自動オファーが3万件送られる事象のチケット作成 19 a7dcc949-3e1a-4d17-8dd2-14e479e76305 incomplete オファーのバグの修正（チケット化したものの対応） 20 2c1854c5-f5ea-4492-b4bb-a4ac6859eba1 incomplete JIRAへの追加項目の対応においてGIGにて検討項目についてどのように対応するか決める 21 f4288fa0-6534-4214-ace8-244afca33c97 incomplete no imageのチケット（2つ）の確認 &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED TOP・キャリアTOPの「人気の〜」算出のための集計期間は過去１年間とする。 73122289-06ce-4dce-b9da-b849dad0d334 DECIDED 4月以降の予算の期限は2月末ごろとして進める。 TOP・キャリアTOPの「人気の〜」算出のための集計期間は過去１年間とする。 4月以降の予算の期限は2月末ごろとして進める。",
  "parentId": "1710817285",
  "parentTitle": "議事録_2025年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1343815853/2025-01-15",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-15T06:43:49.653Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、原口様、前橋様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 complete 採用お祝いのチケットの2/3のところのチケットの優先度について来週の定例で確認して入れ替える検討する（小竹） 17 17 complete こちら..."
}