{
  "id": "1371897917",
  "title": "2025-02-05 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 incomplete 2つの障害対応の残りの箇所の調査 17 17 complete 24日の障害報告書の根本原因 22 22 incomplete 28日の障害報告書の根本原因、再発防止策 28 28 incomplete 進行中になります。 18 18 incomplete 緊急時の対応フローの作成 19 19 incomplete 進行中になります 20 20 complete エラー検知周期の改善 21 21 complete サーバ構成の再確認（3月の繁忙期に入る前に再度確認） 25 25 complete 直近１ヶ月（可能であれば１１月のReservedInstance購入以降）に不安定になった箇所をログから確認する 27 27 incomplete 本日下記と合わせて説明いたします 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 今週木曜日に反映予定のチケット CTJ-4849 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4501 0f376871-0459-35fc-b139-2a34c915ec22 System Jira STG反映OKのチケット そのほか 24日の障害報告書の根本原因と現在対応していることについて（GIG小竹） https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/1371898018 エラー検知周期の改善 ポーリング（定期的な問い合わせ）の間隔の現状 1分周期で5回連続でステータスコードが200以外（エラーの場合）にalert通知が来る仕組みになっておりそこで検知する形になっております。 直近2週間の負荷状況について（GIG小竹） 目的 ：3月の繁忙期を迎える前にインスタンスを増やすなどのサーバ構成の変更対応が必要か判断するため 確認範囲 ：（1/23-2/3）2週間分のRDSのオートスケールイベントログ（ https://docs.google.com/spreadsheets/d/192qx5XbPg0wZ-CgaIIAVOpufZgv85eAjAT9DKbhpVxw/edit?gid=0#gid=0 ） 説明の行で Adding 1 read replica(s). となっているところはデータベースの負荷が高まって（CPU使用率が80%以上）オートスケーリングしていて、インスタンスの自動追加を行っているタイミングなので、繋がりにくくなっている可能性がある データベースのオートスケールイベントログが2週間であったため（現状のログを保存する仕組みでは最大2週間） 分かったこと 1日平均5.5回負荷が高まってオートスケーリングしてインスタンスを追加している。 多い日で12回負荷が高まってオートスケーリングしてインスタンスを追加している。 11月のリザーブドインスタンスの構成変更によって負荷状況が変わったことはログ上ではないように見える 10月初旬に負荷が高まっていること がログ上では読み取れる（10/9に自動オファーのロジックを修正しているためそれの影響が考えられる） -&gt;10/9以降、平均的に上がっているので他にも要因があるかもしれないので再度調査 現状の DB のオートスケールの設定 スケールインクールダウン期間：300秒 スケールアウトクールダウン期間：300秒 負荷が上がり始めてCPU使用率が80%超えて300秒経ったら、インスタンスを追加する 少しラグがあって一時的にサイトに繋がりにくくなる可能性がある 今後の対応策（検討中） オートスケールの設定（スケールインクールダウン期間、スケールアウトクールダウン期間、 使用率 ）を変更する。 スケールするまでの時間を短くする 使用率を70%程度に下げる インスタンスを1台増やす（一月当たり10万円程度追加） &rarr; こちらの対応で進める（希望期日：今週中） 来週 の本番反映について（GIG小竹） 2/11が祝日のため来週の本番反映は木曜日のみとして進めさせていただく形で問題ありませんでしょうか？ -&gt;この形で進める CTJ-4526 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 相談事項：メンテナンスモードに入れるタイミングのご相談 候補 12日9:00-10:00 or 10:00-11:00 13日9:00-10:00（情報局の前の対応になる） 最終決定：現在、手順など確認中ですので、今週金曜日17:00までに決めた日時での実行可否についてご連絡いたします。 CTJ-5012 0f376871-0459-35fc-b139-2a34c915ec22 System Jira （江尻） 状況と対応方法のご共有 原因：「応募動機」と「指導の工夫」のラベルを区別する値が正しく移行できていなかった。 経緯：前回の修正インポート時は、両者のラベルの出しわけができていないというアプリ上の課題が残っていたため検知できなかったが、アプリ解消したため判明。 対策：ラベルを区別する値のみインポートし直す。 実行タイミング：ラベルを区別する値のみであるため、インポート時のサイトの負荷への影響は前回より小さい見込みであるが、メンテナンスモードにて行うべきであるかどうか確認中。 &rarr;方針：採用確認の方のメンテナンスタイミングに間に合えば同じタイミングのメンテナンス中に実行する。それ以外のタイミングの場合も、負荷は小さい見込みなので、ランニング中に実施する。 パーソナルオファーを一度送信した会員には、90日同じ企業がパーソナルオファーを送信できないという制限があると思うのですが、 要件定義書 にそちらの記載が見当たらず、実装されているか確認をお願いしても良いでしょうか（トモノカイ池田） 関連した重要課題の起票があるので、できれば本日か明日までに回答いただけると非常に助かります。 回答（GIG小竹） &rarr; 定義書： https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/686686292 &rarr; 実装状況：実装済み スロークエリの対応状況について進捗あれば教えていただいても良いでしょうか。（トモノカイ池田） スロークエリの改善1（塾ステーションTOPの人気の路線のクエリ） &rarr; こちら修正中になります（GIG小竹） スロークエリの改善2（キャリアTOPの人気の路線のクエリ） &rarr; こちら修正中になります（GIG小竹） スロークエリの改善3（オファーのクエリ） &rarr; こちら修正したものをGIGにてレビュー中になります（GIG小竹） &rarr; 上記のスロークエリの検証は2月中を目処に本番環境に反映し監視することを目指して対応進めております（GIG小竹） 弊社内の課題管理のフローを変更した影響で、開発の補足資料を書きのドライブに集約しております。小竹さんと江尻さんをコンテンツ管理者で招待しましたので、適宜必要であればメンバー追加して頂いて構いません。（トモノカイ池田） https://drive.google.com/drive/folders/170nNjUfrS0tmuOw16e_PuZwYutEWSeEu &nbsp;アクション事項 10/9以降、平均的にDBの使用率が上がっているため、他にも要因があるかもしれないので再度調査 2/12 9:00-10:00にメンテナンスモードに入れて対応（最終決定は金曜日17:00までに確定し連絡） &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED DBのインスタンスは1台増やすことで決定（対応期日は今週中） 4b49fe33-5d91-4177-98c6-6f93d695be68 DECIDED DBインスタンス増加は一時的なものでスロークエリなどの改善で負荷が軽減されてきたら追加分を減らす方針で進める da0bdb3d-a51f-47c5-8079-c0ddfbf2d993 DECIDED スロークエリの対応は一旦区切りついたらSEO周りと赤字のチケットを優先度あげて対応 DBのインスタンスは1台増やすことで決定（対応期日は今週中） DBインスタンス増加は一時的なものでスロークエリなどの改善で負荷が軽減されてきたら追加分を減らす方針で進める スロークエリの対応は一旦区切りついたらSEO周りと赤字のチケットを優先度あげて対応",
  "parentId": "1710817285",
  "parentTitle": "議事録_2025年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1371897917/2025-02-05",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-07T09:43:16.437Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 incomplete 2つの障害対応の残りの箇所の調査 17 17 complete 24日の障害報告書の根本原因 22 22 incomplete 28日の障害報..."
}