{
  "id": "1387790569",
  "title": "求人一覧 - エリアのFAQ内容",
  "content": "1. ステーションにおける内容 質問 回答 1 [##エリア名##]で大学生でも始められる塾講師バイトはありますか？ [##エリア名##]で大学生を歓迎している塾一覧は以下のリンクから見ることができます。「大学生歓迎」の塾は研修が手厚くテストなど大学生の都合も理解してくれるところが多い為、大学生におすすめです。 [##エリア名##]内の大学生歓迎の求人一覧は こちら ※「こちら」にURLを挿入。 2 [##エリア名##]で高時給な塾講師バイトはありますか？ [##エリア名##]の高時給の塾講師バイト求人の一覧は以下のリンクから見ることができます。個別指導でも指導力が求められたり、集団指導で大勢の前に立って教えるような塾は高時給になりやすい傾向にあります。 [##エリア名##]内の時給1300円の求人一覧は こちら ※「こちら」にURLを挿入。 3 [##エリア名##]にはどのような個別指導塾がありますか？ [##エリア名##]で個別指導の塾講師バイトの求人一覧は以下のリンクから見ることができます。個別指導は、生徒一人ひとりの成長を間近で応援したいと思っている人におすすめです。 [##エリア名##]内の個別指導の求人一覧は こちら ※「こちら」にURLを挿入。 4 [##エリア名##]にはどのような集団指導塾がありますか？ [##エリア名##]で集団指導の塾講師バイトの求人一覧は以下のリンクから見ることができます。集団指導は、大勢の前やプレゼンが得意な人が向いている傾向にあります。 [##エリア名##]内の集団指導の求人一覧は こちら ※「こちら」にURLを挿入。 駅の場合は、[##エリア名##]の後に「駅」を付与する。 Q３、Q４において、こちらのリスト（ https://docs.google.com/spreadsheets/d/1Pg8DVMNrtowi3gpFweJx8BIUFJN9kZSeucbAPUyTTKk/edit?gid=671957577#gid=671957577 ）のエリアのみ、回答の最初にリスト内の回答内容を記載した上で、共通の回答を記載する。 例えば大阪府のQ３は下記の様になる。 FAQ３質問例： 大阪府にはどのような個別指導塾がありますか？ FAQ３回答例： 大阪府内の個別指導の塾講師バイトは個別指導キャンパス、第一ゼミナールといった関西圏を主な拠点とする塾に加え、明光義塾、スクールIEといった全国区の塾の教室も多数存在します。 大阪府で個別指導の塾講師バイトの求人一覧は以下のリンクから見ることができます。個別指導は、生徒一人ひとりの成長を間近で応援したいと思っている人におすすめです。 大阪府内の個別指導の求人一覧は こちら 2. キャリアにおける内容 質問 回答 URL ##エリア名##で未経験でも始められる塾講師の正社員求人はありますか？ 塾講師未経験でも塾の正社員募集はあります。個別指導塾の教室長などは、塾講師経験がなくても教室運営が業務の中心になるため、未経験歓迎の塾が多いです。 指導は講師が行うため、教室長は「入会希望の生徒・保護者への説明」「保護者との学習相談」「講師のサポート」が業務の中心になっている塾が多く、未経験でも安心して働くことができます。 ##エリア名##の未経験歓迎の求人一覧は こちら 「こちら」をテキストリンクにして下記のURL設置。 [##エリア&times;未経験&times;正社員の求人一覧URL##] ##エリア名##で好待遇な塾講師の正社員求人はありますか？ 経験やよって異なりますが、正社員講師の場合は月給20万円～30万円程度が目安です。年収にすると平均約418万円になります。塾によって異なりますが、大手学習塾になると給与の他に手当てなども充実しているため高くなる傾向があります。また、難関校対策ができるなど専門性が高い方は、さらに高収入が期待できる場合もあります。 ##エリア名##の月給30万以上の求人一覧は こちら ##エリア名##の月給40万以上の求人一覧は こちら 「こちら」をテキストリンクにして下記のURL設置。 [##エリア&times;月給30万円&times;正社員の求人一覧URL##] [##エリア&times;月給40万円&times;正社員の求人一覧URL##] [##エリア名##]にはどのような個別指導塾がありますか？ [##エリア名##]にて個別指導の塾講師の正社員求人一覧は以下のリンクから見ることができます。個別指導塾は、教室長・管理職候補の募集が多い傾向にあります。マネジメントや教育に興味がある方、人と関わることが好きな方におすすめです。 ##エリア名##の個別指導塾の求人一覧は こちら 「こちら」をテキストリンクにして下記のURL設置。 [##エリア&times;個別指導&times;正社員の求人一覧URL##] [##エリア名##]にはどのような集団指導塾がありますか？ [##エリア名##]にて集団指導の塾講師の正社員求人一覧は以下のリンクから見ることができます。集団指導塾は、講師職の募集が多い傾向にあります。大勢の前やプレゼンが得意な人方、マネジメント業務もしつつ教壇に立ち続けたい方におすすめです。 ##エリア名##の集団指導塾の求人一覧は こちら 「こちら」をテキストリンクにして下記のURL設置。 [##エリア&times;集団指導&times;正社員の求人一覧URL##] 3. 関連チケット CTJ-4946 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-5113 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "938377236",
  "parentTitle": "011_【作成中】求人一覧閲覧・検索機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1387790569/-+FAQ",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-03-19T10:01:34.464Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. ステーションにおける内容 質問 回答 1 [##エリア名##]で大学生でも始められる塾講師バイトはありますか？ [##エリア名##]で大学生を歓迎している塾一覧は以下のリンクから見ることができます。「大学生歓迎」の塾は研修が手厚くテストなど大学生の都合も理解してくれるところが多い為、大学生におすすめです。 [##エリア名##]内の大学生歓迎の求人一覧は こちら ※「こちら」にURLを挿入。 ..."
}