{
  "id": "1395163138",
  "title": "キャリアトップFAQコンテンツ",
  "content": "カテゴリ 質問 回答 記事URL 塾講師の正社員に関するよくある質問 塾講師の年収は？ 塾講師の正社員は、平均年収は約431万円で、大手塾では500万円以上も可能です。 年齢や経験、企業規模により差がありますが、キャリアアップをして教室長やエリア長などのマネジメント・管理職に就任したり、人気講師になることで年収600～1,000万円を目指せすことも可能です。 https://www.juku.st/info/entry/2631 教員から転職はしやすい？ 教員からの転職は決して容易ではありませんが、授業で培った対人スキルやプレゼン力は他業種でも高く評価されます。 特に塾講師や教室長、学童指導員などが好まれる傾向があります。 自己分析と業界研究を徹底すれば、教員経験を活かせる転職先は十分に見つかる可能性はあります。 https://www.juku.st/info/entry/3076 塾講師の正社員になるには？ 学習塾の正社員講師になるために、特別な資格は通常必要ありません。 学習塾には「個別指導塾」と「集団指導塾」がありますが、個別指導塾ではアルバイト講師が多く活躍しています。そのため、塾での正社員ポジションは、 ・集団指導塾の講師 ・個別指導塾の教室長候補（教室長） がほとんどを占めています。 無し 塾講師の職務経歴書の書き方は？ 職務経歴書には、ひな形程度のフォーマットはありますが、詳細なまとめ方は自由です。 そのため、効果的な職務経歴書を作るためには、レイアウトや見出しを考えるなど書き方の工夫が必要とされます。 詳しい書き方についてはこちらを参考にしてください。 https://www.juku.st/info/entry/3153 塾講師の転職活動ってどうやって進めればいい？ ①自己分析・企業分析(求人を検索) ②応募・書類作成 ③面接 ④内定・退社・入社 の流れで進めていきます。 転職活動の期間は、一般的に2～3ヶ月と言われています。 塾の正社員の場合は季節講習などの影響でもう少し長くかかる場合もあるようです。 詳しい解説はこちらをご覧ください。 https://www.juku.st/info/entry/3154 塾講師の転職理由ってどう伝えたらいい？ 入社後の仕事に対する目標や取り組みの姿勢を伝えることを意識しましょう。 大事なポイントは以下の3つです。 ①嘘はつかない ②前職の愚痴や不満を必要以上に言わない ③前向きな言い方に言い換える 詳しい解説はこちらをご覧ください。 https://www.juku.st/info/entry/3165 塾業界の年間休日ってどのくらい？ 塾講師ステーションキャリアに掲載されている求人の平均年間休日数は「114日」でした。 ただし年間休日が多い・少ないだけでホワイト企業なのかを判断することは難しいです。 詳しい解説はこちらをご覧ください。 https://www.juku.st/info/entry/3166 塾講師に内定した後はどんなことをすればいいの？ ①内定を承諾する(雇用契約を結ぶ) ②現在の職場と、退職交渉をする ③退職日決定・退職届を提出する ④入社手続きに必要な書類を準備する の流れで進めていきます。 入社手続きに必要な書類が色々あるので注意しましょう。 詳しい解説はこちらをご覧ください。 https://www.juku.st/info/entry/2811 関連チケット CTJ-5020 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "719257718",
  "parentTitle": "002_【FIX】キャリアトップ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1395163138/FAQ",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-03-03T03:50:58.844Z",
  "author": "kotake_jin",
  "excerpt": "カテゴリ 質問 回答 記事URL 塾講師の正社員に関するよくある質問 塾講師の年収は？ 塾講師の正社員は、平均年収は約431万円で、大手塾では500万円以上も可能です。 年齢や経験、企業規模により差がありますが、キャリアアップをして教室長やエリア長などのマネジメント・管理職に就任したり、人気講師になることで年収600～1,000万円を目指せすことも可能です。 https://www.juku.st..."
}