{
  "id": "1440809105",
  "title": "2025-04-23 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 incomplete デザインについて方針確認できたのでデザイン作成を進める 17 17 incomplete こちら木曜日にデザイン作成完了予定ですので金曜日にはトモノカイさまに確認いただけると予定です。 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 木曜日に反映予定のチケット CTJ-5132 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 701のバッチのログコード そのほか 701のエラーの調査の進捗 原因調査した結果、t-newsのバッチを本番で手動実行した際の影響でエラーになっておりましたが、現在は正常に動いていることを確認しております。 今後再発した際に迅速に原因調査するためのログコードを反映する作業を明日の本番反映枠で実施して本件は様子を見る形でいかがでしょうか？ スロークエリ対応（求人検索）の進捗（GIG小竹） GIGDEV環境にて検証中です。DEVで検証して問題なければ以前お話しした通り本番環境にてDBインスタンスを複製して検証できればと思います。 1点クエリの構造を変えるところで仕様変更が可能か確認した箇所がございます。 求人のソートについてですが、最終更新日時のみを使用する形に変更する形でも問題ございませんでしょうか？ （ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/938377236/011_?focusedCommentId=1017315463 ） 理由：求人の「最終更新日時」と教室の「最終レビュー公開日時」の どちらか新しい方を使ってソートする 仕様になっていますがこれをどちらか1つに変更できればクエリの高速化が可能になるため。 &rarr;求人の最終更新日時のみで問題ない。現在はお祝い金規制の影響で口コミの取得もしていないので、口コミ公開日が新たに更新されることはないため。 4月の準委任契約における工数消化の現状と今後のご相談（GIG小竹） 現在の進め方：工数管理表の上から順に着手してバグ/仕様変更のチケットを対応している 現状：4月分の仕様変更チケットの消化ペースが下がってきてしまっています。 要因 上から順に対応しており、現状優先度が高いバグチケットが多いため 仕様変更チケットとバグチケットについて同じ人間が対応しているため 今後 弊社都合になりますが、1月あたり契約不適合のバグチケットの工数目安をを準委任契約の工数の30%上限で対応させていただけないでしょうか？ 改善（準委任契約）の工数（68人日）+契約不適合の工数（準委任の工数の30%） 上限目安を設けることで、仕様変更（改善）への対応を維持しつつ、契約不適合に該当するバグにも一定の優先度と工数枠を持って安定的に対応していけると考えております。 応募フォーム（SP）の改修について（GIG小竹） 現在、項目の追加およびデザイン面の改修をしておりますが、フォーム全体に対しての課題について伺いたいです。 前回のMTGで現在の応募フォームは特にSPでは長いコンテンツになっておりできるだけコンパクトに見せたいとありましたので再度SPのフォームに対する課題をご共有いただけますと幸いです。 例：応募フォームでの離脱率が高く応募数に負の影響を与えているなど 意図：応募フォームは求人サイトにおいて非常に重要な要素だと思いますので、フォームの情報設計から見直しが将来的には必要か確認したいためです。 -&gt;全体的に見直すのは別途他チケットで対応 学年更新バッチのリリース予定日の確認（トモノカイ池田） 今月の最終リリース日が24（木）ということを前回すり合わせしましたが、こちらに上記の開発のリリースは間に合いそうでしょうか。 GW期間の本番反映スケジュール 4/24、5/1、5/8 &nbsp;アクション事項 15 15 incomplete 工数管理シートで4月、5月稼働予定が分かる様にフラグ変更する。 20 ca726ea2-60f5-406e-aa04-908aae746f87 incomplete 月の管理について検討 21 090aca1b-b2f5-4373-b26e-3c0a53991390 incomplete 5月の追加の仕様変更チケットを起票する 22 a6e7ae97-e71a-4475-a143-daa2d2fb3f77 incomplete 応募フォームの全体的なデザイン改修についてのチケット起票 &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED 求人のクエリ改善策の一環として「最終レビュー公開日時」の条件を外す。 6d7fafcc-178c-490e-9aa4-44d28fc6d59e DECIDED バグ対応工数（契約費用外の無償対応分）は、改善契約稼働に30%掛けた程度を目安の上限として進める。 求人のクエリ改善策の一環として「最終レビュー公開日時」の条件を外す。 バグ対応工数（契約費用外の無償対応分）は、改善契約稼働に30%掛けた程度を目安の上限として進める。",
  "parentId": "1710817285",
  "parentTitle": "議事録_2025年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1440809105/2025-04-23",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-04-23T07:27:39.532Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 incomplete デザインについて方針確認できたのでデザイン作成を進める 17 17 incomplete こちら木曜日にデザイン作成完了予定ですので金曜日には..."
}