{
  "id": "1441071185",
  "title": "2025-04-02 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 complete 本日：メール送信履歴の3ヶ月の本番反映 17 17 complete メール送信履歴を利用いただき1週間程度負荷率モニタリングする 18 18 incomplete 求人一覧で使用されている検索のクエリで軽微に修正できるものがあるか調査し、すぐに対応できる者があるか確認する 19 19 complete 学年更新バッチの条件に当てはまる具体例の共有 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 木曜日に反映予定のチケット 現状なし（要件定義/検証に時間を要しているものが多い状況です） そのほか メール送信履歴を利用いただき、1週間程度負荷率モニタリングする （GIG小竹） メール送信履歴機能で使用されたクエリでスロークエリは確認されていますが以前ほどの数百秒単位ではないことを確認しました。 メール送信履歴を使用する中でタイムアウトするなどありましたらコメントいただけますと幸いです。 &rarr;現時点は特に問題なし（トモノカイ池田さん） スロークエリの対応について（GIG小竹） 求人検索（求人一覧画面）で使用されているクエリの課題の洗い出しと改善方針についてですが、工数として2人日（工期としては1週間程度）必要になる形です。 前回のMTGでは軽微な修正（インデックス作成など）であればそこまでの工数がかからずにできるとお伝えしましたが、求人検索で使用されているクエリは複数のパターンがあるため想定よりも課題の洗い出しおよびその課題の改善策の検討に多く時間がかかっている形です。 サイトへのアクセスがしづらいような障害はオートスケールの設定変更およびメール送信履歴のスロークエリの改善により解消傾向だと思いますので対応優先度の確認ができればと考えております。 &rarr;調査は進めていただきたい。他の優先チケットはトモノカイ社内での確認・検討が必要なものがいくつかあるため、その間に調査を進めておきたい。（トモノカイ池田さん） STG環境停止に向けた対応について（GIG小竹） STG環境を停止する前に下記のことを解決してからの対応と考えております。 現在、本番とDEV環境の差分が多くあるためその差分を一度整理してからSTG環境停止の作業をさせていただきたいです。 実際に本番とDEV環境の差分をなくすためには下記の作業が必要となります。 下記の作業をしている間はDEV環境での検証ができなくなる ため実施時期の相談をさせてください。下記の作業は本番反映枠の日の15:00から19:00を予定しています。※現状STG停止に伴う作業としては優先度低いと思われますため検証を優先する場合は一旦見送りを考えております。 DEVを本番と同じ状態にする（DEV環境をリベースする） DEV専用だった変更を必要に応じて再反映する -&gt;4/8（火）15:00-19:00想定で進める 社内で塾ステのアプリの開発を今年度予定しております。その開発に伴って、DBの参照権限を頂くことは可能でしょうか。（トモノカイ池田） 下記、社内のエンジニアからの要望です。 APIはトモノカイ側で作成するのでDBの参照権限(READ)が欲しい アプリ独自の機能追加の際に、必要に応じてデータの操作をしたいので、CRUDのCUD権限が欲しい (必要になった場合) アプリ独自の機能追加の際に、必要に応じてスキーマの追加作業をしたいので、編集権限が欲しい（必要になった場合） 上記ができなければこちらからスキーマの追加依頼をしてGIG様に対応していただきたい &rarr; 回答（GIG小竹） まず、アプリ開発およびAPI開発の体制や目的、どのようなデータ連携が必要かを明確にするため、下記の点についてお伺いできればと思います。 上記のDB権限については、下記について明らかにしてから回答させていただきたいと考えております。 &rarr;GIG側で現時点で気になる点 アプリやAPIの設置場所：現サーバ・アプリ環境との棲み分けやシステム分担 パフォーマンス：現システムで活用しているキャッシュが活用されない可能性あり。 ご確認したい事項 アプリ開発の目的と全体像 開発体制と担当範囲 技術構成とデータ連携の想定 DBアクセス環境と接続方式 セキュリティ・ガバナンス 運用について 不具合や障害が発生した場合の責任について &rarr; ご確認事項についてはトモノカイ様で回答いただく サイトマップの出力について確認。（トモノカイ池田） 下記2点のサイトマップはキャリアのURLが出力される想定の物ですが、どうやらステーションのものが出力されているようです。ご確認していただき、正しくないようでしたら、起票して依頼を掛けようと思います。 https://www.juku.st/brands-career-sitemap.xml https://www.juku.st/company-career-sitemap.xml &rarr; 回答 こちら仕様上ではキャリアの条件をつけておりますが出力する際にURLの中に/caを入れておりませんでした。そのためバグの形で起票をお願いいたします。 HT社の稼働について 来週月曜日（ ）がベトナム祝日のため開発チームの稼働ができません。そのため、来週火曜日（ ）の本番反映枠の対象は、今週金曜日までの内容でトモノカイ様確認OKになったチケットになります。 &nbsp;アクション事項 15 15 incomplete スロークエリの調査を進める 20 20 incomplete STG環境停止に関連してDEV環境でのリバート作業の実施日の共有 （確定後にトモノカイ様にご共有） 21 21 incomplete 塾ステーションのアプリ開発のおいて上記記載の「GIG側で現時点で気になる点」および「ご確認したい事項」についての確認 22 22 incomplete サイトマップの出力（キャリアの条件のもの）について再度見直していただきご起票いただく &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED STG停止に向けたDEV環境作業を4/8（火）15:00-19:00想定で進める STG停止に向けたDEV環境作業を4/8（火）15:00-19:00想定で進める",
  "parentId": "1710817285",
  "parentTitle": "議事録_2025年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1441071185/2025-04-02",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-04-02T06:28:23.988Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 16 complete 本日：メール送信履歴の3ヶ月の本番反映 17 17 complete メール送信履歴を利用いただき1週間程度負荷率モニタリングする 18 18 i..."
}