{
  "id": "1488027653",
  "title": "【要求FIX／要件作成中】215_応募者移管機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の紐付け先求人を変更するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 本画面へは https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745/125_+FIX?atlOrigin=eyJpIjoiNWQ2ZGNhYjA3ZDEwNDU5ZDhjYzM5ODI4NzI2NDdjOTAiLCJwIjoiYyJ9 より遷移する。 画面に表示する項目は基本的にWFの通りとし、特筆すべき内容を以下に記載する。 キャンセルボタン 押下すると、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745/125_+FIX?atlOrigin=eyJpIjoiNWQ2ZGNhYjA3ZDEwNDU5ZDhjYzM5ODI4NzI2NDdjOTAiLCJwIjoiYyJ9 へ遷移する。 移管元 企業 本画面への遷移元の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745/125_+FIX?atlOrigin=eyJpIjoiNWQ2ZGNhYjA3ZDEwNDU5ZDhjYzM5ODI4NzI2NDdjOTAiLCJwIjoiYyJ9 の企業名を表示する。 教室グループ 「企業」に紐づく教室グループを選択可能。 教室 「教室グループ」が選択されていない場合、非活性として入力内容を無効とする。 「企業」および選択された「教室グループ」に紐づく教室を選択可能。 移管先 企業 サービス種別 「ステーション」「キャリア」から選択できる。 教室グループ 「企業」および「サービス種別」が選択されていない場合、非活性として入力内容を無効とする。 指定した企業、サービス種別、に紐づく 、有効な基本契約のある すべての 教室グループを選択肢として選択可能。 教室 「教室グループ」が選択されていない場合、非活性として入力内容を無効とする。 「企業」および選択された「サービス種別」「教室グループ」に紐づく教室を選択可能。 求人 選択された「教室」に紐づく求人を選択可能。 移管対象 移管元の「教室」および移管先の「求人」が選択されていない場合、非活性として入力内容を無効とする。 選択された移管元の「教室」の求人に紐づくすべての応募情報を母数として、「全員」「採用確認状況「未完了」」「対象者を選択」から選択可能。 「全員」と「採用確認状況「未完了」」の選択肢には、該当する対象者の人数を表示する。 移管対象の応募一覧 「移管対象」として「対象者を選択」が選択されている場合 選択された移管元の「教室」の求人に紐づくすべての応募情報を母数として、総件数および応募一覧が表示される。 チェックボックスで移管対象とする応募を選択可能。 それ以外の場合 総件数および応募一覧は表示されない。 移管するボタン 「移管対象」が選択されており、「対象者を選択」の場合は応募が1件以上選択されている場合にボタンが有効化される。 押下すると、後述する処理を実行する。 移管ボタンを押下すると、後述する移管可否および請求変更有無の条件表にしたがって、以下の処理を実行する。 移管不可の条件に該当する応募が含まれている場合 移管処理は実行せず、対象の応募番号と、それぞれ移管不可となった条件がわかるエラーメッセージを表示したモーダルを表示する。 モーダルには閉じるボタンを設け、押下するとモーダルを閉じる。 移管不可の条件に該当する応募が含まれていない場合 実行確認モーダルが表示される。 「キャンセル」を押下すると、以降の処理を実行せずにモーダルを閉じる。 「移管する」を押下すると、以降の処理を実行する。 移管対象のすべての応募の紐づけ先の求人を、指定した移管先の求人へ変更する。 「請求変更あり」の条件に該当する応募がある場合、対象のすべての応募において以下を実行する。 対象の応募情報に紐づく請求明細を、移管先の該当する請求明細に変更する。詳しくは以下の通り。 応募課金の場合 移管先の求人において、応募日（ 【FIX】応募情報 の作成日）が含まれる月の応募課金の請求明細へ変更する。 採用課金の場合 移管先の求人において、応募情報の請求確定日が含まれる月の採用課金の請求明細へ変更する。 変更前の請求明細の数量を1減らし、変更後の請求明細の数量を1増やす。 変更前の請求明細、変更後の請求明細ともに、 （共通）請求関連共通処理 の処理で 【修正中】請求：基本情報 へ更新内容を反映する。 移管が完了すると、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745/125_+FIX?atlOrigin=eyJpIjoiNWQ2ZGNhYjA3ZDEwNDU5ZDhjYzM5ODI4NzI2NDdjOTAiLCJwIjoiYyJ9 へ遷移して、「応募者の移管を完了しました」というメッセージを表示したモーダルを表示する。 モーダルには閉じるボタンを設け、押下するとモーダルを閉じる。 移管で成功または失敗した場合、以下の情報が入ったログを出力する。ログは、変更した契約情報1レコードごとに別々に出力する。 日時、実行した全体管理者のユーザー番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 移管可否および請求変更有無の条件表 &nbsp; 移管先 応募課金あり（※4） 採用課金あり（※5） 同じ雇用形態なし（※6） 同じ雇用形態あり（※6） 移管元 請求済み（※1） 移管可／請求変更なし 未請求（※1） 応募課金（※2） 移管可／請求変更あり 移管不可／請求変更なし 採用課金（※2） 請求未確定（※3） 移管不可／請求変更なし 移管可／請求変更なし 請求確定（※3） 移管可／請求変更あり 以下は、移管対象の応募（ 【FIX】応募情報 ）および関連するデータの元の状態により判定する。 ※1：応募情報（に紐づく 【FIX】請求：請求明細 ）に紐づく 【修正中】請求：基本情報 の「承認日時」に値があれば「請求済み」と判定し、値がなければ「未請求」と判定する。 ※2：応募情報に保存された「成果報酬商品番号」が指す商品の「課金形態」によって、「応募課金」か「採用課金」かを判定する。 ※3：応募情報に請求確定日時があれば「請求確定」、なければ「請求未確定」と判定する。 以下は、移管先の求人および関連するデータの元の状態により判定する。 移管対象の応募が「応募課金」の場合 ※4：応募日（ 【FIX】応募情報 の作成日）時点に、移管先の求人に該当する「応募課金」の有効な契約が存在していた場合、移管先に「応募課金」があるとみなす。 移管対象の応募が「採用課金」の場合 ※5： 応募情報の「請求確定日」の時点 応募日（ 【FIX】応募情報 の作成日）時点または移管処理実行時点 に、移管先の求人に該当する「採用課金」の有効な契約が存在していた場合、移管先に「採用課金」があるとみなす。 ※6：移管先に存在していた採用課金契約の雇用形態に、移管元の求人の雇用形態と一致するものがある場合「同じ雇用形態あり」と判定し、ない場合「同じ雇用形態なし」と判定する。 3.2. 権限 要求に同じ 3.3. 帳票 要求に同じ 3.4. メールテンプレート なし 3.5. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 移管画面 https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=221191-40699&amp;t=Tj2Cy9OAQY7U6sOI-0 4.2. 入力 変数名、説明、バリデーションは、帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 「制限」に「必須」とある場合に入力がない場合のエラーメッセージは統一して「{項目名}を入力してください」とする。 4.2.1. 移管元 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 &nbsp; URLパラメータ 移管元の企業を一意に指定する。 必須 入力がない、または、自然数ではない、または指定IDのレコードがデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 2 教室グループ 入力フォーム 選択肢の表示形式は「[教室グループID]_[教室グループ名]」とする。 初期値はなし。 指定された企業に紐づく教室グループを選択肢とするセレクトボックスで単一選択。 該当レコードが存在しない場合「該当する教室グループが存在しません」と表示する。 必須 存在しない教室グループ（削除済み等） 存在しない教室グループです。 3 教室 入力フォーム 初期値はなし。 指定された企業、および教室グループに紐づく教室を選択肢とするセレクトボックスで単一選択。 該当レコードが存在しない場合「該当する教室が存在しません」と表示する。 必須 存在しない教室（削除済み等） 存在しない教室です。 4.2.2. 移管先 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 企業番号 &nbsp; 入力フォーム 選択肢の表示形式は「[企業コード]_[企業名]」とする。 初期値はなし。 コンボボックスによる単一選択。 121-2_【FIX】企業検索API を使い、テキストエリアに入力された文字列との中間一致で検索して抽出した企業を選択肢として表示し、表示された選択肢から選択することで「企業番号」が入力される。 必須 存在しない企業（削除済み等） 存在しない企業です。 2 サービス種別 入力フォーム 「ステーション」「キャリア」から選択できる。 必須 3 教室グループ 入力フォーム 選択肢の表示形式は「[教室グループID]_[教室グループ名]」とする。 初期値はなし。 指定された企業、およびサービス種別に紐づく、すべての教室グループを選択肢として、セレクトボックスによる単一選択。 該当レコードが存在しない場合「該当する教室グループが存在しません」と表示する。 存在しない教室グループ（削除済み等） 存在しない教室グループです。 4 教室 入力フォーム 初期値はなし。 指定された企業、および教室グループに紐づく教室を選択肢とするセレクトボックスで単一選択。 該当レコードが存在しない場合「該当する教室が存在しません」と表示する。 存在しない教室（削除済み等） 存在しない教室です。 5 求人 入力フォーム 初期値はなし。 指定された教室も紐づく求人を選択肢とするセレクトボックスで単一選択。 該当レコードが存在しない場合「該当する求人が存在しません」と表示する。 存在しない求人（削除済み等） 存在しない求人です。 4.2.3. 移管対象 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 応募番号 &nbsp; 入力フォーム 移管対象の応募レコードを指定する。 必須 4.3. 出力 説明は、帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 応募一覧表示 出力項目 出力先 説明 1 応募番号 画面 2 応募者氏名 画面 3 会員ID 画面 4 採用ステータス 画面 5 採用確認完了 画面 4.3.2. 移管処理 - 応募 出力項目 出力先 説明 1 求人番号 データベース 移管先の求人の求人番号を保存する。 2 成果報酬商品番号 データベース 移管先の求人に紐づく成果報酬商品番号を保存する。 3 請求書明細番号 データベース 応募課金の場合 移管先の求人において、応募日（ 【FIX】応募情報 の作成日）が含まれる月の応募課金の請求明細の番号を保存する。 採用課金の場合 移管先の求人において、応募情報の請求確定日が含まれる月の採用課金の請求明細の番号を保存する。 4 更新者 データベース 【作成中】帳票共通項目 の定義に従う。 5 更新日時 データベース 【作成中】帳票共通項目 の定義に従う。 4.4. 処理 4.5. エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 移管処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {全体管理者のユーザー番号} transferred application. application_number={応募番号} company_number={企業番号} brand_number={教室グループ番号} classroom_number={教室番号} job_number={求人番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {全体管理者のユーザー番号} failed to transfer application. application_number={応募番号} company_number={企業番号} brand_number={教室グループ番号} classroom_number={教室番号} job_number={求人番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "704675888",
  "parentTitle": "120_【FIX】企業管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1488027653/FIX+215_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-17T09:35:33.660Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の紐付け先求人を変更するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 本画面へは https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/740163745/125_+FIX?..."
}