{
  "id": "1496580115",
  "title": "2025-06-04 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 e45d7a5e-b363-4571-acb2-234033e1925f incomplete 来週の定例で改善前の1日あたりのスロークエリの数と改善後の1日あたりのスロークエリの数の結果の共有 17 15307e1a-edb6-4380-807e-90fc4f7c96bb incomplete 定例内でご共有 18 bfb99d3e-1e33-4e1d-a189-c22b8ad1ba23 incomplete 管理画面/スタッフ側のスロークエリ上位（イベント比率）を来週のMTGを来週のMTGで共有する 19 2ef47c47-afa0-4c43-9385-5349800ed9ed incomplete 定例内でご共有 20 ccfcfc78-9c6a-4aa9-abcc-fba8fbe05dc3 complete 通知の自動化についての実行方法検討（トモノカイ様側で作成いただいているものと弊社で作成したステータストリガーのものがトモノカイ様内部での通知も踏まえてどちらが良いか再考する） 21 ab36c051-e59e-4f3a-b618-407a42c63fb6 incomplete 運用方法はslackにて決定し運用中 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 木曜日に本番反映予定のチケット CTJ-5219 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 確認：口コミ自体は10,000文字まで登録できる仕様です。サービスサイト上の表示を今回の改修で登録されている文字列全てする形ですが認識違いありませんでしょうか？ 問題なしで本番反映する CTJ-5215 0f376871-0459-35fc-b139-2a34c915ec22 System Jira そのほか 改善前の1日あたりのスロークエリの数と改善後の1日あたりのスロークエリの数の比較（GIG小竹） 現在のスロークエリの閾値：1.0秒（下記の数は実行時間が1.0秒以上かかっているクエリの総数） 求人検索のクエリ改善によるスロークエリの総数の変化はないように見える ただ、読み込んでいる行数は確実に削減しています（280,531行から160,617行に削減 ） 日 月 火 水 木 金 土 18日 8,421 19日 5,890 20日 7,648 21日 6,824 22日 16,298 23日 9,841 24日 18,612 25日 38,190 26日 32,007 27日 9,365 28日 3,212 29日 8,054 30日 5,595 31日 2,972 6/1 10,616 2日 9,610 3日 サーバー費用抑制のために台数を減らせる目処は立てられそうか。（池田様） &rarr;現状も、アクセス影響は無いもののオートスケールは時々発生している状態。スロークエリ対策がある程度完了した時に、オートスケールの発生頻度が低ければ台数削減できると考えている。スロークエリの対策状況と合わせて状況をウォッチしていく。 &rarr;サーバ台数削減目処を把握するため、月初の定例でオートスケール発生状況を確認する。 管理画面/スタッフ側のスロークエリ上位（※1回あたりの実行時間が比較的長いかつ叩かれる頻度が多いもの）のご共有（GIG小竹） 前提：DBサーバの負荷軽減およびUX改善（クエリ実行から表示されるまではクエリ単体の問題だけでなく表示する処理の改善も併せて必要になりまう） 下記のどれか1つを対象として6月に取り組めたらと考えております。 管理画面側 アドミン/クライアント：パーソナルオファーの対象を絞り込み検索するクエリ ^&gt;6月はこちら アドミン：企業別採用確認一覧を出すためのクエリ アドミン：採用確認一覧を出すためのクエリ サービスサイト側 CTJ-3881 0f376871-0459-35fc-b139-2a34c915ec22 System Jira CTJ-4356 0f376871-0459-35fc-b139-2a34c915ec22 System Jira これが治らないとサービスサイト上に口コミが表示できない。 データインポートから終わったら対応着手する。 CTJ-4517 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 6月対象のチケットについてのご共有（GIG小竹） 対象：6月の工数で対応し、6月中リリースを見込むチケット（ただし、要件や実装難易度によっては6月中に完了しない場合もある） 現時点での6月中（ まで）にリリース見込みライン： 工数管理表の370行目まで 補足事項 以下のものは工数/工期の影響が大きい想定 インポート系のチケット（契約不適合扱い） 口コミ 5月より着手済み。6月も継続して対応中 お仕事QA 6月着手 機能の実装（ CTJ-4453 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） 昨日（6/3）に実行されたバッチ「 772_【FIX】（クライアント宛）請求書PDF発行通知バッチ 」のエラーメールが受信できない件について 進捗：現在原因調査中（送信処理自体は本当に成功していたか含めて） 影響範囲：特定のメール送信の場合に受信できない（バッチのログを見る限り送信処理は成功していそうではあります） 暫定対応 メール送信履歴で該当メールをアドミンのメール送信履歴から再送してみる バッチのエラーメールについてはアドミンのメール送信履歴から確認いただく（メール送信履歴上では確認できるため） b&rarr;dashとの連携について（GIG小竹/和田） トモノカイ様のやりたいことのヒアリングをして方針を決定したい やりたいことの確認 b&rarr;dashのAPIより定期的にメール配信数や開封率等のデータを取得し、塾ステーション側へ取り込みたい 取り込む先はDBの既存テーブルまたは新規テーブル？（保存先） データ取得のために叩くAPIの仕様について APIを叩く頻度（定期的ならバッチ処理） 取り込んだデータをどう塾ステーション側でどう使うか など お世話になっております。 雑多なご質問ですみません（必要そうであればJIRA化します）。 弊社で利用している「b&rarr;dash」というMAツールに、塾ステのデータをb&rarr;dashのAPIを使って取り込みたいと考えております。 b&rarr;dash側の担当者から、本番、検証環境のIPアドレスを教えて頂きたい、 と質問来ておりまして、こちらお分かりであれば教えて頂くこと可能でしょうか。。 https://support.smart-bdash.com/start_setting/13077 ※ちょっとあまりIPアドレスとして何を指しているのかが分かり切っていないので、 追加の確認がb&rarr;dash側に必要であれば併せてお教えいただきたいです &nbsp;アクション事項 15 15 incomplete サーバ台数削減目処を把握するため、月初の定例でオートスケール発生状況を報告・確認する 22 fb93b023-8dc2-4c1b-839f-e67d770decd5 incomplete メールの受信が失敗している理由の原因調査 &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED 次のスロークエリ対策対象は、①パーソナルオファー、②口コミ取得（データ再インポート完了後）の順で進める。 次のスロークエリ対策対象は、①パーソナルオファー、②口コミ取得（データ再インポート完了後）の順で進める。",
  "parentId": "668663828",
  "parentTitle": "議事録",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1496580115/2025-06-04",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-04T06:54:21.491Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、前橋様、原口様 GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 e45d7a5e-b363-4571-acb2-234033e1925f incomplete 来週の定例で改善前の1日あたりのスロークエリの数と改善後の1日あたりのスロ..."
}