{
  "id": "1532985345",
  "title": "2025-07-30 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、鈴木様、原口様、佐久間さま GIG： 資料 工数管理表 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 b11ae770-2fdc-4d36-a624-1972cd5269ee incomplete 再発防止策（ 2025-07-16-事象報告書 ）の導入を進める 18 2c3e45a2-fb30-4000-9582-9aab5831c39e incomplete 新たなブランチ運用の導入以外は対応済みになります 19 38c10fbd-fc9b-4f06-bf20-8c745b9bb0f8 complete コンフリクトの発生頻度そのものを減らす（予防） 17 46c004e1-fa0f-4f83-940c-9f8a7522da84 complete 影響画面／機能の明示 20 fe7c02c5-aa0c-4780-8d3e-36830d958ed6 complete 新規のカスタムフィールドとして影響画面/機能を設け、見積もり時に登録するように工数管理表のK列にて同じ機能のチケットがないか確認できるようにした 21 1ac5d2f5-dd5d-4a96-9946-4cd709f951ca complete 作業予定のファイルの一覧化 22 f3844168-73b8-4e34-ae67-967398b8f09d complete 新規のカスタムフィールドとして影響ファイルを設け、実装者間で連携を取りやすくした 23 4e765e6b-8d08-4b3a-8192-26b87f9eabaf complete 調整ルールの導入 24 a76317c2-c24b-4a11-af5d-8953ee121c07 complete 今後同じ機能/画面のチケットがその月の対象として実施予定（見積もり対象）の場合にまとめて実施または1つずつ開発/リリースのどちらかを着手前にトモノカイ様にご相談いたします 25 644574af-54ac-46b6-8523-ca6053ea02e7 incomplete コンフリクトが発生した場合の管理ルールの整備（対応） 26 0d0d76fa-588c-40c5-9360-d87ddd5dde92 complete 解消内容の明示 27 c5a6a3b6-d8b9-44b0-b86e-4aace1d95a8e complete コンフリクト解消のためのコミット内容のダブルチェック 28 4a6b9822-bc86-484c-9b30-f672498e75fc complete 意図しないマージ防止（テックリードなど実装者単独でのマージができないように確認/承認が必要とする仕組みに変更） 29 c77a172f-0786-4f96-9d44-17f30d0eb2cd incomplete ブランチ運用の見直し 30 aca3df8c-8671-4081-8901-d13b2b4073e5 incomplete Slackでご相談した内容で方針が決定できれば新たなブランチ運用の形で進行できればと思います 31 ec3c683f-57b6-41c3-8c2d-f1ec1d169997 complete そのチケットの改修により影響を受けうるページを網羅的にテストする（検知） 32 d407c6af-f151-404c-8983-d7891515f9a7 complete 影響URLの洗い出し 33 6308f29c-02c5-41ef-8ca2-6ca943c5cb9d complete 新規のカスタムフィールドとして影響URLを設け、影響範囲のあるURLを書き出すようにした 34 2cde9e18-056a-4f3a-839c-422f9747fefe complete テスト対象の明確化 35 5cc00b4c-dd8d-4b9b-bc2e-4cb2e761e43e complete 影響URLに記載のページについてテストをするようにした 進捗確認 dev環境で弊社確認中のチケット：工数管理表で緑色の背景になっているチケット 木曜日に反映予定のチケット そのほか 2025-07-28-塾ステーション_誤ったデータ更新に伴う経緯報告 のご説明（GIG小竹） 改善策は全てのチケットが対象か。（片岡様） &rarr;全てが対象。（小竹） 印象として、直近で本件以外もミスが大きい印象。全体的に体制など見直し検討してほしい。（池田様） ブランチ運用の変更方針についてのご相談（GIG小竹） ■概要 開発環境でトモノカイ様検証OKとなったチケットをmain（以前はSTG環境が見ていたブランチ）にマージする際にコンフリクトが発生した場合、その解消内容を検証できる環境が現状存在しない（現状はSTGを停止している）ため、その確認手段を確保する方針をトモノカイ様とご相談のうえ決定したいと考えております。 ■現状の課題 開発環境で検証済みのチケットをmainにマージする際、 コンフリクトが発生するケース があります。 現在は、 mainへマージ後の状態を確認できる環境が存在しないため、コンフリクト解消の誤りを本番反映前に検知することができません 。 以前「STGがあっても防げない」とお伝えしていた件については、誤りでした。正しくは、 STG環境があれば、mainブランチの状態（＝コンフリクト解消後）を確認可能であり、リスク軽減につながります。 ■ 対応案の整理（以下2つの選択肢が想定されます。） 案1：STG環境の復活（mainブランチを参照） メリット： mainブランチにマージされた状態を いつでも確認できる コンフリクト解消後の状態を 事前に検証可能 デメリット： インフラコストが増加する 案2：リリース用ブランチの新設＋デプロイフロー調整 概要 リリース前にmainとは別の「リリースブランチ」を作成し、 開発環境に一時的に切り替えて検証 開発環境で「リリースブランチ」を参照してデプロイできるよう 仕組みを追加する必要あり メリット ： インフラコストの増加なし デメリット ： 開発環境で、devlopブランチとリリースブランチの どちらか一方しか検証できない タイミングによって検証に 支障が出る可能性あり ※このデメリットは、「mainにマージ時にコンフリクトが発生した場合 のみ 、開発環境をリリースブランチに切り替える」運用にすることで、 軽減可能です ■補足 通常（コンフリクトがない場合）は、現行の開発環境での検証&rarr;mainマージ&rarr;本番反映というフローで問題ありません。 リスクが顕在化するのは、 mainマージ時にコンフリクトが発生した場合のみ です。 ■次のアクション 上記2案を踏まえ、 トモノカイ様のご意向やコスト・運用負荷を考慮しつつ、どちらの対応を取るかを相談・決定 できればと思います。 コメント 例えば求人詳細ページを別の実装者が並行して対応してコンフリクトが発生したとしたら、どの時にブランチを分ける意図か。（池田様） 開発環境の中から、一部の改修を抜粋して本番反映に向けたブランチ（main）へ反映する時。（小竹） 案２が良い。（池田様） CTJ-5351 0f376871-0459-35fc-b139-2a34c915ec22 System Jira に関連した2つの残課題（a，b）についての説明（GIG小竹） CTJ-5353 0f376871-0459-35fc-b139-2a34c915ec22 System Jira こちら原因および対応方針のご説明をさせていただき修正方針および工数管理表における対応優先度を調整させていただければと考えております。 コメント 重複したリストは確認したい。一律古い方を参照する方針で良いか確認するため。（佐久間様） コピー機能にて必須項目を空の形で上書きした場合には必須項目の値が空でも掲載状態のままになる件（コピー機能の更新時の処理の修正が必要） 具体例： 教室Aの必須項目の値が空 教室Bの必須項目に値が入っているかつ掲載状態 教室Aの必須項目の内容を教室Bにコピーした場合に 必須項目の値が空になるが掲載状態は変わらず掲載状態のまま これは、コピー機能の仕様上起こり得る挙動になります。コピーした箇所のみ更新する仕様について再度精査し、教室の掲載状態/公開状態、求人の掲載状態をどうするかを決める必要がございます。 対応する場合はお手数ですがチケット起票および工数管理表に記載をお願いいたします。 &rarr;対応してほしいのでチケット起票する。（佐久間様） &nbsp;アクション事項 15 15 incomplete ブランチ運用の対応 36 149e3120-7fdb-4e75-a657-ffb6528c3324 incomplete 7月分のスケールアウトのレポート作成（ のMTGにて共有） 37 174c1dff-da96-4149-9faa-43378a709295 incomplete 全体的に体制など見直し検討 38 3302a327-3e79-49cb-b1d9-93bdcb267326 incomplete CTJ-5353 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 重複したリストと対応方針についてのご確認 （佐久間さま） 39 dd60df4c-4b63-4d29-94bd-506ce1c681ea incomplete こちら の内容 （コピー機能の仕様の変更）の起票および工数管理表に記載 （佐久間さま） &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED ブランチ運用の改善案は案２（リリース用ブランチの新設＋デプロイフロー調整）で進める。 ブランチ運用の改善案は案２（リリース用ブランチの新設＋デプロイフロー調整）で進める。",
  "parentId": "668663828",
  "parentTitle": "議事録",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1532985345/2025-07-30",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-31T06:46:11.409Z",
  "author": "kotake_jin",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：池田様( )、片岡様（ ）、鈴木様、原口様、佐久間さま GIG： 資料 工数管理表 タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 前回のネクストアクションの確認 16 b11ae770-2fdc-4d36-a624-1972cd5269ee incomplete 再発防止策（ 2025-07-16-事象報告書 ）の導入を進める..."
}