{
  "id": "1598881803",
  "title": "2025-07-16-事象報告書",
  "content": "背景 今回2 件の先祖返り（Git において過去のコミット内容が意図せず復活する現象）が発生しました。本資料では、各事象の詳細・原因・影響範囲を整理し、再発防止策を提示します。 1 件目：CSS 修正の消失（2025-06-26） 事象概要 発生日 ：2025-06-26 関連チケット ： CTJ-5245 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 環境 ：DEV環境 内容 ：本番反映済みの CSS 修正が、develop ブランチをproduction ブランチとリベースした際に、該当の CSS 修正が消失 タイムライン 時刻 (JST) 内容 6月20日 10:16 該当チケットをSTG環境に反映 6月24日 11:59 該当チケットを本番環境に反映 6月26日 14:00 本番反映後のリベース作業後にコンフリクト発生 6/26に本番環境へ反映を行った後、別の開発作業中にリベースを行った際、 本来であれば&ldquo;本番のコード&rdquo;を正として取り込む必要があったのですが、それができておらず、一部のCSS修正がDEV環境から消失していた。 6月27日 18:07 DEV環境にて不具合を検知（池田さんのご連絡により発覚） 6月30日 14:34 現在は取り込む必要があったCSSをDEVに反映済み 原因 コンフリクト（修正内容のぶつかり）が起きた際に、コンフリクト解消手順が個人依存であり、ペアチェックやレビュープロセスがなかったため 影響範囲 対象ファイル： resources/assets/user/sass/src/pages/search/_search-job.scss 本番環境には影響なし（DEV のみ） 2 件目：Job タイトルの先祖返り（2024-06-18） 事象概要 発生日 ：2024-06-18 関連チケット ： CTJ-3083 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 環境 ：DEV 環境、本番環境 内容 ：Job 詳細ページのタイトル表示修正が、バグ対応時のマージで上書きされ、STG／PROD で先祖返り。（ の本番反映にて先祖返り部分の修正反映実施予定） タイムライン 時刻 (JST) 内容 2024年6月11日 10:03 CTJ-3083 を本番反映 2024年6月18日 14:38 開発チームが別バグを発見し修正したものをSTG環境に反映 別バグを対応した際に、CTJ-3083の部分のコードを誤って削除 2024年6月18日 CTJ-3083の部分のコードを誤って削除状態でSTGから本番へ反映（先祖返り発生） 2025年7月1日 本番環境にて不具合を検知（池田さんのご連絡により発覚） 原因 コードレビュー時にCTJ-3083の反映内容を考慮せずレビュー実施したため 開発チームのテスト時に、PC版のみを確認し、SP版を確認しないことによる確認不足 開発チームが発見した別バグについて対応をしたことを踏まえて該当箇所の再テストをGIG側への共有がなかったこと（もしあれば気付けた可能性あり） 影響範囲 Job 詳細ページタイトルが旧仕様で表示 再発防止策（Before &rarr; After） Before（現状の課題） 編集ファイルの共有や調整が不十分で、同一ファイル編集の 同時進行が発生 本番反映後、開発チーム側で本番環境と開発環境との差分解消のために リベースを手動実施 実装者が 単独でコンフリクトの判断・解消 を行っていた コードレビュー時に修正内容の整合性チェックがなされていなかった QA チームへ「コンフリクトが発生した事実」が共有されていなかった &rarr; 上記の課題は、マージのミスがしやすい（コンフリクトが起きやすい）環境になっていることおよびコンフリクトが発生した時の対応ルールが存在していないことが起因しているためその整備を再発防止策として実施する After（改善策） ① コンフリクトの発生頻度そのものを減らす（予防） 項目 対応内容 影響画面／機能の明示 PMが要件定義着手前に影響範囲のある機能を確認し、着手順の判断に使用し、後述の調整ルールに基づきトモノカイ様と着手順について相談させていただきます。 &rarr; これにより同一ファイルの同時編集を 要件定義着手前に 予防をいたします 作業予定のファイルの一覧化 実装者が要件定義確定後（実装着手前）に作業予定のファイルをチケットに一覧として書き出し、後述の調整ルールに基づきトモノカイ様と着手順について相談させていただきます。 &rarr; これにより同一ファイルの同時編集を 実装前に 予防をいたします 調整ルールの導入 同一ファイルの編集するチケットが複数がある場合、下記のいずれかで進行する 優先度が高いチケットから着手（並行で進めない）※このチケットが本番反映されるまでは他のチケットは実装着手しない 同じ箇所の改修であれば優先度に関わらず複数のチケットをまとめて着手する ② コンフリクトが発生した場合の管理ルールを整備（対応） 項目 対応内容 解消内容の明示 コンフリクトを含むマージコミットには、何をどう解消したかを明記 （必須） コンフリクト解消のためのコミット内容のダブルチェック 実装者独自で判断ではなく、実装者以外も確認を行うペア承認 を必須化 意図しないマージ防止 巻き戻りリスクがある場合、 リードエンジニアまたはPMが確認・承認 してからマージを実行 ブランチ運用の見直し コンフリクトが発生したとしても先祖返りが起きにくい運用に変更いたします。 詳細については開発チームと検討中ですので導入開始時期は未定です。 ③そのチケットの改修により影響を受けうるページを網羅的にテストする（検知） 項目 対応内容 影響URLの洗い出し 実装者が変更を加えたファイル・ロジックの影響範囲を明示的に洗い出し、影響URL一覧としてチケットに記載します。 &rarr; これによりテスト漏れを防止します テスト対象の明確化 上記URL一覧に基づき、該当箇所が網羅的にテスト対象に含まれるようにテスト観点を整備します。 今後の対応 再発防止策の運用開始（運用開始できるものから順次対応してまいります） 過去に本番へ反映済みの改修内容についても、他に反映漏れ（先祖返り）がないかを調査 ■ 調査方針 調査対象の期間 2025年4月〜2025年6月の3ヶ月間を対象とさせていただきます。 調査対象のページ・機能（重要度の高い箇所に限定） 過去3ヶ月でファイルの編集をした箇所があるページ・機能 調査方法（開発チームと調査のやり方を議論中） Bitbucketのコミット履歴を見てブランチが数多くあり、ブランチの合流の状態が怪しい箇所を順に確認する",
  "parentId": "1371963553",
  "parentTitle": "障害/インシデント/経緯報告",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1598881803/2025-07-16-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-16T04:40:40.235Z",
  "author": "kotake_jin",
  "excerpt": "背景 今回2 件の先祖返り（Git において過去のコミット内容が意図せず復活する現象）が発生しました。本資料では、各事象の詳細・原因・影響範囲を整理し、再発防止策を提示します。 1 件目：CSS 修正の消失（2025-06-26） 事象概要 発生日 ：2025-06-26 関連チケット ： CTJ-5245 0f376871-0459-35fc-b139-2a34c915ec22 System J..."
}