{
  "id": "1602289665",
  "title": "2025-07-28-塾ステーション_誤ったデータ更新に伴う経緯報告",
  "content": "2025年7月28日 株式会社トモノカイ 御中 このたび、 CTJ-4377 0f376871-0459-35fc-b139-2a34c915ec22 System Jira において実装者の改修内容の解釈ミスにより、一部レコードが誤った情報で書き込まれていました。 以下に、詳細および対応状況についてご報告申し上げます。 発生事象 内容 CTJ-4377 にて、追加修正依頼のバナー管理画面のタイトル更新にて発生 CTJ-4377 の追加修正依頼の内容は、バナー管理画面のタイトル更新（赤枠）を指していたが、画像タイトルの更新（青枠）まで行なってしまった 期間 2025年7月15日 12:10:34（本番反映枠での反映時） 対象テーブル バナー情報（banners） 影響範囲 banners テーブルの banner_type カラムの値が 51, 104, 2, 45, 43, 105, 100, 102, 101, 103, 17 のいずれかであるすべてのレコードが対象 経緯 2025年6月30日 ディレクターから CTJ-4377 の https://docs.google.com/spreadsheets/d/16DeJLXE-7OWZ2I4EqB3HPaTzg4wIJdBxKXwrrgoYWIg/edit?gid=0#gid=0 の改修を開発チームに依頼 2025年7月3日 開発チームがチケットCTJ-4377を着手 ※開発チーム責任者が実装者に改修内容を依頼 2025年7月4日 実装者が実装（バナー管理画面に表示されるバナータイトルを更新だけではなく、バナー画像のタイトルも更新） 7月8日から7月14日 開発チームが開発環境にて検証後に、開発チーム責任者がディレクターに検証依頼 ※ディレクター検証時に開発チーム責任者からディレクターに対してバナー画像のタイトルを変更したことを伝達できていなかった ディレクターが開発環境にて検証 7月15日 12:18 CTJ-4377 を本番環境に反映（ここで書き換える必要のないレコードに対して書き換えが発生） 7月15日 13:53 トモノカイ様がバグを検知 7月15日 14:48 本番環境で CTJ-4377 の内容をリバート ※リバートの対象はアプリケーションのコードのみ ※eの時点で実行した本番環境のDBの該当のレコードのタイトルの書き換えはそのままの状態 原因 実装者による改修内容の解釈ミス バナー管理画面のタイトル更新指示を、画像タイトルの更新まで含むと誤解 開発チーム責任者による確認の不備 当初の要望通りに実装され、正しくテストされているかのレビューが不十分 ディレクターによる影響範囲の確認漏れ 表示されるUI要素の更新だけでなく、影響を受ける可能性のある他項目の確認を行わなかった 再発防止策 開発チーム責任者によるスクリーンショット付きの仕様確認 要件が曖昧・抽象的であると判断される場合には、開発チーム責任者は対象画面のスクリーンショットを添付し、「どの要素が・どのように・どの状態で変更されるのか」を視覚的・言語的に明記し実装者に依頼します。 開発チーム責任者による受入れテストの強化 実装完了後、開発チーム責任者はチケット内容だけでなく、当初の要求通りに実現されているかを改めて確認することを必須とします。 UI変更・データ更新を含むタスクについては、特に副作用や関連部分への影響がないかの観点も加味して確認を行います。 ディレクターによる影響範囲の確認 ディレクターは、要件確認時およびリリース前のテスト段階において、変更内容に付随する影響範囲（関連UIやデータ）から不要な修正がないかを開発チームと認識を合わせ、確認を行います。 本番環境データに関わる作業の事前承認プロセス 本番環境のデータ追加・修正を伴う可能性がある作業については、トモノカイ様の承認を事前に取得しなければ実施できない運用ルールとします。緊急性を除き、書面またはチケット上での合意履歴を残すことを義務化します。 このたびは関係者の皆様に多大なご迷惑をおかけしましたこと、深くお詫び申し上げます。 本件を厳粛に受け止め、再発防止に向けて速やかに社内の体制・手順を強化し、信頼回復に努めてまいります。 株式会社 GIG 石倉 彰悟",
  "parentId": "1371963553",
  "parentTitle": "障害/インシデント/経緯報告",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1602289665/2025-07-28-+_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-28T04:44:25.483Z",
  "author": "kotake_jin",
  "excerpt": "2025年7月28日 株式会社トモノカイ 御中 このたび、 CTJ-4377 0f376871-0459-35fc-b139-2a34c915ec22 System Jira において実装者の改修内容の解釈ミスにより、一部レコードが誤った情報で書き込まれていました。 以下に、詳細および対応状況についてご報告申し上げます。 発生事象 内容 CTJ-4377 にて、追加修正依頼のバナー管理画面のタイト..."
}