{
  "id": "1682472977",
  "title": "【作成中】184-2_急募部分取り下げ機能",
  "content": "1. 1. 目次 2. 概要 本機能は急募契約（ 【FIX】契約情報（統合版） ） の登録済みのデータ1件において、一部の求人分のみ無効にするための機能です。 ※厳密には元の急募契約は無効にして、取り下げ対象の求人以外の残った求人を対象とした新たな急募契約を作成します。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが本機能を利用することができる。 急募一覧画面（ 181_【FIX】急募一覧閲覧機能 ）にて一部取り下げボタンを押下することで本機能に遷移する。 ただし、対象の急募がまとめ買い急募商品の場合は、取り下げ不可のメッセージを表示して、元の画面に戻る。 画面に表示する項目はWFの通りとし、特筆すべき項目のみここで記載する。 キャンセルボタン 押下すると、取り下げ処理は行わず急募一覧画面（ 181_【FIX】急募一覧閲覧機能 ）に遷移する。 対象の急募情報 編集対象の急募情報を表示する。 表示内容の値の定義は 181_【FIX】急募一覧閲覧機能 と同様とする。 取り下げ求人選択選択フォーム 対象の急募に紐づいている求人を一覧で表示する。 チェックボックスで複数選択可能とする。 （全求人の取り下げは https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/718438619/184_+FIX?atlOrigin=eyJpIjoiYjhlNGQ2ODY3OGU1NDk2N2I2MDk4ZTc2YjQ5ZGNmOTYiLCJwIjoiYyJ9 で行う様にするため）ここではすべての求人は選択できないものとする。 表示中の求人数-1個の求人を選択した時点で、残る求人のチェックボックスは非活性とする。 取り下げるボタン 押下すると、ユーザーへの実行確認モーダルが表示される。 モーダルには確認メッセージ「選択した急募を取り下げてよろしいですか？」を表示する。 取り下げるボタンを押下すると、後述の処理を行い、 181_【FIX】急募一覧閲覧機能 へ遷移して無効化が完了したことがわかるメッセージ「対象の急募を取り下げました」を表示する。 キャンセルボタンを押下すると無効化は行わず、モーダルを閉じる。 取り下げボタン押下時の処理は下記の通りとする。（参考として、レコード更新の具体例を 【作成中】急募部分取り下げ具体例 に示す。） 以下の通り、契約情報を更新する。 対象の契約（元契約）（ 【FIX】契約情報（統合版） ） 下記の通りの値を設定して契約を無効化する。 「無効化日時」：現在日時 「無効化実行者」：操作を実行した管理者 新契約（ 【FIX】契約情報（統合版） ） 下記の通りの値を設定した新契約を作成する。 「対象商品：商品番号」：元契約に紐づく商品と同じ商品の商品番号 該当商品の公開フラグ・購入可フラグの状態は問わない。 「対象商品：数量」：元の急募求人数から取り下げ対象の急募求人数を除いた、残りの急募求人数。 「前契約」：元契約 「有効期間：開始日時」： 現在日時、または、元契約の「有効期間：開始日時」のうち、遅い方の日時 「有効期間：終了日時」： 元契約の「有効期間：終了日時」と同じ日時 急募情報（ 【FIX】急募オプション申込付帯情報 ） 取り下げ対象の急募求人 下記の通りの値を設定して無効化する。 「削除日時」：現在日時 取り下げ対象ではない急募求人 下記の通りの値を設定して紐付け先の契約を切り替える。 「契約番号」：新しく作成した契約の契約番号 以下の通り、取り下げ分の精算のための請求作成を行う。 請求基本情報（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/681738361?atlOrigin=eyJpIjoiOTAxYTIzODVkNjRkNGNjNjkwNjgyYzdlM2FhZjY5MjgiLCJwIjoiYyJ9 ） 下記条件を満たす請求基本情報（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/681738361?atlOrigin=eyJpIjoiOTAxYTIzODVkNjRkNGNjNjkwNjgyYzdlM2FhZjY5MjgiLCJwIjoiYyJ9 ）が既に存在する場合は作成しない。 企業：元契約と同じ 請求先・振込先マスタ：元契約と同じ 請求月：現在月、または、元契約の開始月のうち、遅い方の月 存在しない場合は、新規作成する。 新規作成時に請求基本情報（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/681738361?atlOrigin=eyJpIjoiOTAxYTIzODVkNjRkNGNjNjkwNjgyYzdlM2FhZjY5MjgiLCJwIjoiYyJ9 ）に設定する値は、特に指定がない項目は 185_【FIX】急募新規登録機能 と同様とする。 新規請求明細（ 【FIX】請求：請求明細 ） 下記の通りの値を設定した新請求明細を作成する。 「請求番号」：上記で既に存在する、または、新規作成した請求基本情報を指定する。 「商品番号」：元契約と同じ商品 「契約番号」： 元契約 「請求項目名」：「 急募取り下げによる払い戻し分 」 「単価」：「商品番号」にて指定した商品の単価をマイナスにした値 「数量」：「取り下げ対象の急募求人数」&times;「残り月数」で算出される値 ただし、残り月数は、端数を切り上げて整数とする。（例：残り1.4ヶ月（1ヶ月と12日）の場合、2ヶ月とする） 無効化に成功または失敗した場合、以下の情報が入ったログを出力する。 日時、部分取り下げを実行した全体管理者のユーザー番号、元契約の契約番号、新契約の契約番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 要求に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オプション申込・登録・解除フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=225759-27823&amp;t=PSnutg3h1XdLiYmt-0 4.2. 入力 ★追って記載 4.3. 出力 ★追って記載 4.4. 処理 4.5. エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 急募一部取り下げ画面に遷移した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} started to update urgent job contract. contract_number={契約番号} company_number={企業番号} brand_number={教室グループ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 無効化処理を実行した場合、 114_【FIX】契約編集機能 の無効化時と同じフォーマットでログを出力する。 急募契約を新規作成した場合、 185_【FIX】急募新規登録機能 の新規作成時と同じフォーマットでログを出力する。 5. スコープ外・制限事項 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "718438619",
  "parentTitle": "184_【FIX】急募取り下げ機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/1682472977/184-2_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-01T03:10:23.260Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 1. 目次 2. 概要 本機能は急募契約（ 【FIX】契約情報（統合版） ） の登録済みのデータ1件において、一部の求人分のみ無効にするための機能です。 ※厳密には元の急募契約は無効にして、取り下げ対象の求人以外の残った求人を対象とした新たな急募契約を作成します。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾ステーション管理者のみが本機能を利用することができる。 急募..."
}