{
  "id": "666927116",
  "title": "ワード・ディフィニション",
  "content": "本プロジェクトにおける単語の共通認識のための単語を定義します。業界用語・特殊用語・解釈の幅が大きい単語は、共通認識を持てるようにここに追記して管理します。 分類 用語 意味&nbsp; 1 システム サービスサイト WWWに公開し エンドユーザー （個人）にサービスを提供するためのWebサイトとその機能全体を指します。 2 本サイト サービスサイト を指します。 3 本システム サービスサイト 、 全体管理画面 、 クライアント企業向け管理画面 とそれらを稼働させるためのシステム全体を指します。ただし、今回制作対象外の外部システムは除きます。 4 旧システム 本システム の機能に相当する、リニューアル前のシステムを指します。 5 ステーション サービスサイト の内、アルバイト採用目的の求人を扱うページ群を指す「塾講師ステーション」の略称。 ※正社員用の「塾講師ステーションキャリア」を表す略称である「 キャリア 」と対比する言葉として使われることが多い。 6 キャリア サービスサイト の内、正社員採用目的の求人を扱うページ群を指す「塾講師ステーションキャリア」の略称。 ※アルバイト用の「塾講師ステーション」を表す略称である「 ステーション 」と対比する言葉として使われることが多い。 7 サービス種別 8 ファイルメーカー 本システム が連携する外部システムの内、本システムまたはサイト運営者が利用するためのデータを生成するために、 本システム からデータを取得・集計・保管するシステムを指します。 9 全体管理画面 サービスサイト 運用に当たって必要な運用管理オペレーションを行うための閉じた環境に構築するWebアプリケーションを指します。 10 クライアント企業(向け)管理画面 サービスサイト に掲載する 求人情報 を クライアント企業 がログインして管理するためのWebアプリケーションを指します。 11 人・組織 全体管理者 全体管理画面 にログインし、 本サイト の運用・管理を行うことができる個人を指します。 12 サイト運営者 本サイト の運営主体である法人又は団体及びそのスタッフを指します。（ 全体管理者 であるかどうかを問わない） 13 クライアント企業管理者 本サイト に 求人情報 を掲載する顧客として契約締結が完了し、 クライアント企業向け管理画面 にログインして利用できる法人又は団体及びそのスタッフを指します。 14 クライアント企業 本サイト に 求人情報 を掲載する顧客として契約締結が完了する前、および、締結完了後の法人又は団体及びそのスタッフを指します。（ クライアント企業管理者 であるかどうかを問わない） 15 エンドユーザー サービスサイト にアクセスする個人のユーザー全てを指します。 16 会員 エンドユーザー の中で、サービス利用登録（サインアップ）を行い、ログイン認証を経て サービスサイト を利用する個人を指します。 17 記事担当者 全体管理画面 にログインし、記事原稿を執筆する人を指します。 18 記事管理者 全体管理画面 にログインし、記事の公開・非公開設定を行う人を指します。 19 ユーザー 本システム のすべての利用者を指します。 具体的には、 エンドユーザー、会員、全体管理者、クライアント企業向け管理者 をまとめて指します。 20 商品 商品 サイト運営者 が、 クライアント企業 から対価をもらって提供する機能・サービスの内、 本システム 内で価格を設定する最小単位を指します。ただし、価格が0円のものも含みます。 21 基本商品 商品 の内、 クライアント企業 が クライアント企業管理画面 にログインするために最低限購入が必要な商品を指します。 ただし、 課金形態商品 を購入しない限り、求人情報を掲載することはできないものとします。 22 課金形態商品 商品 の内、 クライアント企業 が 本サイト に求人情報を掲載するために 基本商品 と合わせて最低限購入が必要な商品を指します。 23 オプション 基本商品 および 課金形態商品 以外の 商品 、または、その 商品 を購入することで利用可能な、求人の掲載方法などを拡張する機能を指します。 24 急募オプション オプション の内、求人の検索結果画面での上位表示、近隣エリアの求人画面で表示されるようにするための オプション を指します。 25 オファー上限アップオプション オプション の内、 パーソナルオファー の月あたりのオファー上限数をアップさせるための オプション を指します。 26 その他オプション オプション の内、 急募オプション と キャリアオプション 以外を指します。 27 キャリアオプション オプション の内、 サービスサイト のキャリア向けページに商品を掲載するためのオプションを指します。 28 機能 オファー 希望条件に合う 会員 に対して、応募を促すために、通知を送る機能を指します。 オファー には、 パーソナルオファー と 自動オファー の2種類があります。 29 パーソナルオファー ※サービスサイトでは「スカウト」という名称で表記されます。 下記の特徴を持つ オファー を指します。 任意のタイミングで送付可能 1ヶ月あたりの送信可能数に制限がある 30 自動オファー ※サービスサイトでは「マッチ」という名称で表記されます。 下記の特徴を持つ オファー を指します。 本システムが定めたタイミングで送付可能 1ヶ月あたりの送信可能数に制限がない 31 公開 ※教室ページを指す場合のみ 対象の教室と配下の求人（いずれも掲載状態を前提とする）が、 サービスサイト 内の検索でヒットする状態を指します。 求人にはこのステータスは存在しません。 詳細は 015_【作成中】教室および求人の公開/掲載の条件 参照。 32 非公開 ※教室ページを指す場合のみ 対象の教室と配下の求人全て（掲載状態問わず）が、 サービスサイト 内の検索でヒットしない状態を指します。 ただし、掲載状態の教室及び求人のURLに直接アクセスを行えば閲覧を行うことが可能です。 求人にはこのステータスは存在しません。 詳細は 015_【作成中】教室および求人の公開/掲載の条件 参照。 33 掲載 ※教室・求人ページを指す場合のみ 対象の教室・求人ページが、 サービスサイト 上で閲覧できる状態を指します。 詳細は 015_【作成中】教室および求人の公開/掲載の条件 参照。 34 非掲載 ※教室・求人ページを指す場合のみ 対象の教室・求人ページが、 サービスサイト 上で閲覧できない状態を指します。検索にもヒットせず、教室・求人ページのURLに直接アクセスを行っても閲覧はできません。 なお、教室が非掲載の場合は配下の求人ページは掲載状態に関わらず、全て閲覧できない状態となります。 詳細は 015_【作成中】教室および求人の公開/掲載の条件 参照。 35 物理削除 システム内で扱うデータを物理的に削除し、 サービスサイト、全体管理画面、クライアント企業向け管理画面 からの操作、および、データベースへの直接操作を行っても該当データにアクセスできない状態にすることを指します。 36 論理削除 システム内で扱うデータを物理的には削除せずに、削除フラグ等を付与することによって、 サービスサイト、全体管理画面、クライアント企業向け管理画面 からの操作では該当データにアクセスできない状態にすることを指します。 ただし、データベースへの直接操作を行うことで、該当データへアクセスすることができます。 37 その他 基本契約 サイト運営者 と クライアント企業 の間で結ばれる契約の内、 本サイト に 求人情報 を掲載するために最低限必要な契約を指します。また、単に「契約」と表記した場合は、 基本契約 を指します。 38 群 全体管理者が、企業、 教室、求人 に設定する、格付け情報です。サービスサイトにおける、検索結果の表示ロジックなどに影響し、序列が高いものが優先的に表示されるなどの処理に利用されます。 ※クライアント企業からは認識されない（認識されてはいけない）情報です。 ※参考： CTJ-342 0f376871-0459-35fc-b139-2a34c915ec22 System Jira",
  "parentId": "666927105",
  "parentTitle": "■要件定義",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/666927116",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-08T05:00:04.014Z",
  "author": "ejiri_yusuke",
  "excerpt": "本プロジェクトにおける単語の共通認識のための単語を定義します。業界用語・特殊用語・解釈の幅が大きい単語は、共通認識を持てるようにここに追記して管理します。 分類 用語 意味&nbsp; 1 システム サービスサイト WWWに公開し エンドユーザー （個人）にサービスを提供するためのWebサイトとその機能全体を指します。 2 本サイト サービスサイト を指します。 3 本システム サービスサイト 、..."
}