{
  "id": "666927437",
  "title": "共通要件",
  "content": "1. 入力 各入力項目の登録規制は、各要求事項のページで別途指定がない限り、以下の通りとする。 1.1. 共通事項 文字列の扱いは以下の通りとする。 半角・全角のスペースの取り扱いは以下の通りとする。 文頭文末に全角・半角のスペースが入力された場合、保存時にトリミングを行う。 文中に全角・半角のスペースが入力された場合、保存時に半角スペースへの変換を行う。 改行文字の取り扱いは以下の通りとする。 文頭文末の改行文字は、保存時にトリミングを行う。 1行テキストで入力する項目について、文中の改行文字を含む場合は半角スペースへの変換を行う。 改行を許容する項目について、文中の改行文字は変換は行わない。 全角・半角カタカナの取り扱いは以下の通りとする。 保存時に全て全角への変換を行う。 検索時には区別しない。（例：ｴｰﾋﾞｰｼｰで検索したとき、エービーシーもｴｰﾋﾞｰｼｰも両方ヒットする） 全角・半角のアルファベットの取り扱いは以下の通りとする。 保存時に全て半角への変換を行う。 検索時には区別しない。（例：abcで検索したとき、ａｂｃもabcも両方ヒットする） 全角・半角が両方存在する記号の取り扱いは以下の通りとする。 登録時に 全て半角への変換を行う。 検索時には区別 しない 。（例：=で検索したとき、＝ も=も両方ヒットする ） アルファベットの大文字小文字の取り扱いは以下の通りとする。 登録時に相互の変換は行わない。 検索時には区別しない。（例：abcで検索したとき、ABCもabcも両方ヒットする） 全角・半角の数字の取り扱いは以下の通りとする。 保存時に全て半角への変換を行う。 検索時には区別しない。（例：123で検索したとき、１２３も123も両方ヒットする） バリデーションルールについてはLaravelのstringに準ずる https://laravel.com/docs/6.x/validation#rule-string 入力が必須の場合、特別に最小文字数の記載がない場合は全て 1文字以上 の制限とする。 文字数制限のエラーメッセージは下記の通りとする。 特定の文字数のみの場合：「[ラベル名]は[指定文字数]文字で入力してください」 1文字〜上限の場合：「[ラベル名]は[上限文字数]文字 以下 で入力してください」 1文字以外の下限〜上限の場合：「[ラベル名]は[下限文字数]〜[上限文字数]文字で入力してください」 文字種別によるエラーメッセージは下記の通りとする。 「[ラベル名]に使用できない文字種別が含まれています」 書式エラーのエラーメッセージは下記の通りとする。 「正しい[ラベル名]の書式で入力してください」 必須の入力項目が入力されていない場合のエラーメッセージは 「[ラベル名]の入力は必須です」 「[項目名]を入力してください」 と表示する。 ただし、必須の入力項目が下記の形式の場合は、それぞれ記載のとおりとする。 選択式の入力項目の場合のエラーメッセージは 「[ラベル名]は選択肢から選んで入力してください」と表示する。 入力可能な範囲が限定されている数値の入力項目で、範囲外の値が入力された場合のエラーメッセージは「[ラベル名]は[下限数値]〜[上限数値]の数字で入力してください」と表示する。 既存のデータと重複した値を入力できない入力項目で、重複した値を入力した場合のエラーメッセージは「[ラベル名]はすでに利用されています」と表示する。 POST/PUT/DELETEメソッドで処理が行われる機能（登録、更新、削除など）はすべて、csrfトークンの入力を必須とする。 画像のアップロードは以下の仕様とする。 アップロードを受け付けるファイル形式は以下の通り。 png, jpeg/jpg, svg, gif, webp, heic アップロードした画像は全てWebpに変換して保存する。 リサイズについて 1.2. 個別事項 氏名 128文字以下であること。 パスワード 使用可能な文字種は、半角英数字と一部の半角記号（以下）とする。 ! &quot; # $ % &amp; ' ( ) = ~ | - ^ @ [ ] : ; , . / ` { } + * &gt; ? _ 英大文字・英小文字・数字の3種を必ず含むこと。 7文字以上20文字以下 8文字以上50文字以下 であること。 メールアドレス 使用可能な文字種は、半角英数字と一部の半角記号とする。 128文字以下であること。 書式エラーについてはLaravel標準のバリデーションに準ずる。 携帯キャリアのメールアドレスは、AWSのメールサーバからだと届かないことがあるため動作保証は出来ないが、利用を制限はしない。 電話番号 使用可能な文字種は、全角・半角の数字のみとする。 ハイフンは許容しない。 15文字以下であること。 保存時に半角への変換を行う。 郵便番号 使用可能な文字種は、全半角数字のみとする。 ハイフンに関しては、フロントではハイフンを許容せず（フロントでバリデーションチェックを実装）、バックエンドではハイフンを許容する（パッケージを利用）ものとする。 7文字であること。 保存時に半角への変換を行う。 国 セレクトボックスでの選択式とする。 選択肢は 【統合により削除】国 にて定義の通りとし、IDの昇順で表示する。 都道府県 セレクトボックスでの選択式とする。 選択肢は 都道府県 にて定義の通りとし、IDの昇順で表示する。 市区町村 セレクトボックスでの選択式とする。 選択肢は 【市区町村マスタテーブル（テーブル名確認後記載）】 にて定義の通りとし、 ID の昇順で表示する。 町名・番地 128文字 以下であること。 全角英数字・全角記号の入力があった場合、保存時に半角に変換する。 建物名・部屋番号 128文字 以下であること。 全角英数字・全角記号の入力があった場合、保存時に半角に変換する。 現在の職業 セレクトボックスでの選択式とする。 選択肢は 現在の職業 にて定義の通りとし、IDの昇順で表示する。 時間 タイムピッカー（フレームワークの標準あるいはライブラリを想定）での選択式とする。 選択可能な単位（1分ごと、5分ごと等）は各機能の要件定義で決定する。 時分はそれぞれ昇順で表示する。 24時間表記とする。 年月日 デイトピッカー（フレームワークの標準あるいはライブラリを想定）での選択式とする。 単日選択か 期間選択 かは各機能の要件定義で決定する。 URL 使用可能な文字種は、半角英数字と一部の半角記号（以下）とする。 -_ 2. 表示 各表示内容は、各要求事項のページで別途指定がない限り、以下の通りとする。 submitボタン（登録・保存など）を押下した際に、不適切な入力値があった場合エラーを表示する。 パスワード入力欄には表示/非表示切り替えボタンを設け、押下ごとに表示が切り替わる。また、初期状態は非表示とする。 自由記述項目のプレースホルダーは、「[ラベル名]を入力してください」と表示する。 自由入力記述項目について、html/スクリプト/URL/emailは全ての文字列に対してエスケープして表示する。 セレクトボックスによる選択欄での選択は、初期状態では「▼選択してください」と表示し、未選択の状態とする。 各画面で一覧表示または検索を行なった際、表示するものがなかった場合は一覧を表示すべきスペースには何も表示しない。 各画面でデータのダウンロードを行う際、対象データが1件もなかった場合はダウンロードは実行されず、「データがありません」と表示されたダイアログを表示する。ダイアログには閉じるボタンを配置し、ボタンを押下するとダイアログを閉じる。 日付の表示はYYYY/MM/DDの形式とする。日時はYYYY/MM/DD hh:mm:ssの形式とする。 キャリアサイトで表示する教室名は、教室名の末尾に【キャリア求人】と追加して表示する。 ただし、カード型コンポーネントの場合は表示しない。 2.1. パンくずリスト サービスサイト・各管理画面でパンくずリストを表示する。 2.1.1. 管理画面 管理画面のパンくずリストは、特に指定がない限り、下の表で示した通りとする。 存在しないページは飛ばす。 親機能とは、グローバルメニューからアクセスでき、より上位の機能が無い機能を指す。 実際の表示名称は、各画面の名称とする。 TOP：◯◯管理画面TOP 一覧：◯◯一覧 新規作成：◯◯新規作成 詳細：◯◯詳細（{レコードID}） 編集：◯◯編集（{レコードID}） 現在ページはリンク無しとし、それ以外はリンクありとする。 最上位 間の階層 最下位 TOP 一覧（親機能） 詳細（親機能） 編集（親機能） - - - 現在ページ 一覧（子機能） 詳細（子機能） 編集（親機能） ・・ 一覧（孫機能） ・・ 新規作成（子機能） - - 新規作成（親機能） - - - - 一覧（親機能） 詳細（親機能） ・・ ・・ ・・ ・・ ： ： ： ： ： ： 例 全体管理画面TOP ＞ 企業一覧 ＞ 企業詳細（1234567） ＞ 企業編集（1234567） 全体管理画面TOP ＞ 企業一覧 ＞ 企業詳細（1234567） ＞ 担当者一覧 ＞ 担当者編集（000015） 全体管理画面TOP ＞ 企業一覧 ＞ 企業新規作成 全体管理画面TOP ＞ 会員一覧 2.1.1.1. デザイン 管理画面のボタンの使い分けは、特に指定がない限りは下記の通りとする。 CTJ-1434 0f376871-0459-35fc-b139-2a34c915ec22 System Jira 3. ログイン ログイン状態の扱いについては、各要求事項のページで別途指定がない限り、以下の通りとする。 ログインセッションの有効期限は最終操作から1週間とする。ログインセッションが切れた状態でマイページ内の操作を行なった場合、ログイン画面に遷移し再度ログインを求める。ログイン不要なページ内での操作を行なった場合、ログアウト状態の表示に切り替え、画面遷移は行わない。 4. メール送信 全体管理画面および本システムから送信されるメールすべてに対して履歴を保存する。 該当する機能一覧は メール送信履歴共通要件 でリストアップしている。 クライアント管理画面、サービスサイトから送信されるメールは除外する。 対応する帳票は 【作成中】メール送信履歴 とする。 5. 求人 5.1. 新着の条件 掲載日時が7日前以内 前より後 で、かつ非掲載日時がないか非掲載日時から7日以上経っている。 急募求人設定がされている場合は、急募求人表示が優先される。 5.2. 応募 【FIX】求人：基本情報 で「応募URL」が設定されている場合は、応募画面へ遷移せずにそのURLに遷移する。 6. Amazonギフト券 全体管理画面では、システム管理者以外はギフト券番号をマスキングして閲覧できないようにする。 該当する機能はギフト券管理機能配下、およびメール送信履歴機能配下である。 7. 口コミ 口コミのうち、文字列で入力される形式のものがサービスサイトで表示される条件は以下の3つである。 【FIX】口コミ が公開である。 【FIX】口コミ の公開日以降である。 【FIX】口コミ に紐づく 【レビュー中】採用お祝い申請 が承認済みである。 8. オシゴトQ＆A 【作成中】オシゴトQ＆A をサイト上で公開する条件は以下の条件である。 承認されていてかつ公開されている 9. ワイヤーフレーム ポップアップ 全体管理画面および企業管理画面でのワイヤーフレームは、要求定義で別途定義しない限り、以下の様式を共通的に使用する。 閉じるボタンは共通とし、押下するとポップアップを閉じる。 ポップアップ内の文言は各要求定義書で定義する。 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=99392-95658&amp;mode=design&amp;t=uxJLh6lNShoW9LO4-4 モーダル 全体管理画面および企業管理画面でのワイヤーフレームは、要求定義で別途定義しない限り、以下の様式を共通的に使用する。 キャンセルボタンは共通とし、押下すると単純にモーダルを閉じる。 モーダル内の文言や実行ボタンの文言、実行ボタンの挙動などは各要求定義書で定義する。 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=99392-94155&amp;mode=design&amp;t=uxJLh6lNShoW9LO4-4 10. バナー表示 各表示領域では、左上から右下に、バナー番号の昇順で配置する。 11. アップロードしたCSVファイルの扱い アップロードしたCSVは1ヶ月保管したのち自動削除する。 アップロードしたCSVファイルの名前が衝突しないようにファイル名にタイムスタンプをつけて保管する。 要求に特に記載がない場合、Shift-JIS形式のCSVファイルを受け付ける 12. ダウンロードするCSVファイルの扱い 要求に特に記載がない場合、Shift-JIS形式のCSVファイルをダウンロードする 13. ログ 全体管理画面での操作ではAdmin user XXX、クライアント管理画面での操作ではClient user XXXというフォーマットで出力する。 14. その他 メールアドレスの匿名化処理は、1文字目と「@」以下は元のままにして、 それ以外をランダムな文字列とする。 15. スコープ外 下記はスコープ外とする。 submitボタン（登録・保存など）の押下時以外に、エラー（リアルタイムバリデーションなど）を表示すること。 ユーザー側のパスワードポリシーについて、有効期限（一定期間ごとにパスワードの変更を必要とする）及び使用不可の世代を設定すること。 表示言語を切り替えられるようにすること。",
  "parentId": "666927105",
  "parentTitle": "■要件定義",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/666927437",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-11-13T05:17:32.296Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 入力 各入力項目の登録規制は、各要求事項のページで別途指定がない限り、以下の通りとする。 1.1. 共通事項 文字列の扱いは以下の通りとする。 半角・全角のスペースの取り扱いは以下の通りとする。 文頭文末に全角・半角のスペースが入力された場合、保存時にトリミングを行う。 文中に全角・半角のスペースが入力された場合、保存時に半角スペースへの変換を行う。 改行文字の取り扱いは以下の通りとする。 ..."
}