{
  "id": "674103382",
  "title": "【FIX】記事登録・公開・非公開・削除フロー",
  "content": "概要 記事担当者、記事管理者が記事登録・公開を行うまでの流れ。および、各情報の 非公開・削除 を行うまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 記事登録・公開フロー 順序 内容 誰が 1 全体管理画面から記事新規登録ページにアクセスする。 記事管理者（インターン学生） 2 記事新規登録ページで、フォームと記事作成箇所に必要な情報、文章を記入・選択して https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/682557639?atlOrigin=eyJpIjoiNTQ1YjAzYTEwNmUyNDQ2OThlYjgyNWUxZGY2ZTlkMzkiLCJwIjoiYyJ9 を作成する。 登録用ボタンを押下する。 記事 管理者（インターン学生） 3 承認状態を「未承認」、公開状態を「非公開」にして記事をデータベースに登録する。 ※登録された記事は公開状態が「非公開」の場合、サービスサイト側の記事一覧では見ることができない。 公開状態は管理画面の 記事一覧 ページで確認することができる。 ※記事を登録した旨の通知がシステムから自動的に記事管理者に送られることはない。 本システム 4 作成した記事の記事タイトル・記事IDを記事管理者（社員）に、本システム外の手段で記事の確認を依頼する。 記事管理者（インターン学生） 5 全体管理画面から記事一覧ページにアクセスする。記事検索フォームで、記事タイトルもしくは記事IDを入力することで対象記事を特定する。（記事一覧は更新順に並ぶため、目視で特定することもできる。） 記事管理者 （社員） 6 該当記事 の承認状態を「確認中」にし、記事の確認作業に移る。 記事管理者（社員） 7 記事を確認して修正が必要な箇所があれば、承認状態を「修正中」にして記事担当者に対して本システム外の手段で修正を依頼する。 （※修正が必要な箇所が無い場合、順序8に移る。） 記事管理者（社員） 8 記事一覧画面の該当記事ページから編集用ボタンを押下し、フォームと本文入力欄内で必要な修正を行う。 修正完了後、記事更新用ボタンを押下して記事の更新が完了したら、順序3に戻る。 記事管理者（インターン学生） 9 修正が必要な箇所が無ければ、承認状態を「済」にして、記事公開用ボタンを押下する。 記事管理者（社員） 10 公開した記事を、サービスサイトの 以下ページ に表示する。 情報局 - トップ 情報局 - 新着記事 情報局 - キーワードの記事一覧 情報局 - カテゴリの記事一覧 情報局 - 総合ランキング 情報局 - 各カテゴリのランキング 情報局 - 記事検索 そのうちどこに公開されるかは、順序2で記事管理者（インターン学生）が選択する以下条件によって指定される。 カテゴリ 記事閲覧可能ユーザー ランキングから除外 記事公開後は記事非公開用ボタンを押下し、記事を非公開状態にしないと記事内容や記事情報を編集する事ができないようにする。 本システム 記事非公開フロー 順序 内容 誰が 1 公開済みの記事について、非公開にして欲しいという要請を本システム外の手段で受ける。もしくは、自分で非公開にしたい記事を見つける。 ※非公開にしたいケースとしては以下のようなものが考えられる。 記事内容に誤情報が含まれている 記事情報が古くなってしまった 同じ記事を重複して公開してしまった コンプライアンスに違反するような記述が含まれていた 記事管理者（社員） 2 全体管理画面にアクセスし 、記事管理ページで記事非公開用ボタンを押下する。 記事管理者（社員） 3 管理画面の記事一覧・記事詳細ページで記事公開ステータスを「非公開」にし、サービスサイトの以下ページで該当記事を非公開にする。 情報局 - トップ 情報局 - 記事詳細 情報局 - キーワードの記事一覧 情報局 - カテゴリの記事一覧 情報局 - 総合ランキング 情報局 - 各カテゴリのランキング 情報局 - 記事検索 また、該当記事が https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674791493?atlOrigin=eyJpIjoiODk4MzdkYzI2ODVmNGViNmExM2M2ODM1MGU1NWY4OGQiLCJwIjoiYyJ9 でピックアップされていた場合であっても、 記事は非公開にできる。 （※該当記事がピックアップされている場合は、ピックアップされていると分かる様なステータス表示をする。） なお、 非公開にされた記事でも該当URLで直接検索することで記事ページを表示することができる。 本システム 記事削除フロー 順序 内容 誰が 1 公開済みの記事について、削除して欲しいという要請を本システム外の手段で受ける。もしくは、自分で削除したい記事を見つける。 ※削除したいケースとしては以下のようなものが考えられる。 記事内容に誤情報が含まれている 記事情報が古くなってしまった 同じ記事を重複して公開してしまった コンプライアンスに違反するような記述が含まれていた 記事管理者（社員） 2 全体管理画面にアクセスし 、記事管理ページで記事削除用ボタンを押下する。 記事管理者（社員） 3 管理画面の記事一覧・記事詳細ページ及び、サービスサイトの以下ページで該当記事を論理削除する。 情報局 - トップ 情報局 - 記事詳細 情報局 - キーワードの記事一覧 情報局 - カテゴリの記事一覧 情報局 - 総合ランキング 情報局 - 各カテゴリのランキング 情報局 - 記事検索 また、該当記事が https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674791493?atlOrigin=eyJpIjoiODk4MzdkYzI2ODVmNGViNmExM2M2ODM1MGU1NWY4OGQiLCJwIjoiYyJ9 でピックアップされていた場合であっても、 記事は削除できる。 （※該当記事がピックアップされている場合は、ピックアップされていると分かる様なステータス表示をする。） 削除した記事のURLに直接アクセスした場合、「ステータス404 page not found」など、ページが見つからないエラーを表示する。 本システム",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674103382/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-04-04T05:37:37.900Z",
  "author": "ejiri_yusuke",
  "excerpt": "概要 記事担当者、記事管理者が記事登録・公開を行うまでの流れ。および、各情報の 非公開・削除 を行うまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 記事登録・公開フロー 順序 内容 誰が 1 全体管理画面から記事新規登録ページにアクセスする。 記事管理者（インターン学生） 2 記事新規登録ページで、フォームと記事作成箇所に必要な情報、文章を記入・選択して..."
}