{
  "id": "674103375",
  "title": "【ページ統合により削除】口コミ登録・確認・公開フロー",
  "content": "※ 【作成中】採用お祝い/口コミ確認・公開フロー へ統合 概要 採用お祝い時の 【作成中】口コミ (キャリア以外・1回目) エンドユーザーが勤務開始から一ヶ月以上在籍し、採用お祝いを希望した場合に記述してもらうアンケートデータを教室の 【作成中】口コミ として本システムに登録する。 全体管理者が 【作成中】口コミ 内容の確認を行い、公開設定にしたものは教室の 【作成中】口コミ としてサービスサイトに公開される。 アンケート謝礼時の 【作成中】口コミ (キャリア以外・2回目) 採用お祝いのアンケート項目「正式指導開始日」から6ヶ月後、1年以内に申請できるアンケートをアンケート謝礼を希望する場合は回答していただき、アンケートデータを教室の 【作成中】口コミ として本システムに登録する。 全体管理者が 【作成中】口コミ 内容の確認を行い、公開設定にしたものは教室の 【作成中】口コミ としてサービスサイトに公開される。 採用お祝い時の 【作成中】口コミ (キャリア・1回目) エンドユーザーが採用になった場合、応募から180日以内にマイページから申請を行う。申請から1週間以内にメールが届くので、アンケートを回答していただく。記述していただいたアンケートデータを教室の 【作成中】口コミ として本システムに登録する。 全体管理者が 【作成中】口コミ 内容の確認を行い、公開設定にしたものは教室の 【作成中】口コミ としてサービスサイトに公開される。 採用お祝い時の 【作成中】口コミ (キャリア・2回目) 採用お祝いのアンケート項目「正式指導開始日」から6ヶ月後、1年以内に申請できるアンケートをアンケート謝礼を希望する場合は回答していただき、アンケートデータを教室の 【作成中】口コミ として本システムに登録する。 全体管理者が 【作成中】口コミ 内容の確認を行い、公開設定にしたものは教室の 【作成中】口コミ としてサービスサイトに公開される。 口コミ登録・公開 (キャリア以外・1回目) 【FIX】オファー・応募・選考・採用フロー を経て、すでに採用が完了していることを前提とする。 順序 内容 誰が 1 以下のいずれかの手段でお祝い金と受け取り方法を認識する。 サービスサイト内の求人一覧の求人カードや求人詳細の 「お祝い金」バナー表示 サービスサイト内よくある質問ページの「採用お祝い・アンケート謝礼について」 求人応募後にお祝い金申請を促す案内がある？ そのほかのパターン有無についても要確認 会員 2 会員がサービスサイトにログインを行う。 会員 3 会員がメニューから、サービスサイトマイページの応募履歴・採用お祝い申請ページへ遷移する。 会員 3 この時点では採用お祝いページへ遷移するリンクは非活性になっている。 本システム 4 応募から180日以内に、エンドユーザーは実際に採用された教室を画面をスクロールし、応募を選択する。 サービスサイトマイページの応募履歴・採用お祝い申請ページから応 募ステータスを会員が「採用」に変更 するとリクエスト処理が走り、画面が更新され、応募ステータスが「採用」に変更されたことを会員は確認することが出来る 会員 5 採用に変更すると、採用お祝い申し込みできるページへのリンクが活性化される。 本システム 6 採用お祝い申請ページに遷移し、 【作成中】採用お祝い申請（1度目） を行う。この際 【作成中】採用お祝い申請（1度目） 内に 【作成中】口コミ が含まれている。 会員 7 【作成中】採用お祝い申請（1度目） を元に 【作成中】口コミ を保存する。 【作成中】口コミ は初期状態では非公開で登録される。 本システム 8 会員から申請があった旨を、全体管理者が設定している通知用 メールアドレス に口コミ投稿通知メールを送信する。 本システムから送信された口コミ投稿通知メールのメール本文には、 【作成中】採用お祝い申請（1度目） を元に 【作成中】口コミ を保存された全体管理画面のURLを記載する。 本システム 9 全体管理者は口コミ投稿通知メール通知を受け、全体管理画面にログインを行う。 全体管理者 10 全体管理者はメインメニューから、 【作成中】採用お祝い申請（1度目） 一覧ページに遷移し、検索で対象の 【作成中】採用お祝い申請（1度目） 検索し、詳細に遷移する。 【作成中】採用お祝い申請（1度目） 詳細 で 承認状況を承認に変更する 。 全体管理者 11 全体管理者はメインメニューから 【作成中】口コミ 一覧ページ に遷移する。 全体管理者は検索で対象の 【作成中】口コミ を検索する。 全体管理者 12 全体管理者は口コミのステータスを「公開」に変更し更新する 全体管理者は、現時刻以降公開の場合はステータスを「公開待ち」に変更し、公開日を設定し更新する。 全体管理者 13 全体管理者は、全体管理画面メインメニューから採用確認一覧ページへ遷移する。 全体管理者 14 採用のステータスが 「不合格、連絡取れず、辞退、欠席、応募重複、短期、対象外」以外の場合 はサービスサイトの対象教室 【作成中】口コミ 一覧 に表示する。 本システム 口コミ登録・公開 (キャリア以外・2回目) 【FIX】オファー・応募・選考・採用フロー を経て、すでに採用が完了していることを前提とする。 順序 内容 誰が 1 会員の正式指導開始日を起点に6ヶ月経過後、 【作成中】採用お祝い申請（2度目） を 本システムを介して自動的にメールで会員の登録しているメールアドレスに送付する。 本システム 2 会員は送付されたメールアドレス本文に記載のあるURLへ遷移し、サービスサイトにログインを行う。 会員 3 【作成中】採用お祝い申請（2度目） のページを表示する。 正式指導開始日から6ヶ月後〜1年以内であれば ページが表示され、1年以降であればページを表示しない。 本システム 6 会員は 【作成中】採用お祝い申請（2度目） 記入を行う。 この際 【作成中】採用お祝い申請（2度目） 内に 【作成中】口コミ が含まれている。 会員 7 本システムは 【作成中】採用お祝い申請（2度目） を元に 【作成中】口コミ を保存する。 【作成中】口コミ は初期状態では非公開で登録される。 本システム 8 会員から申請があった旨を、全体管理者が設定している通知用 メールアドレス に口コミ投稿通知メールを送信する。 本システムから送信された口コミ投稿通知メールのメール本文には、 【作成中】採用お祝い申請（2度目） を元に 【作成中】口コミ を保存された全体管理画面のURLを記載する。 本システム 9 全体管理者は口コミ投稿通知メール通知を受け、全体管理画面にログインを行う。 全体管理者 10 全体管理者はメインメニューから、 【作成中】採用お祝い申請（2度目） 一覧ページに遷移し、検索で対象の 【作成中】採用お祝い申請（2度目） 検索し、詳細に遷移する。 【作成中】採用お祝い申請（2度目） 詳細 で 承認状況を承認に変更する 。 全体管理者 11 全体管理者はメインメニューから 【作成中】口コミ 一覧ページ に遷移する。 全体管理者は検索で対象の 【作成中】口コミ を検索する。 全体管理者 12 全体管理者は口コミのステータスを「公開」に変更し更新する 全体管理者は、現時刻以降公開の場合はステータスを「公開待ち」に変更し、公開日を設定し更新する。 全体管理者 13 全体管理者は、全体管理画面メインメニューから採用確認一覧ページへ遷移する。 全体管理者 14 採用のステータスが 「不合格、連絡取れず、辞退、欠席、応募重複、短期、対象外」以外の場合 はサービスサイトの対象教室 【作成中】口コミ 一覧 に表示する。 本システム 口コミ登録・公開 (キャリア・1回目) 【FIX】オファー・応募・選考・採用フロー で採用後のフローを想定 順序 内容 誰が 1 採用になった場合、応募から180日以内に、本システムマイページの管理画面から1度目のお祝い金申請を行う。 会員 2 全体管理画面にログインし採用状況の確認を行う。 申請内容と本システムに登録済みの採用状況が一致していない場合、申請元の会員に対して採用証明資料の提出を依頼する。 一致している場合は4に進む。 全体管理者 3 全体管理者からの依頼に応じて採用証明書の提出を行う。 会員 4 1度目の採用お祝いを申請元の会員宛に メールで 自動進呈する。 本システム 5 1度目の採用お祝いが正しく進呈されたか定期的にチェックを行い、進呈されていなければ再進呈を行う。 同時に再進呈が行われたことを全体管理者宛に通知する。 本システム 6 1度目の進呈処理が完了した日を起点 に1週間以内に、アンケート (キャリア外のお祝い金申請1度目相当) を本システムを介して送付する。 全体管理者？本システム？ 7 会員はサービスサイトにログインを行う。 会員 8 応募から180日以内に、サービスサイトマイページの応募履歴・採用お祝い申請ページから応募ステータスを「採用」に変更する。 会員 9 採用お祝い申請ページに遷移し、2度目のお祝い金申請 (キャリア外のお祝い金申請1度目相当) を行う。この際 2度目のお祝い金申請 内に 【作成中】口コミ が含まれている。 会員 10 2度目のお祝い金申請 を元に 【作成中】口コミ を保存する。 【作成中】口コミ は初期状態では非公開で登録される。 本システム 11 会員から申請があった旨を メール？ で通知する。 本システム 12 通知を受け、全体管理画面にログインを行う。 全体管理者 13 全体管理者はメインメニューから 【作成中】口コミ 一覧ページ に遷移する。 全体管理者は検索で対象の 【作成中】口コミ を検索する。 14 全体管理者は口コミのステータスを「公開」に変更し更新する 全体管理者は、現時刻以降公開の場合はステータスを「公開待ち」に変更し、公開日を設定し更新する。 全体管理者 15 全体管理者は、全体管理画面メインメニューから採用確認一覧ページへ遷移する。 全体管理者 16 採用のステータスが 「不合格、連絡取れず、辞退、欠席、応募重複、短期、対象外」以外の場合 はサービスサイトの対象教室 【作成中】口コミ 一覧 に表示する。 本システム 口コミ登録・公開 (キャリア・2回目) 【FIX】オファー・応募・選考・採用フロー を経て、すでに採用が完了していることを前提とする。 順序 内容 誰が 1 正式指導開始日を起点に6ヶ月経過後に採用お祝いを 本システムを介してメール送付する。 本システム 2 サービスサイトにログインを行う。 会員 3 正式指導開始日から6ヶ月後〜1年以内であれば ページが表示され、1年以降であればページを表示しない。 本システム 4 採用お祝い申請ページに遷移し 、 3度目のお祝い金申請 を行う。この際 3度目のお祝い金申請 内に 【作成中】口コミ が含まれている。 会員 5 3度目のお祝い金申請 内を元に 【作成中】口コミ を保存する。 【作成中】口コミ は初期状態では非公開で登録される。 本システム 6 会員から 3度目のお祝い金申請 があった旨を メール？ で通知する。 本システム 7 通知を受け、全体管理画面にログインを行う。 全体管理者 8 全体管理者はメインメニューから全体管理画面 【作成中】口コミ 一覧ページ に遷移する。 全体管理者は検索で対象の 【作成中】口コミ を検索し対象の詳細画面へ遷移する。 全体管理者 9 全体管理者は口コミのステータスを「公開」に変更し更新する 全体管理者は、現時刻以降公開の場合はステータスを「公開待ち」に変更し、公開日を設定し更新する。 全体管理者 10 全体管理者は、全体管理画面メインメニューから採用確認一覧ページへ遷移する。 全体管理者 11 採用のステータスが 「不合格、連絡取れず、辞退、欠席、応募重複、短期、対象外」以外の場合 はサービスサイトの対象教室 【作成中】口コミ 一覧 に表示する。 本システム 関連資料 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E5%85%A8%E4%BD%93%E3%83%95%E3%83%AD%E3%83%BC https://www.juku.st/campaign https://www.juku.st/info/entry/2600 帳票 【作成中】口コミ 【作成中】採用お祝い申請（1度目） 【作成中】採用お祝い申請（2度目） 採用お祝い進呈状況管理",
  "parentId": "684228649",
  "parentTitle": "■削除ページ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674103375",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-03-29T02:29:26.595Z",
  "author": "ejiri_yusuke",
  "excerpt": "※ 【作成中】採用お祝い/口コミ確認・公開フロー へ統合 概要 採用お祝い時の 【作成中】口コミ (キャリア以外・1回目) エンドユーザーが勤務開始から一ヶ月以上在籍し、採用お祝いを希望した場合に記述してもらうアンケートデータを教室の 【作成中】口コミ として本システムに登録する。 全体管理者が 【作成中】口コミ 内容の確認を行い、公開設定にしたものは教室の 【作成中】口コミ としてサービスサイト..."
}