{
  "id": "674496542",
  "title": "【FIX】クライアント企業契約・登録・更新・契約終了フロー",
  "content": "概要 サービスサイトに商品を掲載するクライアント企業を獲得して契約、登録完了し、クライアント企業がクライアント企業向け管理画面にログインして利用できるようになるまでの流れ。 および、クライアント企業が契約を更新、または終了して商品の掲載を停止するまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 クライアント企業契約・登録フロー ※このフローと並行して、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674332719#%E6%95%99%E5%AE%A4%EF%BC%8F%E6%B1%82%E4%BA%BA%E9%96%A2%E9%80%A3%E6%83%85%E5%A0%B1%E7%99%BB%E9%8C%B2%E3%83%BB%E5%85%AC%E9%96%8B%E3%83%95%E3%83%AD%E3%83%BC が行われる場合がある。 順序 内容 誰が 1 本サイトの問い合わせフォーム、または本サイト外の連絡手段により、サイト運営者に対して、本サイトへの掲載希望の連絡を行う。 クライアント企業 2 クライアント企業に対して、本サイト外の連絡手段（GMOサイン）にて、 広告掲載申込書（本システム外） へリンクが記載されたメールを送付する。 サイト運営者 3 広告掲載申込書（本システム外） に必要事項を記入し、サイト運営者に対して送付する。 クライアント企業 4 広告掲載申込書（本システム外） の記入内容を確認し、不備があればクライアント企業に対して、不備の解消依頼の連絡を行い、前項へ戻る。不備がなければ、クライアント企業に対して、その旨の連絡を行うとともに、 広告掲載申込書（本システム外） への署名または押印依頼を行う。 サイト運営者 5 広告掲載申込書（本システム外） へ署名または押印を行い、サイト運営者へ返送する。これによって、基本契約（ 【レビュー中】契約情報（統合版） ）の締結が完了する。 クライアント企業 6 全体管理者に対して、契約が完了したクライアント企業の 広告掲載申込書（本システム外） の送付と、全体管理画面への登録依頼を行う。 サイト運営者 7 全体管理画面にて、受領した 広告掲載申込書（本システム外） をもとに、クライアント企業の 【FIX】企業：基本情報 としての登録、基本契約（ 【レビュー中】契約情報（統合版） ）の情報の登録、 【レビュー中】クライアント企業管理者 の登録を行い、クライアント企業管理者アカウントの発行を行う。 また、この時点で、並行して行われる https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674332719#%E6%95%99%E5%AE%A4%EF%BC%8F%E6%B1%82%E4%BA%BA%E9%96%A2%E9%80%A3%E6%83%85%E5%A0%B1%E7%99%BB%E9%8C%B2%E3%83%BB%E5%85%AC%E9%96%8B%E3%83%95%E3%83%AD%E3%83%BC において、 【レビュー中】教室グループ 、 【レビュー中】教室：基本情報／所在地 、 【レビュー中】求人：基本情報 の情報の登録も行われる。 全体管理者 8 登録された 【FIX】企業：基本情報 情報および基本契約（ 【レビュー中】契約情報（統合版） ）情報を、対象のクライアント企業向け管理画面で閲覧可能にする。 また、この時点で、並行して行われる https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/674332719#%E6%95%99%E5%AE%A4%EF%BC%8F%E6%B1%82%E4%BA%BA%E9%96%A2%E9%80%A3%E6%83%85%E5%A0%B1%E7%99%BB%E9%8C%B2%E3%83%BB%E5%85%AC%E9%96%8B%E3%83%95%E3%83%AD%E3%83%BC において、 【レビュー中】教室グループ 、 【レビュー中】教室：基本情報／所在地 、 【レビュー中】求人：基本情報 の情報も、クライアント企業向け管理画面で閲覧可能にする。 本システム 9 全体管理画面で発行したクライアント企業管理者アカウントとログイン用URLをクライアント企業に対してメールで送付する。 本システム 10 受領したクライアント企業アカウントを利用して、クライアント企業向け管理画面にログインする。 クライアント企業 クライアント企業の 企業情報変更 フロー 番号 内容 誰が 1 クライアント企業社内の事情等により、本サイトに登録してある 【FIX】企業：基本情報 情報の変更が必要になった場合、 【FIX】企業：基本情報 情報の変更希望の旨とその内容を、クライアント企業向け管理画面からリンクされている本サイト外の連絡手段にて、サイト運営者に対して連絡する。 クライアント企業 2 クライアント企業から受領した 【FIX】企業：基本情報 情報の変更内容を、全体管理者へ連絡する。 サイト運営者 3 全体管理画面にログインし、 【FIX】企業：基本情報 情報を変更する。 全体管理者 4 変更した 【FIX】企業：基本情報 情報を、全体管理画面、クライアント企業向け管理画面、および、対象の 【FIX】企業：基本情報 情報が掲載されているサービスサイト上のページ（教室ページ等）へ反映する。 本システム 5 【FIX】企業：基本情報 情報の 変更完了 の旨を、サイト運営者へ連絡する。 全体管理者 6 変更 完了の旨を、 本サイト外の連絡手段 にて、 クライアント企業へ連絡 する。 サイト運営者 7 サービスサイトにて、変更されたことを確認し、クライアント企業管理者へ連絡する。 クライアント企業 8 クライアント企業向け管理画面にて、変更されたことを確認する。 クライアント企業管理者 クライアント企業契約更新・終了フロー 順序 内容 誰が 1 基本契約（ 【レビュー中】契約情報（統合版） ）の契約終了まで残り25日以内となった場合、クライアント企業向け管理画面にて基本契約（ 【レビュー中】契約情報（統合版） ） の更新または更新なしを登録可能とする。 本システム 2 さらに、基本契約（ 【レビュー中】契約情報（統合版） ）の契約終了まで残りが 25日、7日、1日（契約最終日） となった場合、基本契約（ 【レビュー中】契約情報（統合版） ）の更新を促すための 契約更新促進メール（クライアント企業管理者宛） をクライアント企業管理者全員へ送る。 本システム 3 基本契約（ 【レビュー中】契約情報（統合版） ）の更新を行う場合、クライアント企業向け管理画面にて、基本契約（ 【レビュー中】契約情報（統合版） ）の更新期間を指定して、契約更新内容を登録する。 基本契約（ 【レビュー中】契約情報（統合版） ）の更新を行わない場合、クライアント企業向け管理画面にて、基本契約（ 【レビュー中】契約情報（統合版） ）の更新なしの旨とその理由を登録する。 クライアント企業管理者 4 基本契約（ 【レビュー中】契約情報（統合版） ）の更新情報の登録有無を確認し、更新がある場合は、登録された契約更新内容に基づいて、基本契約（ 【レビュー中】契約情報（統合版） ）の契約期間を更新する。 更新なしとして登録された場合、対象のクライアント企業管理者に対しては、基本契約（ 【レビュー中】契約情報（統合版） ）の更新を促すための 契約更新促進メール（クライアント企業管理者宛） を送らないようにする。 本システム 5 基本契約（ 【レビュー中】契約情報（統合版） ）の契約期間が過ぎたら、対象のクライアント企業に紐づく掲載商品をすべて、サービスサイト上で非掲載にする。また、紐づくクライアント企業管理者アカウントをすべて無効にする。 本システム 関連資料 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E7%90%86%E6%83%B3_%E5%A5%91%E7%B4%84%E9%96%A2%E9%80%A3_%E3%82%AA%E3%83%9A%E3%83%AC%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/676233261#%E3%83%90%E3%83%83%E3%83%81%E4%B8%80%E8%A6%A7",
  "parentId": "678920244",
  "parentTitle": "契約関連全体フロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674496542/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-15T09:35:36.868Z",
  "author": "ejiri_yusuke",
  "excerpt": "概要 サービスサイトに商品を掲載するクライアント企業を獲得して契約、登録完了し、クライアント企業がクライアント企業向け管理画面にログインして利用できるようになるまでの流れ。 および、クライアント企業が契約を更新、または終了して商品の掲載を停止するまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 クライアント企業契約・登録フロー ※このフローと並行して、 h..."
}