{
  "id": "674496584",
  "title": "【FIX】採用お祝い/口コミ確認・公開フロー",
  "content": "概要 採用された会員がお祝い金の申請を行い、お祝い金の進呈を受けるまでの流れです。会員は募集企業に対する口コミ投稿に伴って、管理者からの採用お祝いを申請することができ、管理者が口コミおよび申請を承認することで会員はお祝いを受け取ることができます。 採用お祝いは、 塾講師ステーション と 塾講師ステーションキャリア でお祝い進呈の回数とギフト券の総額が異なります。 それぞれの違いは 096_採用お祝いの種類 の通りです。 なお、会員は任意のタイミングでこのフローを離脱することが可能です。 また、本フロー中に複数記載のある、採用お祝い進呈（Amazonギフト券の発行・送信）のフローの詳細は 【FIX】Amazonギフト券発行・金額確認フロー を 参照すること 。 採用お祝い/口コミ確認・公開フロー 順序 内容 誰が 1 【FIX】オファー・応募・選考・採用フロー を経て、すでに会員が事業者に採用完了していることを前提とする。 ー 2 ＜お祝い①ステップ＞ 以下のいずれかの手段で会員はお祝い金と受け取り方法を認識する。 サービスサイト内の「お祝い金」表示 サービスサイト内よくある質問ページの「採用お祝い・アンケート謝礼について」 会員 3 サービスサイトにログインを行う。 会員 4 応募から180日以内に、サービスサイトマイページの応募履歴・採用お祝い申請ページから該当する 【FIX】応募情報 の 応募ステータスを「採用」に変更する。なお、この採用ステータスは自己申告の場合の会員側の採用ステータスと、企業側の採用ステータスが別々に存在し、会員（申告者）側の採用ステータスのみ変更できる。 会員 5 採用お祝い申請ページに遷移し、1度目のアンケート（ 【作成中】口コミ ） の投稿とともに、お祝い金申請（ 【レビュー中】採用お祝い申請 ） を行う。 会員 6 定期的に採用お祝い申請状況を確認するため、全体管理画面にログインを行う。 全体管理者 7 全体管理画面の採用お祝い申請管理ページにアクセスし 、一覧上から承認状態でフィルタリングして確認対象の 【レビュー中】採用お祝い申請 を探す。 全体管理者 8 ＜ お祝い①申請 確認ステップ＞ 対象の申請について、詳細ページにおいてアンケート（ 【作成中】口コミ ）と採用状況の確認行う。 ■口コミの確認 【作成中】口コミ の 内容に、下記で示す観点の問題がなければ 【作成中】口コミ の公開フラグを「公開」にし、更新する。そうでなければ公開フラグを「非公開」のままとする。 応募と無関係な内容 誹謗中傷やコンプライアンス上不適切な表現 その他、全体管理者として不適切と判断した内容 ■採用状況の確認 【レビュー中】採用お祝い申請 および紐づく 【FIX】応募情報 の中で、会員が申告した採用ステータスと本システムに登録済みの企業側の採用ステータスと、 研修初日の日付 が一致していない場合、申請元の会員に対して採用証明資料の提出を依頼する。 一致している場合は 【レビュー中】採用お祝い申請 の承認ステータスを「承認」で登録し、 ＜お祝い①申請承認後ステップ＞ に進む。 全体管理者 9 全体管理者からの 依頼があった場合は 採用証明書の提出 （ 依頼および提出は本システム外の手段） を行う。 会員 10 会員から採用証明書を受領し、内容を確認する。 問題があれば ＜お祝い①申請確認ステップ＞ に戻り、会員とのやりとりを継続する。 問題なければ詳細ページの承認状況を「承認」に変更する。 全体管理者 11 ＜ お祝い①申請 承認後ステップ＞ 「承認」に変更されたら、定期的なバッチ処理にて、以下の条件を全て満たした会員宛にAmazonギフト券のギフトコードをメール（ 1st採用お祝い進呈メール（会員宛） ）で送信する形で 自動進呈 する。 下記は本システム外の手段で判断する （前ステップにて「承認」へ変更されたことで判断完了したものとする） 過去に同一企業での採用・勤務歴がない 講習限定など、期間限定・短期採用ではない 紹介（友人、応募教室の既存講師等）ではない 塾講師ステーションの応募前に、他の求人媒体（アルバイト情報サイト、フリーペーパー、企業ホームページ、貼り紙等）から、同じ求人案件に応募していない 申請内容が虚偽ではない 該当求人画面に&rdquo;採用お祝い対象外&rdquo;の記載がない 1度目の採用お祝いの承認状況が「承認」 まだ進呈が行われていない 進呈処理の際に会員である 本システム 12 公開フラグが「公開」へ変更された 【作成中】口コミ をサービスサイトの口コミ一覧・詳細ページで 閲覧できる状態にする 。 本システム 13 ＜お祝い②ステップ＞ 塾ステーションキャリアで求人ページ上に「採用お祝い10,000円分」の旨の記載がある求人に応募していた場合は、1週間以内に、本システム外のメールでアンケートを依頼する。 該当求人以外への応募の場合は ＜お祝い③ステップ＞ へ進む。 全体管理者 14 アンケート依頼メールから、本システム外のアンケート回答ページ等を表示し、アンケートに回答する。 会員 15 本システム外でアンケートを受領して確認し、全体管理画面のギフト券発行機能で対象の会員にギフト券5,000円分を進呈する。 全体管理者 16 ＜お祝い③ステップ＞ お祝い①の進呈処理が完了した日を起点に 6ヶ月経過後、 アンケート（ 【作成中】口コミ ）依頼メール（ 6ヶ月後採用お祝い申請期間開始通知メール（会員宛） ）を会員宛に 送付する 。 本システム 17 受け取った アンケート依頼 メールに記載しているURLから本システムにアクセスしてお祝い③の 【レビュー中】採用お祝い申請 とアンケート（ 【作成中】口コミ ）の回答を記入し登録する。 会員 18 【レビュー中】採用お祝い申請 およびアンケート（ 【作成中】口コミ ） 受領の翌日に採用お祝い③の進呈メール（ 1st採用お祝い進呈メール（会員宛） ）を自動送信することで、申請元の会員に 自動進呈 する。 本システム 19 全体管理画面にログインを行う。 全体管理者 20 全体管理画面のお祝い申請管理ページ にアクセスし 、検索を行なった上で対象の 【レビュー中】採用お祝い申請 を探す。 対象の 【レビュー中】採用お祝い申請 の詳細画面でアンケート （ 【作成中】口コミ ） の確認を行い、内容について、 ＜お祝い①申請確認ステップ＞ と同じ観点で問題なければ、 【作成中】口コミ の公開フラグを「公開」にし、更新する。公開フラグを「非公開」のままとする。 応募と無関係な内容 誹謗中傷やコンプライアンス上不適切な表現 その他、全体管理者として不適切と判断した内容 全体管理者 21 公開承認ステータスが「承認済」で「公開日」を過ぎた 【作成中】口コミ をサービスサイトの口コミ一覧・詳細ページで 閲覧できる状態にする 。 これにより、採用お祝い金の進呈対応が完了する。 本システム",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/674496584/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-02-05T08:27:01.967Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "概要 採用された会員がお祝い金の申請を行い、お祝い金の進呈を受けるまでの流れです。会員は募集企業に対する口コミ投稿に伴って、管理者からの採用お祝いを申請することができ、管理者が口コミおよび申請を承認することで会員はお祝いを受け取ることができます。 採用お祝いは、 塾講師ステーション と 塾講師ステーションキャリア でお祝い進呈の回数とギフト券の総額が異なります。 それぞれの違いは 096_採用お祝..."
}