{
  "id": "684261377",
  "title": "2023-02-06 ミーティング議事録（管理画面レクチャー）",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、佐久間様（クライアントサポート。請求）、前橋様（営業。システム周りも） GIG： 資料 ミーティング録画 &nbsp;議題 項目 メモ 採用確認 採用確認完了の進め方 提出ステータス＝提出中 採用ステータス=保留 確認完了＝未完了 採用お祝い 研修初日の差異がないか確認 「採用お祝い不一致」で保存を行うと、自動でメールが飛ぶ 確認はどういうタイミングで行うのか 任意のタイミングで確認 通知は来ない 採用不一致のアラートが付く際は通知が届く アラートの種類 お祝い超過 採用情報の不一致 応募者からのお祝い金の申請はどのタイミングで行われるのか 応募日から6ヶ月以内の任意のタイミングで採用画面から行う 採用時に会員に通知されるメールはシステム外 採用タイミングが都度バラバラ ユーザー自身が採用ステータスを変更できる 企業からの虚偽報告・誤報告を防ぐため ユーザーが設定した採用ステータスは一覧に載せなくて良いのか？ 無くても不便はない 採用ステータスが不合格の時に確認する 翌日のお昼頃に不合格が間違いないか、また、他の塾に応募しませんか、という旨のメールが応募者に飛ぶ 請求確定日時をFMが見て請求対象としている。 最終編集者を見て、client、adminのどちらが編集したか判別している。 採用ステータス「対象外」 応募がある=課金の携帯の場合（採用確認がメールの場合）はこちらに振り分けられる 採用ステータス「短期」 求人で短期募集かどうかの設定を予めできる 短期&rarr;長期にしたい時は、長期ボタンを押すことで変更できる 応募日の翌月末までに採用確認を行う必要がある 期限超過すると 期限超過のステータスに変わる 期限超過のメールが企業宛に自動で飛ぶ 勤務開始日は誰がどこで記入するのか 研修初日（給料発生のタイミング）とイコール バックヤードの作業 請求管理 ファイルメーカーで作成したデータをアップロード 毎時間20分おきにバッジが回り、取り込まれると一覧に表示される ファイルメーカー請求画面 請求書データで確定作業を行う 請求通知 取り込んだ段階では企業様に通知は行かない 承認を行うと 企業アドレス宛に通知 企業が請求書をDLできる 請求明細一覧から何の請求を立てるかも登録できる 請求金額にも自動で反映される CSVアップロードは基本自動？ 手動でアップロード ファイルメーカーでアップロード後、自動で落とし込むバッジがあり、それを取り込む 手動で新規作成を行うシーンは？ 過不足金があった時など、イレギュラーが発生した時の修正時 企業様がいくら振り込まれたかの入金管理も行っているため、管理部の方からイレギュラーな入金を指摘されてしまう 入金確認はどう行っている？ ファイルメーカーだけで確認している ファイルメーカーから請求書を送るなどは、なぜ出来るようにしなかったのか pdf化する前は請求書を印刷し郵送していた pdf化する際に全てをアドミンに移行するのは難しかった 入力する際の金額は税込表示で良いのか FMの税額を修正した 税額を独立して登録できるようにしたい 税額を変更できるテーブルを作る方向でも良いかも 履歴を残しておく必要あり 具体的な部分は今後詰めていきたい 請求処理全体をFM&rarr;システムに引っ越したい 今回、管理画面をマスタとしたい。 ただ、請求データをFMに取り込めるようにはしておきたい。管理部が見られる様にするため。 FMをfreee、Moneyforwardなどのクラウドサービスに移行することは検討しているか 内容次第だが、工数削減になるのであれば検討したい 今のところ外だしは考えていない チャットにて鈴木さんより ■主な請求となるデータ 採用確認で在籍◯となった応募者 契約更新やオプション(急募など)のような適宜発生するもの ■請求データの金額に関して FM上に契約管理マスタが存在しており、その契約マスタ上の契約内容に応じて採用時の金額を算出している ■塾stへの取り込み、PDF発行 上記で請求データとして確定したものをCSVに吐き出し、塾stadmin上にデータを取り込み 口座情報 請求データ 請求明細データ 採用者データ &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 DECIDED 7113baef-b9fe-4a11-a28f-9518f6a1b72a",
  "parentId": "1235746832",
  "parentTitle": "議事録_2023年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/684261377/2023-02-06",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-02-07T04:42:57.073Z",
  "author": "ejiri_yusuke",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、佐久間様（クライアントサポート。請求）、前橋様（営業。システム周りも） GIG： 資料 ミーティング録画 &nbsp;議題 項目 メモ 採用確認 採用確認完了の進め方 提出ステータス＝提出中 採用ステータス=保留 確認完了＝未完了 採用お祝い 研修初日の差異がないか確認 「採用お祝い不一致」で保存を行うと、自動でメールが..."
}