{
  "id": "686653475",
  "title": "【FIX】求人登録・公開・削除フロー",
  "content": "1 7 概要 クライアント企業から提供された情報をもとに、全体管理者とクライアント企業管理者が求人登録・公開を行うまでの流れ。および、求人の公開・掲載の停止を行うまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 留意点 本フローに登場する以下用語は定義がやや複雑である。そのため、以下資料を事前に確認の上フローを読み進めること。 ワード・ディフィニション に記載の以下用語解説 公開 非公開 掲載 非掲載 015_【作成中】教室および求人の公開/掲載ステータス 求人の登録・編集・削除は全体管理画面とクライアント向け管理画面の双方で実行可能であるが、基本的にはクライアント向け管理画面から操作する運用となっている。ただし、以下のケースは例外的に全体管理画面から操作することがある。 企業に対しての求人初回登録時 大量の求人登録や変更の依頼があった際の代行 不適切な内容の削除 法律的（男女雇用機会均等法など）に不適切な内容 サービスサイト掲載ルール上不適切な内容（エンドユーザーからクライアント企業に直接連絡を促す内容など） 求人登録・掲載 事前のフローとして 【FIX】教室登録・公開・削除フロー が存在する。 求人登録・掲載フロー（全体管理者が登録を実施） 順序 内容 誰が 1 全体管理者に対して 【FIX】クライアント企業契約・登録・更新・契約終了フロー の中で受領した 求人フォーマット（本システム外） の情報を提示し、求人情報の登録を依頼する。 連絡とデータの受け渡しには本システム外の連絡手段を用いる。 サイト運営者 2 サイト運営者からの連絡を受けて、全体管理画面にログインを行う。 全体管理者 3 全体管理画面の教室管理ページから教室名等で検索の上、登録したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 全体管理者 4 本サイト外の連絡手段により事前に受領した 求人フォーマット（本システム外） をもとに、対象の教室の求人管理ページにて 【作成中】求人 および紐づく求人情報の新規登録を行う。 必要に応じてプレビュー機能での確認を行う。 この際 【作成中】求人 は自動的に 掲載状態で登録されるが、一度非掲載状態に変更する。その後、本システム外の連絡ツールを利用してクライアント企業管理者に内容確認を依頼する。 ※運用の都合上、初めから非掲載として登録することはしない。 詳細は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/686653475?focusedCommentId=693469212 を参照。 全体管理者 5 全体管理者からの連絡を受け、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 6 クライアント企業向け管理画面の教室管理ページから教室名等で検索の上、登録したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 クライアント企業管理者 7 対象の教室の求人管理ページにて 【作成中】求人 および紐づく求人情報の内容を確認し、不備がある場合はクライアント企業管理者の操作習熟度合いに応じて、下記のいずれかの対応を行う。 クライアント企業管理者が自身で内容を修正しする。 全体管理者に対して、不備の解消依頼の連絡を行い、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/686653475#%E6%B1%82%E4%BA%BA%E7%99%BB%E9%8C%B2%E3%83%BB%E6%8E%B2%E8%BC%89%E3%83%95%E3%83%AD%E3%83%BC%EF%BC%88%E5%85%A8%E4%BD%93%E7%AE%A1%E7%90%86%E8%80%85%E3%81%8C%E7%99%BB%E9%8C%B2%E3%82%92%E5%AE%9F%E6%96%BD%EF%BC%89 の順序4へ戻り、不備がなくなるまで繰り返す。 必要に応じてプレビュー機能での確認を行う。 不備がなければそのまま順序8に進む。 クライアント企業管理者 8 【作成中】教室 が掲載状態になっている場合は、 【作成中】教室 【作成中】求人 および紐づく求人情報をサービスサイトの教室一覧ページ及び求人詳細ページに表示する。 【作成中】教室 が 非掲載状態になっている場合 は、 【作成中】教室 【作成中】求人 および紐づく求人情報共にサービスサイト側に表示しない。 これにより、 【作成中】求人 の登録・掲載操作が完了する。 本システム 求人登録・掲載フロー（クライアント企業管理者） 順序 内容 誰が 1 本システム外の連絡手段を用いて、 【作成中】求人 の作成依頼を行う。 クライアント企業 2 クライアント企業からの連絡を受けて、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 3 クライアント企業向け管理画面の教室管理ページから教室名等で検索の上、登録したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 クライアント企業管理者 4 対象の教室の求人管理ページにて 【作成中】求人 および紐づく求人情報の新規登録を行う。 必要に応じてプレビュー機能での確認を行う。 この際 【作成中】求人 は自動的に掲載状態で登録される。 クライアント企業管理者 5 【作成中】教室 が掲載状態になっている場合は、 【作成中】教室 【作成中】求人 および紐づく求人情報をサービスサイトの教室一覧ページ及び求人詳細ページに表示する。 【作成中】教室 が非掲載状態になっている場合は、 【作成中】教室 【作成中】求人 および紐づく求人情報共にサービスサイト側に表示しない。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の登録・掲載が完了となる。 クライアント企業管理者 求人編集 求人編集フロー（クライアント企業管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、クライアント企業管理者に 【作成中】求人 の情報更新依頼を行う。 クライアント企業 2 依頼を受け、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 3 クライアント企業向け管理画面の教室管理ページから教室名等で検索の上、編集したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 クライアント企業管理者 4 クライアント企業向け管理画面の求人管理ページから 【作成中】求人 および紐づく求人情報を編集・保存する。 クライアント企業管理者 5 保存された 【作成中】求人 および紐づく求人情報をサービスサイトの教室一覧ページ及び求人詳細ページに表示する。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の編集が完了する。 クライアント企業管理者 求人編集フロー（全体管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、全体管理者に 【作成中】求人 の 情報更新依頼 を行う。 クライアント企業 2 依頼を受け、全体管理画面にログインを行う。 全体管理者 3 全体管理画面の教室管理ページから教室名等で検索の上、編集したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 全体管理者 4 全体管理画面の求人管理ページから 【作成中】求人 および紐づく求人情報を編集・保存する。 全体管理者 5 保存された 【作成中】求人 および紐づく求人情報をサービスサイトの教室一覧ページ及び求人詳細ページに表示する。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の編集が完了する。 全体管理者 求人非掲載 求人 非掲載 フロー（クライアント企業管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、 【作成中】求人 の非掲載依頼を行う。 クライアント企業 2 依頼を受け、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 3 クライアント企業向け管理画面の教室管理ページから教室名等で検索の上、非掲載にしたい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 クライアント企業管理者 4 クライアント企業向け管理画面の求人管理ページから対象の 【作成中】求人 の非掲載操作を行う。 クライアント企業管理者 5 対象の 【作成中】求人 をサービスサイト上の検索対象外とする。 【作成中】求人 のURLに直接アクセスを行った場合も、掲載の終了した旨のメッセージを表示し、 【作成中】求人 情報は表示しない。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の非掲載が完了となる。 クライアント企業管理者 求人非掲載フロー（全体管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、 【作成中】求人 の非掲載依頼を行う。 クライアント企業 2 依頼を受け、全体管理画面にログインを行う。 全体管理者 3 全体管理画面の教室管理ページから教室名等で検索の上、非掲載にしたい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 全体管理者 4 全体管理画面の求人管理ページから対象の 【作成中】求人 の非掲載操作を行う。 全体管理者 5 対象の 【作成中】求人 をサービスサイト上の検索対象外とする。 【作成中】求人 のURLに直接アクセスを行った場合も、掲載の終了した旨のメッセージを表示し、 【作成中】求人 情報は表示しない。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の非掲載が完了となる。 全体管理者 求人削除 求人 削除 フロー（クライアント企業管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、 【作成中】求人 の削除依頼を行う。 クライアント企業 2 依頼を受け、クライアント企業向け管理画面にログインを行う。 クライアント企業管理者 3 クライアント企業向け管理画面の教室管理ページから教室名等で検索の上、削除したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 クライアント企業管理者 4 クライアント企業向け管理画面の求人管理ページから対象の 【作成中】求人 の削除操作を行う。 クライアント企業管理者 5 対象の 【作成中】求人 をサービスサイト上の検索対象外とする。 【作成中】求人 のURLに直接アクセスを行った場合も、 404エラーページ を表示し、 【作成中】求人 情報は表示しない。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の削除が完了となる。 クライアント企業 求人削除フロー（全体管理者） 番号 内容 誰が 1 本システム外の連絡手段を用いて、 【作成中】求人 の削除依頼を行う。 クライアント企業 2 依頼を受け、全体管理画面にログインを行う。 全体管理者 3 全体管理画面の教室管理ページから教室名等で検索の上、削除したい 【作成中】求人 の親にあたる 【作成中】教室 を探す。 全体管理者 4 全体管理画面の求人管理ページから対象の 【作成中】求人 の削除操作を行う。 全体管理者 5 対象の 【作成中】求人 をサービスサイト上の検索対象外とする。 【作成中】求人 のURLに直接アクセスを行った場合も、 404エラーページ を表示し、 【作成中】求人 情報は表示しない。 本システム 6 本システム外の連絡手段を用いて対応の完了をクライアント企業に連絡し、 【作成中】求人 の削除が完了となる。 全体管理者 帳票 求人フォーマット（本システム外） 【作成中】教室 【作成中】求人 メール なし 関連用語 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E3%82%B5%E3%82%A4%E3%83%88 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E6%9C%AC%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%B5%E3%82%A4%E3%83%88%E9%81%8B%E5%96%B6%E8%80%85 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E5%85%A8%E4%BD%93%E7%AE%A1%E7%90%86%E8%80%85 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E5%85%A8%E4%BD%93%E7%AE%A1%E7%90%86%E7%94%BB%E9%9D%A2 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E7%AE%A1%E7%90%86%E8%80%85 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927116#%E3%82%AF%E3%83%A9%E3%82%A4%E3%82%A2%E3%83%B3%E3%83%88%E4%BC%81%E6%A5%AD%E5%90%91%E3%81%91%E7%AE%A1%E7%90%86%E7%94%BB%E9%9D%A2",
  "parentId": "666927138",
  "parentTitle": "ワークフロー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/686653475/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-04-05T07:24:27.403Z",
  "author": "ejiri_yusuke",
  "excerpt": "1 7 概要 クライアント企業から提供された情報をもとに、全体管理者とクライアント企業管理者が求人登録・公開を行うまでの流れ。および、求人の公開・掲載の停止を行うまでの流れ。 ※特に記載がない箇所の連絡・送付手段はすべて「本サイト外の連絡手段」とする。 留意点 本フローに登場する以下用語は定義がやや複雑である。そのため、以下資料を事前に確認の上フローを読み進めること。 ワード・ディフィニション に..."
}