{
  "id": "697958401",
  "title": "【FIX】オファー候補会員検索条件（パーソナルオファー）",
  "content": "1. 概要 クライアント企業向け管理画面にて、パーソナルオファーの 送信先となる会員の候補を検索するための検索条件。 1企業あたり、30件まで保存することができる。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 帳票 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 検索条件番号 personal_offer_user_filter_number 数値 自然数 変更不可 新規登録時に、システムで一意に発行する連番。 2 検索条件名 文字列 テキストボックス 100文字以下 共通要件 の定義に従う。 3 企業番号 数値 自然数 指定の番号の 【FIX】企業：基本情報 が存在すること パーソナルオファーの送信先となる会員の候補を検索するための検索条件作成時に企業情報を紐付ける。 4 都道府県 &nbsp; 単一選択 セレクトボックス &nbsp; 都道府県 を参照する。 共通要件 の定義に従う。 5 市区町村 複数選択 チェックボックス &nbsp; 共通要件 の定義に従う。 6 年齢：最少年齢 数値 セレクトボックス 自然数 16 ~ 70 7 年齢：最高年齢 数値 セレクトボックス 自然数 16 ~ 70 8 性別 単一選択 セレクトボックス 【FIX】会員：プロフィール情報 を参照する。 「男性」「女性」から選択する。 9 文理 単一選択 セレクトボックス 【FIX】会員：学歴情報 を参照する。 「文系」「理系」「その他」から選択する。 10 現在の職業 複数選択 チェックボックス &nbsp; 【FIX】会員：プロフィール情報 を参照する。 共通要件 の定義に従う。 11 学年 複数選択 チェックボックス 【FIX】会員：学歴情報 を参照する。 「学部1年生」「学部2年生」「学部3年生」「学部4年生」「学部5年生」「学部6年生」「修士1年生」「修士2年生」「博士1年生」「博士2年生」「博士3年生」「中退」「卒業」から選択する。 12 学歴：大学情報：入試区分 単一選択 セレクトボックス 【FIX】会員：学歴情報 を参照する。 「一般入試」「指定校推薦」「一般推薦」「AO受験」「その他」から選択する。 13 学歴：大学情報：所在地 単一選択 セレクトボックス 都道府県 を参照する。 共通要件 の定義に従う 14 学歴：大学情報：学校名 文字列 テキストボックス 100 文字以下 共通要件 の定義に従う 15 学歴：大学情報：所属学部 文字列 テキストボックス 100 文字以下 共通要件 の定義に従う 16 学歴：大学情報：所属学科 文字列 テキストボックス 100 文字以下 共通要件 の定義に従う 17 センター受験科目 複数選択 チェックボックス センター試験科目 を参照する。 18 その他：留学経験：時期 複数選択 チェックボックス 「中学時」「高校時」「大学時」から選択する。 19 その他：高校受験経験 真偽値 チェックボックス 20 その他：中学受験経験 真偽値 チェックボックス 21 指導可能科目 ：小学生 複数選択 チェックボックス 指導可能科目 を参照する。 「小学生（補習）」「小学生（中学受験）」から選択する。 22 指導可能科目 ：中学生 複数選択 チェックボックス 指導可能科目 を参照する。 「中学生（補習）」「中学生（受験）」から選択する。 23 指導可能科目 ：高校生 複数選択 チェックボックス 指導可能科目 を参照する。 「高校生（補習）」「高校生（受験）」から選択する。 24 指導可能科目：その他 複数選択 チェックボックス 指導可能科目 を参照する。 25 指導経験 ：指導学年 複数選択 チェックボックス 【FIX】会員：指導経験 を参照する。 26 指導経験 ： 指導年数 単一選択 セレクトボックス 【FIX】会員：指導経験 を参照する。 「なし」「3ヶ月以上」「6ヶ月以上」「1年以上」「2年以上」「5年以上」「10年以上」から選択する。 27 希望勤務地：都道府県 単一選択 セレクトボックス 【レビュー中】会員：設定情報（希望条件） を参照する。 28 希望勤務地：市区町村 複数選択 チェックボックス 【レビュー中】会員：設定情報（希望条件） を参照する。 29 勤務条件・雇用形態：勤務条件：週の勤務可能頻度 単一選択 セレクトボックス 「週1日以上」「週2日以上」「週3日以上」「週4日以上」「週5日以上」「未定」から選択する。 30 勤務条件・雇用形態：勤務条件：勤務可能曜日 複数選択 チェックボックス 「月曜日」「火曜日」「水曜日」「木曜日」 「金曜日」「土曜日」「日曜日」から選択する。 31 希望雇用形態 複数選択 チェックボックス 【レビュー中】会員：設定情報（希望条件） を参照する。 「アルバイト」「正社員」「契約社員」「派遣」「紹介予定派遣」「業務委託」から選択する。 32 希望職種 複数選択 チェックボックス 【レビュー中】会員：設定情報（希望条件） を参照する。 「集団指導（10名以上）」「グループ指導（10名以下）」「個別指導」「チューター・担任助手」「教材作成」「事務スタッフ」「試験監督」「教室長」「専任講師」「管理職候補」「家庭教師」「学校教員（常勤）」「学校教員（非常勤）」「その他」から選択する。 33 希望勤務期間 複数選択 チェックボックス 【レビュー中】会員：設定情報（希望条件） を参照する。 34 勤務条件・雇用形態：雇用形態：希望給与：時給 単一選択 セレクトボックス 「時給1,000円未満」「時給1,500円未満」「時給2,000円未満」「時給2,500円未満」「時給3,000円未満」「時給5,000円未満」から選択する。 35 勤務条件・雇用形態：雇用形態：希望給与：日給 単一選択 セレクトボックス 「日給8,000円未満」「日給10,000円未満」から選択する。 36 勤務条件・雇用形態：雇用形態：希望給与：月給 単一選択 セレクトボックス 「月給220,000円未満」「月給250,000円未満」「月給300,000円未満」から選択する。 37 アクセス情報：閲覧履歴 真偽値 チェックボックス trueの場合、選択した教室を3ヶ月以内に閲覧した事がある会員を抽出する 38 アクセス情報：キープリスト 真偽値 チェックボックス trueの場合、選択した教室を閲覧し、「キープリストに入れる」と登録した会員を抽出する 39 アクセス情報：最終ログイン日時 単一選択 セレクトボックス &nbsp; 「3ヶ月以内（90日）」「2ヶ月以内（60日）」「1ヶ月以内（30日）」「2週間以内（14日）」「1週間以内（7日）」から選択する。 40 【作成中】帳票共通項目 で定める項目を持つ。 41 【作成中】帳票共通項目 で定める項目を持つ。 42 【作成中】帳票共通項目 で定める項目を持つ。 43 【作成中】帳票共通項目 で定める項目を持つ。 44 【作成中】帳票共通項目 で定める項目を持つ。 45 【作成中】帳票共通項目 で定める項目を持つ。 4. 関連要件定義 本帳票が利用（作成、更新、参照、削除）される要件定義ページへのリンクです。 5. 関連チケット 本帳票の定義に関する議論や経緯を確認するためのJiraチケットへのリンクです。",
  "parentId": "698581058",
  "parentTitle": "■オファー",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/697958401/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-02T10:18:53.793Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 クライアント企業向け管理画面にて、パーソナルオファーの 送信先となる会員の候補を検索するための検索条件。 1企業あたり、30件まで保存することができる。 2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 帳票 項目名 変数名 値の形式 画面上の入力形式 制限とエラーメッセージ 説明・プレースホルダー 1 検索条件番号 personal_offer_user_filt..."
}