{
  "id": "703627373",
  "title": "012_【FIX】求人詳細閲覧機能",
  "content": "1. 1. 目次 2. 概要 本機能はエンドユーザーが 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の 登録済みの求人情報詳細データ1件を閲覧するための機能です。 3. 要求事項 ログイン状態に関わらずエンドユーザーは、 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 で登録した求人情報詳細を閲覧することができる。 各セクションの詳細は本ページの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.1.-%E6%B1%82%E4%BA%BA%E6%A6%82%E8%A6%81 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.2.-%E6%B1%82%E4%BA%BA%E6%83%85%E5%A0%B1 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.3.-%E3%81%93%E3%81%AE%E6%B1%82%E4%BA%BA%E3%81%AE%E6%95%99%E5%AE%A4%E6%83%85%E5%A0%B1 を参照。 画面下部に常に「キープする」ボタンと「応募画面へ進む」ボタンを追従させる。 各セクションの内容は、塾講師ステーション、塾講師ステーションキャリアに共通の内容であることを前提とし、固有の特記事項がある場合のみ記載する。 ただし表示対象が非掲載の求人の場合は、「［求人タイトル］の求人情報は掲載終了致しました。」とのみ表示し、noindex属性を付与する。 この場合、「総合TOPに戻る」ボタンを表示し、押下すると 【FIX】001_全体トップ に遷移する。 また求人の教室の公開フラグが「非公開」の場合も、noindexを付与する。 会員が求人詳細画面を表示した場合 、 【作成中】求人閲覧データ を保存する。 URLは、ステーション求人の場合は/job/xxx、キャリア求人の場合は/ca/job/xxxとする。 パンくずリスト ステーション：塾講師バイトTOP &gt; ＄都道府県名＄の塾講師バイト求人 &gt; ＄市区町村名＄の塾講師バイト求人 &gt; ＄教室名＄（＄求人タイトル＄） キャリア：塾講師ステーションTOP &gt; 塾講師の正社員求人TOP &gt; ＄都道府県名＄の塾講師正社員求人 &gt; ＄市区町村名＄の塾講師正社員求人 &gt; ＄教室名＄（＄求人タイトル＄） 3.1. 求人概要 本ページの 「要件定義」-「出力」 - 「求人概要」欄 で出力先として「画面」が定義されている項目を表示する。 「キープする」ボタン 押下すると 013_【FIX】求人キープ機能 を非同期処理で実行し、画面遷移は伴わない。 「応募画面へ進む」ボタン 押下すると 014_【FIX】求人応募機能 に遷移する。 3.2. 求人情報 この部分がページの上部に達すると、ヘッダーメニューを表示しそれをページ上部に固定する（スティッキーな挙動とする）。 うち、「 ページ上部へ 」を押下するとページTOPに移動する うち、「求人詳細へ」を押下すると求人詳細部分へ移動する うち、 「この塾の口コミへ」 を押下すると「バイト評判・口コミ総合満足度」へ移動する。 求人詳細 本ページの 「要件定義」-「出力」 - 「求人情報」欄 で 出力 先として「画面」が定義されている項目を表示する。 「キープする」ボタン https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.1.-%E6%B1%82%E4%BA%BA%E6%A6%82%E8%A6%81 の「2. 「キープする」ボタン」参照。 「応募画面へ進む」ボタン https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.1.-%E6%B1%82%E4%BA%BA%E6%A6%82%E8%A6%81 の「3. 「応募画面へ進む」ボタン」参照。 同一教室グループの別教室の求人一覧 同じ 教室グループ の別教室の求人をPC画面では 4件、SP画面では2件 表示する。 タイトルは「[教室グループ名]の求人一覧」とする。 タイトル右側の「一覧へ」テキストリンクを押下すると、 該当の教室グループで絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 表示中の求人と同じ市区町村にある同じ教室グループの別の教室からランダムで4つの教室を選び、それぞれの求人の中で更新日時の最新のものを1つずつ、計4つ表示する（SPでは2つ）。もし同じ市区町村に教室が4つない場合は、都道府県から同じ条件で4つ（SPでは2つ）の求人を表示する。表示の並び順は 更新日時 の降順とし、並べ替え機能は不要とする。更新日時が同一の場合は作成日時の降順とする。 表示項目は本ページの 「要件定義」-「出力」 - 「同一教室グループの別教室の求人一覧」欄 で出力先として「画面」が定義されている項目を表示する。 教室カード全体をリンクとし、教室カードを押下すると該当の 012_【FIX】求人詳細閲覧機能 に遷移する。 あなたにおすすめの求人 トモノカイ様がナビプラスやKarteを使用して対象求人を差し込む。本システムで行うことはなし。 同じ最寄り駅の急募求人はこちら 同じ最寄り駅の急募求人を最大で4件表示する。 表示の並び順は 更新日時 の降順とし、並べ替え機能は不要とする。更新日時が同一の場合は作成日時の降順とする。 表示項目 は本ページの 「要件定義」-「出力」 - 「同じ最寄り駅の急募求人はこちら」欄 で出力先として「画面」が定義されている項目を表示する。 教室カード全体をリンクとし、教室カードを押下すると該当の 012_【FIX】求人詳細閲覧機能 に遷移する。 3.3. この求人の教室情報 バイト評判・口コミ総合満足度 「塾講師満足度とは」テキストリンクを押下すると、 ポップアップ画面 にて講師満足度の説明画面が表示される。 本ページの 「要件定義」-「出力」 - 「バイト評判・口コミ総合満足度」欄 で出力先として「画面」が定義されている項目を表示する。 バイト評判・口コミ総合満足度が1項目も登録されていない場合は、「 十分な口コミデータが溜まっていないため表示できません。 」と表示され、「「 塾講師満足度とは」テキストリンク 」のみが表示される。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合、本セクション自体を表示しない。 口コミ総合満足度はキャリアでは表示しない。 評判・口コミ 032_【FIX】口コミ登録機能 で登録された現在閲覧している求人の教室に紐づく口コミが最大5件、更新日時の降順で表示される。 表示項目は本ページの「要件定義」-「出力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#4.3.3.3.-%E8%A9%95%E5%88%A4%E3%83%BB%E5%8F%A3%E3%82%B3%E3%83%9F ）で出力先として「画面」が定義されている項目を表示する。 口コミ本文は、PC表示の場合には3行を超えて4行目まで表示される際に、本文の右下に「全文表示」というテキストリンクを表示する。SP表示の場合も同様に、5行を超えて6行目まで表示される際に「全文表示」リンクを表示するものとする。このリンクを押下すると、口コミの全文を表示するポップアップ画面が表示される。 「口コミをもっと見る」テキストリンクを押下すると該当の教室の 031_【FIX】 口コミ一覧閲覧機能 に遷移する。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合、本セクション自体を表示しない。 口コミはキャリアでは表示しない。 オシゴトQ&amp;A 「求人について質問する」ボタンを押下すると、 082_【FIX】オシゴトQ＆A登録機能 に遷移する。 今まであった質問と教室からの回答 【FIX】企業：設定情報（クライアント企業向け） にて、「オシゴトQ&amp;A機能表示フラグ」がオフの場合はこの部分は表示しない。 【作成中】オシゴトQ＆A に 登録されている質問と回答が 最大 デフォルトでは最新の5件が表示される。 登録が無い場合は機能説明の部分を開いた状態で表示する。 1件でも登録がある場合は機能説明の部分を閉じた状態で表示し、オシゴトQ&amp;Aとはボタンを押すと開く。 もっと見るボタンを押すと、追加で5件を表示する。全て表示されるまでもっと見るボタンは表示される。 表示項目は本ページの 「要件定義」-「出力」 - 「オシゴトQ＆A」欄 で出力先として「画面」が定義されている項目を表示する。 ただし 【作成中】オシゴトQ＆A にて「性別職業非公開フラグ」がオンであれば性別と職業は非公開とする。 表示の並び順は 【作成中】オシゴトQ＆A評価 の 評価人数の降順とし 並べ替え機能は不要とする。評価人数が同一のものについては更新時間の降順とする。 参考にするボタンを押下すると 【作成中】オシゴトQ＆A評価 を1件新規登録し、また 【作成中】オシゴトQ＆A の「参考になった人数」を更新する。 ページを閲覧しているユーザーが表示中の求人を「参考になった」と評価していればボタンを非活性にする。 一覧はアコーディオンメニューになっており、各質問文章全体が開閉リンクになっている。各質問の文章リンクを押下することで、回答が表示され閲覧することができる。また開閉アイコンボタンを押下することで回答の 表示／非表示の切り替えができる 。 塾別比較チャート 表示項目は本ペ ージの 「要件定義」-「出力」 - 「塾別比較チャート」欄 で出力先として「画面」が定義されている項目を表示する。 教室の雰囲気 表示項目は本ペ ージの 「要件定義」-「出力」 - 「教室の雰囲気」欄 で出力先として「画面」が定義されている項目を表示する。 ボタン群 「キープする」ボタン https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.1.-%E6%B1%82%E4%BA%BA%E6%A6%82%E8%A6%81 の「2. 「キープする」ボタン」参照。 「応募画面へ進む」ボタン https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#3.1.-%E6%B1%82%E4%BA%BA%E6%A6%82%E8%A6%81 の「3. 「応募画面へ進む」ボタン」参照。 関連求人ワードから探す 表示項目は本ペ ージの 「要件定義」-「出力」 - 「関連求人ワード」欄 で出力先として「画面」が定義されている項目を表示する。 ステーション、キャリアの両方で表示する。 近隣の市区町村の求人から探す SP画面ではアコーディオンとし、初期状態は閉じている。 ステーションの場合 近隣の市区町村を閲覧している求人の都道府県内の都市の中で、求人が最も多い都市の求人該当求人に紐づいている教室の市区町村から隣接している市区町村上位5件（ただし求人が1つ以上ある市区町村とする）と を5つ列挙 し、 該当求人に紐づいている教室の所在地（都道府県および市区町村）を基点とし、当該都道府県内に存在する全教室との距離を各教室の緯度・経度情報から算出する。そのうえで、対象教室に最も近く、かつ市区町村が異なる教室を距離の近い順に5件抽出（ただし求人が1つ以上ある市区町村とし、対象教室の属する市区町村は除く）し、各教室の該当市区町村名を表示する。 それぞれを「 ＃[市区町村]の塾講師 求人 バイト 」というタグでテキストリンクとして表示する。押下するとその条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 キャリアの場合 近隣の市区町村を閲覧している求人の都道府県内の都市の中で、求人が最も多い都市の求人を5つ列挙 し、 該当求人に紐づいている教室の所在地（都道府県および市区町村）を基点とし、当該都道府県内に存在する全教室との距離を各教室の緯度・経度情報から算出する。そのうえで、対象教室に最も近く、かつ市区町村が異なる教室を距離の近い順に5件抽出（ただし求人が1つ以上ある市区町村とし、対象教室の属する市区町村は除く）し、各教室の該当市区町村名を表示する。 それぞれを「 ＃[市区町村]の塾講師 求人 正社員求人 」というタグでテキストリンクとして表示する。押下するとその条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 ステーション、キャリアの両方で表示する。 近隣の駅の求人から探す SP画面ではアコーディオンとし、初期状態は閉じている。 ステーションの場合 近隣の駅（最寄り駅を除く）を5つ列挙閲覧している 求人の都道府県内の駅の中で、求人が最も多い駅が最寄駅である求人 を5つ列挙該当求人に紐づいている駅から隣接している駅上位5件（ただし求人が1つ以上ある駅とする）と し、 該当求人に紐づいている教室の緯度経度情報をもとに教室からの距離が近い順に上位5駅を抽出・表示（ただし求人が1つ以上ある駅とし、対象教室に設定されている最寄り駅1〜3は除外する）する。 それぞれを「 ＃[最寄り駅]駅の塾講師バイト 」というタグでテキストリンクとして表示する。押下するとその条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 キャリアの場合 近隣の駅（最寄り駅を除く）を5つ列挙閲覧している求人の都道府県内の駅の中で、求人が最も多い駅が最寄駅である求人を5つ列挙 し、 該当求人に紐づいている教室の緯度経度情報をもとに教室からの距離が近い順に上位5駅を抽出・表示（ただし求人が1つ以上ある駅とし、対象教室に設定されている最寄り駅1〜3は除外する）する。 それぞれを「 ＃[最寄り駅]駅の塾講師 求人 正社員求人 」というタグでテキストリンクとして表示する。押下するとその条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 ステーション、キャリアの両方で表示する。 市区町村の求人を特徴から探す SP画面ではアコーディオンとし、初期状態は閉じている。 タイトルは「[市区町村]の求人と特徴から探す」とする。 以下の条件のうちからランダムで5つ選び、それぞれを「 ＃[市区町村]の[条件] 」（例えば＃渋谷区の個別指導、など）というタグでテキストリンクとして表示する。押下するとその市区町村および条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 市区町村&times;指導形態 市区町村&times;勤務日数 市区町村&times;勤務条件 ステーション、キャリアの両方で表示する。 家庭教師求人から探す SP画面ではアコーディオンとし、初期状態は閉じている。 近隣の市区町村を5つ列挙し、それぞれを 「＃[エリア情報]の家庭教師求人」 というタグでテキストリンクとして表示する。押下するとその市区町村および雇用形態で「家庭教師」を含む条件で絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を別タブで表示する。 ステーション、キャリアの両方で表示する。 教室からのひとこと 、プラスワン情報 表示項目は本ペ ージの 「要件定義」-「出力」 - 「教室からのひとこと、プラスワン情報」欄 で出力先として「画面」が定義されている項目を表示する。 社員やプロ講師などの求人をお探しの方はこちら 塾講師ステーションに紐づく求人の場合は、「キャリアTOP」ボタンを押下すると、 002_【FIX】キャリアトップ に遷移する。 塾講師ステーションキャリアに紐づく求人の場合は、 【FIX】001_全体トップ に遷移するリンクになる。 会社情報 表示項目は本ページの 「要件定義」-「出力」 - 「会社情報」欄 で出力先として「画面」が定義されている項目を表示する。 3.4. 権限 ログインしているかいないかに関わらずエンドユーザーおよび会員が閲覧できる。 3.5. 帳票 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】教室：ロゴ・スライド画像 【FIX】教室：基本情報／所在地 【FIX】教室：塾チャート 【FIX】口コミグループ 【FIX】口コミ 【作成中】オシゴトQ＆A 3.6. メールテンプレート なし 3.7. ワークフロー 3.7.1. 本機能 なし 3.7.2. 関連 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 求人詳細 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=17795-2431&amp;mode=design&amp;t=nNGKeXn4IsP0o8BE-0 4.1.2. 塾講師満足度とは説明ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=43944-3834&amp;mode=design&amp;t=fp6ZSgHVGx5624vp-4 4.1.3. 非掲載時のエラー画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=53927-28116&amp;mode=design&amp;t=7sjDp1EpuAxumkMr-4 4.2. 入力 項目名 変数名 入力元 説明 バリデーション 求人ID id url urlから求人IDを取得する。 求人IDがURLに存在しない場合は404ページを表示する。 存在しない求人IDを渡された場合404ページを表示する。 空文字でないか 数字であるか 自然数であるか 求人マスタ存在チェック 4.3. 出力 説明は、 【FIX】企業：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 【FIX】口コミグループ 【FIX】口コミ の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 求人概要 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 【FIX】口コミ 参照。 出力項目 出力先 説明 1 更新日 画面 求人情報が最後に更新された日付をyyyy/mm/dd形式で表示する。 2 教室ロゴ画像 画面 保存された 【作成中】教室画像 の「ロゴ」を表示する。 登録された画像のアスペクト比（縦横比）を維持したまま表示する。表示領域のサイズに対して、画像が縦横比を崩さず収まるように縮小され、表示領域内で余白が生じる場合は、背景色で補完される。 3 新着/急募 画面 下記条件により、「新着」または「急募」を表示する。なおどちらにも該当しない場合は表示されない。 新着求人表示 掲載から2週間未満の求人は新着求人とする。 掲載日時が7日前より後で、かつ非掲載日時がないか非掲載日時から7日以上経っている。 急募求人設定がされている場合は、急募求人表示が優先される。 急募求人表示 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在する場合 4 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 5 教室名 画面 保存された「教室名」を適切にHTMLエスケープして表示する。 ページ内の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#4.3.3.-%E3%81%93%E3%81%AE%E6%B1%82%E4%BA%BA%E3%81%AE%E6%95%99%E5%AE%A4%E6%83%85%E5%A0%B1 への テキストリンク（アンカーリンク） とする。 6 この塾ブランドの平均満足度 画面 保存された該当の教室の教室グループの各口コミ項目（ 段取り、勤務環境、面接・説明会、研修 ）の総和を総項目数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値をもとに5つの星オブジェクトで表示する。うち算出された 値 を 濃い色 で表示し、残りを薄い色で表示する。 平均満足度が登録されていない場合は、「[星オブジェクト_薄い色✕5]---（---票）」と表示する。 「口コミを詳しく見る」テキストリンクを押下すると、該当の教室グループの 031_【FIX】 口コミ一覧閲覧機能 に遷移する。 口コミが登録されていない場合は表示しない。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合、（平均満足度も口コミのテキストリンクも）表示しない。 キ ャリアの場合は表示しない 7 スライド画像 画面 保存された 【作成中】教室画像 の「スライドイメージ」を最大5枚表示する。 スライド画像が1枚も登録されていない場合は、「No Image」の画像が表示される。 下部のサムネイルは自動でスライドし上部に大きく表示されるが、下部のサムネイルをクリックして手動でも切り替えることができる。 ページが表示された時点では、サムネイルの一番左の画像を大きく表示する。 スライダーの枠を埋めるように、画像の縦横比を維持したまま画像サイズを 調整・縮小 し中央寄せで表示する。その結果として画像の上下または左右の部分がスライダーの枠からはみ出た場合、その部分は表示しない（スライダーの枠でトリミングする）。 8 スライド画像：説明文 画面 スライド上部に大きく表示されたスライド画像の保存された「スライド画像：説明文」を適切にHTMLエスケープ処理をしてスライド画像下部に表示する。 9 給与 画面 保存された「給与情報」を、「1 [給与形態][給与形態：授業、コマ]分[給与：最低時給]円〜[給与：最高時給]円 」形式の文字列で表示する。 給与形態の後には、給与形態が授業の場合は授業、コマの場合はコマと文言を入れる。 10 指導形態 画面 保存された「指導形態」を文字列で表示する。 複数登録されていた場合は 句読点 で区切って全て表示する。 11 雇用形態 画面 保存された「雇用形態」を文字列で表示する。 12 エリア 画面 「[都道府県][市区町村]（[最寄り駅名：最寄り駅1：駅名]）駅より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]分」形式の適切にHTMLエスケープして表示する。 最寄り駅が未登録の場合は最寄り駅以降は表示されない。 「[都道府県][市区町村]」をテキストリンクとして表示し、押下すると該当の 市区町村に絞られた 011_【作成中】求人一覧閲覧・検索機能 に遷移する 。 「（[最寄り駅名： 最寄り駅1 ：駅名]）駅」をテキストリンクとして表示し、押下すると該当の 最寄り駅に絞られた 011_【作成中】求人一覧閲覧・検索機能 に遷移する 。 最寄り駅が複数登録されていた場合は、「最寄り駅1」に登録されたものを表示する。 13 シフト 画面 保存された「勤務条件」「勤務可能最低日数」を「[勤務条件]／[勤務可能最低日数]」形式の文字列で表示する。 「勤務条件」のうち、「平日のみOK」「週末のみOK」「夕方（16時）からの勤務歓迎」「夜（18時）からの勤務歓迎」「曜日固定ナシ」の項目を表示する。 「勤務条件」「勤務可能最低日数」が全て未登録の場合は表示されない。 「勤務条件」 「勤務可能最低日数」 が複数登録されていた場合は「／」で連結して全て表示する。 14 勤務時間 画面 「平日：[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）] 、 土曜日：[勤務時間：土曜（開始時間）][勤務時間：土曜（終了時間）]、日曜日：[勤務時間：日曜（開始時間）][勤務時間：日曜（終了時間）]」形式の文字列で表示する。 「勤務時間」が全て未登録の場合は表示されない。 時間が入力された曜日は句読点で連結して全て表示し、00:00〜00:00と入力された曜日は表示しない。 15 メッセージ 教室PRタイトル 画面 保存された「 メッセージ 教室PRタイトル」を適切にHTMLエスケープして表示する。 16 教室PR情報 画面 保存された「 メッセージ 教室PR情報」を適切にHTMLエスケープして表示する。 200 100文字を超える場合は 200 100文字以上の部分を「・・・▼もっと読む」と表示し、押下すると残りの文字を表示する。 4.3.2. 求人情報 4.3.2.1. 求人情報詳細 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 参照。 出力項目 出力先 説明 1 新着/急募 画面 出力＞4.3.1. 求人概要の新着/急募の説明に同じなためそちらを参照。 2 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 3 タグ 画面 保存されている「指導特徴」「PR情報：塾の特徴」を全て表示する。 4 採用お祝い 画面 それぞれの求人のお祝い金の金額を「［お祝い金額］分」と表示する。 登録がない場合は以下のデフォルトの表示をする。 塾講師ステーションに紐づく求人の場合は「5,000円分」。 塾講師ステーションキャリアに紐づく求人で採用お祝いの対象である場合は「10,000円分」。 スポットプランおよびライトプランの教室の求人は採用お祝いの表示を非表示にする 5 雇用形態 画面 保存された「雇用形態」を、文字列で表示する。 6 給与 画面 保存された「給与情報」を、「[給与形態][給与形態：授業、コマ][給与：最低時給]〜[給与：最高時給]」「[給与：補足説明]」形式で適切にHTMLエスケープ処理をして文字列で表示する。 「給与形態」が「授業」または「コマ」でない場合、「給与形態：授業、コマ」を表示しない。 「[給与：補足説明]」が未登録の場合は「[給与：補足説明]」は表示されない。 「[給与：補足説明]」の前で改行する。 保存された「想定年収：最低」「想定年収：最高」「想定年収：補足説明」を、下記形式で適切にHTMLエスケープ処理をして文字列で表示する。 「想定年収：[想定年収：最低を万の位で切り捨てて万の位以上の桁を出力]万円〜[想定年収：最高を万の位で切り捨てて万の位以上の桁を出力]万円」 「[想定年収：補足説明]」 保存された昇給、賞与を、下記形式で適切にHTMLエスケープ処理をして文字列で表示する。 「昇給：[昇給]」 「賞与：[賞与]」 「[昇給]」が未登録の場合は「昇給：」は表示されない。 「[賞与]」が未登録の場合は「賞与：」は表示されない。 7 指導形態 画面 保存された「指導形態」を、「[指導形態]」「[指導形態：補足説明]」形式で適切にHTMLエスケープ処理をして文字列で表示する。 「[指導形態：補足説明]」が未登録の場合は「[指導形態：補足説明]」は表示されない。 「指導形態」が複数登録されていた場合は、 句読点 で連結して全て表示する。 「[指導形態：補足説明]」の前で改行する。 8 最寄り駅 画面 保存された「最寄り駅」を、「[最寄り駅名：最寄り駅1：駅名]駅より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]分」形式の文字列で表示する。「最寄り駅2」や「最寄り駅3」が登録されている場合はそれらも同様に表示する。 「最寄り駅1」も「最寄り駅2」も「最寄り駅3」も未登録の場合は表示されない。 「最寄り駅」の駅名はテキストリンクとし、押下すると 011_【作成中】求人一覧閲覧・検索機能 に遷移しその駅で絞り込んだ内容を表示する。 【FIX】教室：基本情報／所在地 の「アクセス方法」を表示する。 いずれかの最寄り駅から徒歩5分以内の場合は「駅から徒歩5分以内」とタグ を表示する。 9 勤務地 画面 保存された 教室の住所 を、「[都道府県][市区町村][町名・番地・建物名・部屋番号] [ 住所補足 ] [勤務地補足][勤務地]」形式の適切にHTMLエスケープして表示する。 勤務地補足はない場合は表示しない。 住所補足がない場合は住所補足を表示しない。 勤務地はタグ形式で表示する。 「[都道府県][市区町村]」箇所はテキストリンクとして表示し、押下すると該当の市区町村で絞られた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 住所補足と 勤務地補足 の前で改行する。 教室の住所を指定した Google Maps を埋め込んで表示する。 「地図で場所を確認する」ボタンを押下する事で保存された住所情報の周辺地図を表示する。 10 仕事内容 画面 保存された「仕事内容」を適切にHTMLエスケープして表示する。未登録の場合は項目自体が表示しない。 11 待遇 画面 保存された「待遇」を、「[待遇：補足説明]」「[待遇]」形式の文字列で表示する。 「[待遇]」はタグ形式で全て表示する。 登録されていない項目は表示されず、「待遇」「待遇：補足説明」がともに未登録の場合は項目自体を表示しない。 12 休日・休暇 画面 保存された「年間休日」「休日・休暇」「休日・休暇：補足説明」を、下記形式の文字列で表示する。 「年間休日：[年間休日]」 「[休日・休暇：補足説明]」 「[休日・休暇]」 「[休日・休暇]」はタグ形式で全て表示する。 13 勤務期間 画面 「[最低勤務期間]以上」「[最低勤務期間：補足説明]」 「[勤務条件]」 形式の適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「最低勤務期間」「最低勤務期間：補足説明」が全て未登録の場合は項目自体を表示しない。 「[勤務条件]」は 【FIX】求人：勤務条件・指導科目 の「勤務条件」のうち、「短期OK」「長期勤務歓迎」のうち登録されているものをタグ表示する。 「[最低勤務期間：補足説明]」、「[勤務条件]」の前でそれぞれ改行する。 14 勤務時間 画面 保存された「勤務時間」「勤務条件」を、「平日：[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）]」「[勤務時間：補足説明]」 「[勤務条件]」 形式の文字列で表示する。 登録されていない項目は表示されず、「勤務時間」「勤務時間：補足説明」が全て未登録の場合は項目ごと表示されず。 「勤務時間」が複数登録されていた場合は 句読点 で連結して全て表示する 「[勤務時間：補足説明]の前で改行する。 「[勤務条件]」は 【FIX】求人：勤務条件・指導科目 の「勤務条件」のうち、「夕方（16時）からの勤務歓迎」「夜（18時）からの勤務歓迎」のうち登録されているものをタグ表示する。 15 勤務曜日 画面 「[勤務可能曜日]」「[勤務可能曜日：補足説明]」 「[勤務条件]」「[勤務可能最低日数]」 形式の適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「勤務可能曜日」「勤務可能曜日：補足説明」が全て未登録の場合は項目ごと表示されず。 「[勤務可能曜日]」は複数登録されていた際は、句読点で連結して全て表示する。 「[勤務可能曜日：補足説明]」の前で改行する。 「[勤務条件]」は 【FIX】求人：勤務条件・指導科目 の「勤務条件」のうち、「平日のみOK」「週末のみOK」「曜日固定ナシ」のうち登録されているものをタグ表示する。 「[ 勤務可能最低日数] 」は 【FIX】求人：勤務条件・指導科目 の「勤務可能最低日数」をタグ表示する。 16 服装・髪型 保存された「服装規定」を、適切にHTMLエスケープして表示する。 保存された「服装・髪型」をタグ形式で全て表示する。 ともに未登録の場合は項目を表示しない。 17 指導学年 画面 保存された「指導学年」を、全て句読点で連結して文字列で表示する。 「指導学年」が未登録の場合は表示されず。 18 指導科目 画面 保存された「指導科目」「勤務条件」を、「小学生 [指導科目：小学生]」「中学生 [指導科目：中学生]」「高校生 [指導科目：高校生]」「その他 [指導科目： その他 ]」「その他の説明 [指導科目： その他：その他 ]」 「[勤務条件]」 形式の適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「指導科目」が未登録の場合は、項目自体を表示しない。 それぞれの学年の指導科目の前で改行する。 「[勤務条件]」は 【FIX】求人：勤務条件・指導科目 の「勤務条件」のうち、「複数教科指導歓迎」のうち登録されているものをタグ表示する。 19 研修 画面 保存された「研修情報」を、「研修期間（目安）：[研修期間]」「研修時の給与：[研修給与単位][研修給与金額]」「[研修給与補足：補足説明]」「[研修内容]」形式の適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「研修期間」「研修給与単位」「研修給与金額」「研修給与補足：補足説明」「研修内容」が全て未登録の場合は項目自体を表示しない。 「[研修時の給与：[研修給与単位][研修給与金額]]」、「[研修給与補足：補足説明]」、「[研修内容]」の前でそれぞれ改行する。 20 応募資格 画面 保存された「応募資格」を、「[応募資格]」「[応募資格：補足説明]」 「[勤務条件]」 形式の適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「応募資格」「応募資格：補足説明」が全て未登録の場合は項目自体を表示しない。 「[勤務条件]」はタグ表示し複数登録されている際は全て表示する。 「[応募資格]」は登録されている項目ごとに改行する。 「[応募資格：補足説明]」の前で改行する。 「[勤務条件]」は 【FIX】求人：応募条件・研修情報 の「応募資格」、および 【FIX】求人：勤務条件・指導科目 の「勤務条件」のうち「他塾かけもちOK」「他塾かけもち不可」「副業可」「副業不可」「在宅勤務可」のうち登録されているものをタグ表示する。 【FIX】求人：応募条件・研修情報 の「応募資格」を表示する対象サイトの区別は帳票を参照すること。 21 歓迎 画面 保存された「歓迎」を、「[歓迎]」 「[歓迎：補足説明]」 形式の文字列で、適切にHTMLエスケープして表示する表示する。 登録されていない項目は表示されず、「歓迎」「歓迎：補足説明」が全て未登録の場合は項目自体を表示しない。 「[歓迎]」は登録されている項目ごとに改行して表示する。 「[歓迎：補足説明]」の前で改行する。 22 備考 画面 保存された「備考」を適切にHTMLエスケープして表示する。未登録の場合は項目自体を表示しない。 23 こんな方に来てほしい 画面 保存された「こんな方に来てほしい」を適切にHTMLエスケープして表示する。未登録の場合は項目自体を表示しない。 SP画面では初期状態ではコンテンツを一部表示に抑え、「もっと見る」で押すと全文が表示されるようにする。 24 応募者への連絡方法 画面 保存された「応募者への連絡方法」を適切にHTMLエスケープして表示する。未登録の場合は、項目自体を表示しない。 25 選考方法 画面 保存された「選考方法」「選考方法：補足説明」を適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「選考方法」「選考方法：補足説明」が全て未登録の場合は項目自体を表示しない。 「選考方法」が複数登録されている場合は、全て句読点で連結して表示する。 「選考方法：補足説明」の前で改行する。 26 選考試験レベル 画面 27 面接での重視事項 画面 28 採用担当者 画面 保存された「採用担当者」「採用担当者メッセージ」を、適切にHTMLエスケープして表示する。 登録されていない項目は表示されず、「採用担当者」「採用担当者メッセージ」が全て未登録の場合は項目自体を表示しない。 「[採用担当者メッセージ]」の前で改行する。 ここから尾行までは、SP画面では初期状態ではコンテンツを一部表示に抑え、「もっと見る」で押すと全文が表示されるようにする。 29 面接地 画面 保存された「面接地」を適切にHTMLエスケープして表示する。未登録の場合は項目自体を表示しない。 30 備考 画面 保存された「応募後の流れ：補足説明」を適切にHTMLエスケープして表示する。未登録の場合は項目自体を表示しない。 31 この教室のその他求人 画面 現在閲覧している教室で、現在閲覧している求人以外に登録されている求人があれば最大2件表示する。 保存された「求人タイトル」「雇用形態」「指導形態」「給与」を、「[求人タイトル] [雇用形態]／[ 指導形態 ]／[給与形態][給与形態：授業、コマ][給与：最低時給]〜[給与：最高時給]」形式の適切にHTMLエスケープして表示する。 [求人タイトル]はテキストリンクとして表示し、押下すると該当の求人の​ 012_【FIX】求人詳細閲覧機能 に遷移する。 4.3.2.2. 同一教室グループ、別教室の求人 【FIX】求人：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 参照。 出力項目 出力先 説明 1 スライド画像 画面 保存された「スライドイメージ」 のうち「スライドイメージ（1）」を表示する。もしない場合は「スライドイメージ（2）」〜「スライドイメージ（5）」の優先度で最初にヒットしたものを表示する 。なお 「画像タイプ」としては「サムネイル用」として保存された画像を表示する 。 表示枠を埋めるように、画像の縦横比を維持したまま画像サイズを調整・縮小し中央寄せで表示する。その結果として画像の上下または左右の部分が表示枠からはみ出た場合、その部分は表示しない（表示枠でトリミングする）。 スライドイメージが1枚も登録されていない場合は、「No Image」の画像が表示される。 2 所在地 画面 求人に紐づく教室の「都道府県」を適切にHTMLエスケープして表示する。 3 教室名 画面 保存された 「教室グループ名」 「教室名」を適切にHTMLエスケープして表示する。 最大全角25文字まで表示され、26文字目に「&hellip;」が表示される。 4 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 最大全角29文字まで表示され、30文字目に「&hellip;」が表示される。 SP画面では非表示とする。 4.3.2.3. あなたにおすすめの求人 【FIX】求人：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 参照。 出力項目 出力先 説明 1 スライド画像 画面 保存された「スライドイメージ」のうち、 「画像タイプ」で「サムネイル用」として保存された画像からを表示する 。 表示枠を埋めるように、画像の縦横比を維持したまま画像サイズを調整・縮小し中央寄せで表示する。その結果として画像の上下または左右の部分が表示枠からはみ出た場合、その部分は表示しない（表示枠でトリミングする）。 スライド画像が1枚も登録されていない場合は、「No Image」の画像が表示される。 2 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 最大全角29文字まで表示され、30文字目に「&hellip;」が表示される。 最大全角25文字まで表示され、26文字目に「&hellip;」が表示される。 3 給与 画面 保存された項目値を「[求人タイトル] [雇用形態]／[指導形態]／[給与形態：授業、コマ][給与：最低時給]〜[給与：最高時給]」形式で適切にHTMLエスケープして表示する。 4 最寄り駅 画面 その求人に紐づく教室の最寄駅名を全て「、」区切りで表示する。 4.3.2.4. 同じ最寄駅の急募求人はこちら 【FIX】求人：基本情報 【FIX】教室：基本情報／所在地 【FIX】教室：ロゴ・スライド画像 参照。 出力項目 出力先 説明 1 スライド画像 画面 保存された「スライドイメージ」のうち、 「画像タイプ」で「サムネイル用」として保存された画像からを表示する 。 表示枠を埋めるように、画像の縦横比を維持したまま画像サイズを調整・縮小し中央寄せで表示する。その結果として画像の上下または左右の部分が表示枠からはみ出た場合、その部分は表示しない（表示枠でトリミングする）。 スライド画像が1枚も登録されていない場合は、「No Image」の画像が表示される。 2 所在地 画面 求人に紐づく教室の「都道府県」を適切にHTMLエスケープして表示する。 3 教室グループ名と教室名 画面 保存された「教室グループ名」と「教室名」を適切にHTMLエスケープして表示する。 最大全角25文字まで表示され、26文字目に「&hellip;」が表示される。 4 求人タイトル 画面 保存された「求人タイトル」を適切にHTMLエスケープして表示する。 最大全角29文字まで表示され、30文字目に「&hellip;」が表示される。 最大全角25文字まで表示され、26文字目に「&hellip;」が表示される。 5 給与 画面 保存された項目値を「[給与形態][給与形態：授業、コマ][給与：最低時給]〜[給与：最高時給]」形式で適切にHTMLエスケープして表示する。 6 最寄り駅 画面 保存された「最寄り駅」を「最寄り駅：[最寄り駅名]」形式で適切にHTMLエスケープして表示する。 その求人に紐づく教室の最寄駅名を全て「、」区切りで表示する。 4.3.2.5. 関連求人ワードから探す 出力項目 出力先 説明 1 雇用形態 画面 求人の全て の「雇用形態」をテキストリンクとして表示し、 押下すると、 同じ「市区町村」エリアで同じ条件が登録されている 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 2 指導形態 画面 求人の全ての「指導形態」をテキストリンクとして表示し、 押下すると、同じ「市区町村」エリアで同じ条件が登録されている 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 3 歓迎 画面 求人の全ての「歓迎」をテキストリンクとして表示し、 押下すると、同じ「市区町村」エリアで同じ条件が登録されている 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 4.3.3. この求人の教室グループ・教室情報 4.3.3.1. バイト評判・口コミ総合満足度 【FIX】教室：基本情報／所在地 【FIX】口コミ 参照。 出力項目 出力先 説明 1 教室グループ名 画面 保存された「教室グループ名」を適切にHTMLエスケープして表示する。 2 総合満足度 画面 保存された該当の教室グループの各口コミ項目（段取り、勤務環境、面接・説明会、研修）の総和を総項目数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値を表示する。 3 段取り 画面 保存された該当の教室グループの全ての「段取り」の口コミ数値の総和を総票数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値をもとにレーダーチャートに表示する。 4 勤務環境 画面 保存された該当の教室グループの全ての「勤務環境」の口コミ数値の総和を総票数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値をもとにレーダーチャートに表示する。 5 面接・説明会 画面 保存された該当の教室グループの全ての「面接・説明会」の口コミ数値の総和を総票数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値をもとにレーダーチャートに表示する。 6 研修 画面 保存された該当の教室グループの全ての「研修」の口コミ数値の総和を総票数で割り、小数点第二位の値まで平均値を算出する。 算出された平均値をもとにレーダーチャートに表示する。 7 レーダーチャート 画面 「段取り」「勤務環境」「面接・説明会」「研修」の口コミ平均値をレーダーチャートで表示する。 登録されていない項目は「---」形式で表示し、ゼロとしてカウントする。 4.3.3.2. 評判・口コミ 【FIX】口コミグループ と 【FIX】口コミ を参照。 出力項目 出力先 説明 1 口コミ項目名 画面 【FIX】口コミ の質問内容を適切にHTMLエスケープして表示する。 2 ユーザープロフィール画像 画面 男性/大学生、男性/既卒、女性/大学生、女性/既卒の4つの条件で切り替えて対応する画像を表示する。 投稿の際の職業が大学生、高校生(卒業見込み)、短大/専門学生、大学院生は大学生、それ以外は既卒とする。 3 性別 画面 口コミを投稿したユーザーの性別を表示する 4 現在の職業 画面 口コミを投稿したユーザーの 現在の職業 が 高校生〜大学院生の場合は「大学生」を表示し、それ以外の場合は「既卒」を表示する。 5 投稿日 画面 保存された「作成日時」をYYYY/MM/DDの形式で表示する。 6 口コミ文字列値 画面 保存された「口コミ文字列値」を適切にHTMLエスケープして表示する。 4.3.3.3. 今まであった質問と教室からの回答 【作成中】オシゴトQ＆A 参照。 出力項目 出力先 説明 1 質問 画面 求人に紐づく保存された「質問」を適切にHTMLエスケープして表示する。 2 質問日 画面 オシゴトQ＆Aの「質問日時」をYYYY/MM/DD形式で表示する。 3 参考になった人数 画面 そのオシゴトQ＆Aに紐づく 【作成中】オシゴトQ＆A評価 の総数を表示する。 【作成中】オシゴトQ＆A の「参考になった人数」の数を表示する。 4 回答 画面 求人に紐づく保存された「回答」を適切にHTMLエスケープして表示する。 5 回答日 画面 オシゴトQ＆Aの「回答日時」をYYYY/MM/DD形式で表示する。 6 回答者種別 画面 オシゴトQ＆Aの「回答者種別」に対応するラベル名を表示する。 4.3.3.4. 塾別比較チャート 【FIX】教室：塾チャート 【FIX】求人：PR情報 参照。 出力項目 出力先 説明 1 塾規模 画面 保存された「評価の数字」が示す 1〜5 までの位置を、星オブジェクトで表し、保存された「コメント」を適切にHTMLエスケープして表示する。 「コメント」が登録されていない場合は、「コメント」は表示されない。 「[コメント]小規模塾[星オブジェクト]大規模塾」形式で表示する。 2 服装・髪型 画面 保存された「評価の数字」が示す1〜 4 5までの位置を、星オブジェクトで表し、保存された「コメント」を適切にHTMLエスケープして表示する。 「コメント」が登録されていない場合は、「コメント」は表示されない。 「[コメント]かっちり[星オブジェクト]自由」形式で表示する。 3 未経験者歓迎 画面 保存された「評価の数字」が示す1〜 4 5までの位置を、星オブジェクトで表し、保存された「コメント」を適切にHTMLエスケープして表示する。 「コメント」が登録されていない場合は、「コメント」は表示されない。 「[コメント]未経験者[星オブジェクト]経験者」形式で表示する。 4 補習 ・受講 画面 保存された「評価の数字」が示す1〜 4 5までの位置を、星オブジェクトで表し、保存された「コメント」を適切にHTMLエスケープして表示する。 「コメント」が登録されていない場合は、「コメント」は表示されない。 「[コメント]補習[星オブジェクト]受験」形式で表示する。 5 生徒学年比較 画面 保存された「評価の数字」が示す1〜 4 5までの位置を、星オブジェクトで表し、保存された「コメント」を適切にHTMLエスケープして表示する。 「コメント」が登録されていない場合は、「コメント」は表示されない。 「[コメント]小学生[星オブジェクト]高校生」形式で表示する。 4.3.3.5. 教室の雰囲気 出力項目 出力先 説明 1 スライド画像 画面 保存された 【作成中】教室画像 の「その他」を最大10枚表示する。 スライド画像が1枚も登録されていない場合は、 「No Image」の画像が表示される 「教室の雰囲気」の項目ごと何も表示しない。 左右の矢印ボタンを押下すると1枚ずつその方向にカルーセルを動かす。先頭または末尾に達したらその方向に進むボタンを非活性化する。 カルーセルの枠を埋めるように、画像の縦横比を維持したまま画像サイズを 調整・縮小 し中央寄せで表示する。その結果として画像の上下または左右の部分がカルーセルの枠からはみ出た場合、その部分は表示しない 2 スライド画像：説明文 画面 保存された「スライド画像：説明文」を適切にHTMLエスケープして表示する。 4.3.3.6. 教室からのひとこと、プラスワン情報 出力項目 出力先 説明 1 教室からのひとこと 画面 保存された「教室からのひとこと：タイトル」と「教室からのひとこと：説明」を適切にHTMLエスケープして表示する。 未登録の場合は項目自体を表示しない。 SP画面では初期状態ではコンテンツを一部表示に抑え、「もっと見る」で押すと全文が表示されるようにする。 2 プラスワン情報 画面 保存された「プラスワン情報」を適切にHTMLエスケープして表示する。未登録の場合は項目自体を表示しない。 SP画面では初期状態ではコンテンツを一部表示に抑え、「もっと見る」で押すと全文が表示されるようにする。 4.3.3.7. 会社情報 【FIX】企業：基本情報 【FIX】教室：基本情報／所在地 参照。 出力項目 出力先 説明 1 会社情報（教室情報） 画面 保存された「企業名」を適切にHTMLエスケープして表示する。 【FIX】企業：設定情報（全体管理者向け） にて「教室情報表示フラグ」がオンの場合は、教室名を表示する。 2 所在地 画面 保存された「都道府県」「市区町村」「以降の住所」を、「[都道府県][市区町村][以降の住所]」形式の適切にHTMLエスケープして表示する。 【FIX】企業：設定情報（全体管理者向け） にて「教室情報表示フラグ」がオンの場合は、教室の所在地を表示する。 3 ホームページ 画面 保存された「ホームページ」を、テキストリンクとして表示し、押下すると別タブで該当のホームページを開く。 未登録の場合は項目自体を表示しない。 4 教室一覧 画面 保存された「教室グループ名」を、「 ＞ [教室グループ名]塾講師バイトの一覧を見る」形式のテキストリンクとして表示し、押下すると該当の 016_ 【FIX】教室グループ一覧閲覧機能 に遷移する。 塾講師ステーションキャリアに紐づく求人の場合は、「[教室グループ名]の求人一覧を見る」形式のテキストリンクとして表示する。 4.4. 処理 URL文字列から入力された求人番号文字列を取得し、求人番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 求人番号文字列を元にデータベースから 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 を取得する。対象の求人番号のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の求人データが存在したら、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373/012_+FIX#4.3.-%E5%87%BA%E5%8A%9B の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read job detail. job_number={求人番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "703561854",
  "parentTitle": "010_■求人・教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/703627373/012_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-22T07:01:24.697Z",
  "author": "isamu saito",
  "excerpt": "1. 1. 目次 2. 概要 本機能はエンドユーザーが 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX】求人：応募条件・研修情報 【FIX】求人：応募情報等 【FIX】求人：PR情報 の 登録済みの求人情報詳細データ1件を閲覧するための機能です。 3. 要求事項 ログイン状態に関わらずエンドユーザーは、 【FIX】求人：基本情報 【FIX】求人：勤務条件・指導科目 【FIX..."
}