{
  "id": "704151828",
  "title": "362_【作成中】カテゴリ追加機能",
  "content": "1. 目次 2. 概要 本機能は 【作成中】記事カテゴリ の新規データを1件を追加するための機能です。 3. 要求事項 管理画面にログインすることができる全体管理者のみが、 【作成中】記事カテゴリ のデータを追加登録することができる。 追加登録できるのは、子カテゴリのみとし、親カテゴリ、又は子カテゴリ配下の孫カテゴリは追加登録できないものとする。 塾講師ステーション管理者、記事管理者、ギフト券担当者、塾講師ステーション担当者、記事担当者は 【作成中】記事カテゴリ のデータを追加登録することができない。 カテゴリ追加にあたって入力フォームに表示し入力可能とする項目は、本ページの「要件定義」-「入力」欄で入力元が「入力フォーム」と定義されている項目と、「保存」ボタン、「キャンセル」ボタンとする。 「保存」ボタンを押下すると入力項目に問題なければ、データベースにレコードを保存し、 361_【作成中】カテゴリ一覧閲覧機能 ページに表示する。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるか分かるようにエラーメッセージを表示する。 「キャンセル」ボタンを押下すると追加登録を取り消し、 361_【作成中】カテゴリ一覧閲覧機能 ページを表示する。 追加登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 360_【作成中】■カテゴリ管理機能 3.2. 帳票 360_【作成中】■カテゴリ管理機能 3.3. メールテンプレート 本機能で扱うメールテンプレートページへのリンクです ※親ページの定義に包含される場合は、親ページへのリンクを記載します 3.4. ワークフロー 3.4.1. 本機能 本機能の利用シーンを示しているワークフローへのリンクです 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） 該当するワイヤフレーム定義ページへのリンクです 4.2. 入力 変数名、説明、バリデーションは、 【作成中】記事カテゴリ の記載を前提とし、本ページに固有の特記事項のみ記載する。 360_【作成中】■カテゴリ管理機能 に記載の共通入力・取得項目は項目自体を省略する。 「制限」に「必須」とある場合に入力がない場合のエラーメッセージは統一して「{項目名}を入力してください」とする。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 名称 &nbsp; 入力フォーム 初期値無し 必須 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 2 概要 入力フォーム 初期値無し 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 3 関連リンクテキスト 入力フォーム 初期値無し 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 4 関連リンクURL 入力フォーム 初期値無し No.3「関連リンクテキスト」が入力された場合に限り、必須となる。 【レビュー中】全体管理者登録情報 の管理者種別が「全体管理者」のみに表示され、操作を行うことができる。 4.3. 出力 説明は、 【作成中】記事カテゴリ の記載を前提とし、本ページに固有の特記事項のみ記載する。 360_【作成中】■カテゴリ管理機能 に記載の共通出力項目は項目自体を省略する。 出力項目 出力先 説明 1 名称 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 2 概要 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 3 関連リンクテキスト データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 関連リンクURL データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "703529119",
  "parentTitle": "360_【作成中】■カテゴリ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704151828/362_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-05-08T02:10:05.366Z",
  "author": "Kenji Komukai (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 本機能は 【作成中】記事カテゴリ の新規データを1件を追加するための機能です。 3. 要求事項 管理画面にログインすることができる全体管理者のみが、 【作成中】記事カテゴリ のデータを追加登録することができる。 追加登録できるのは、子カテゴリのみとし、親カテゴリ、又は子カテゴリ配下の孫カテゴリは追加登録できないものとする。 塾講師ステーション管理者、記事管理者、ギフト券担当..."
}