{
  "id": "704249879",
  "title": "092_【FIX】応募履歴詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが利用することができる。 本機能は会員に紐づく 【FIX】応募情報 に記載の項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 本ページの 「要件定義」-「出力」欄 で出力先として「画面」が定義されている項目 一覧に戻るボタン 押下することで https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709328897 に遷移する。 存在しない応募情報が指定された場合は対象URLのページが存在しないように振る舞う。 3.1. 権限 サービスサイトにログインできる会員のみ 3.2. 帳票 【FIX】応募情報 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 3.3. メールテンプレート なし 3.4. ワークフロー https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704643090 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=100969-59915&amp;mode=design&amp;t=8JIdSnFUM7KQ8l4s-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 応募番号 URLパラメータ 閲覧する応募情報を一意に指定するためのID 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 応募先求人・教室情報 出力項目 出力先 説明 採用お祝い 画面 契約しているプランが以下の教室の求人はお祝い対象外であり、それ以外の教室の求人はお祝い対象である。 プランがライトプラン プランがスポットバイトプラン 該当の求人が 採用 お祝いの対象 であれば 「＄贈呈金額＄円分」、対象でなければ「採用お祝いの対象ではありません。」と表示する。 求人タイトル 応募求人 画面 求人タイトル 応募求人 をHTMLエスケープ処理をして出力する。対象の https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703627373 への リンクとする。 雇用形態 画面 求人に紐づく雇用形態をHTMLエスケープ処理をして出力する。 指導形態 画面 求人に紐づく指導形態をHTMLエスケープ処理をして出力する。 企業名 画面 求人に紐づく企業名をHTMLエスケープ処理をして出力する。 教室名 画面 求人に紐づく教室名をHTMLエスケープ処理をして出力する。 応募先電話番号 画面 求人に紐づく 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 の応募先電話番号をHTMLエスケープ処理をして出力する。 応募先メールアドレス 画面 求人に紐づく 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 の応募先メールアドレス1をHTMLエスケープ処理をして出力する。 電話受付時間 画面 求人に紐づく 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 の電話受付時間をHTMLエスケープ処理をして出力する。 データが登録されていない場合は項目ごと非表示とする。 4.3.2. 応募情報 データが登録されていない項目は項目ごと非表示とする。 「塾からの質問」については、質問が設定されてない場合は、表示しない。 出力項目 出力先 説明 塾からの質問への回答：質問1 画面 HTMLエスケープ処理をして出力する。 【FIX】求人：基本情報 ではなく 【FIX】応募情報 の質問を参照する。質問2、3も同じ。 塾からの質問への回答：回答1 画面 HTMLエスケープ処理をして出力する。 塾からの質問への回答：質問2 画面 HTMLエスケープ処理をして出力する。 塾からの質問への回答：回答2 画面 HTMLエスケープ処理をして出力する。 塾からの質問への回答：質問3 画面 HTMLエスケープ処理をして出力する。 塾からの質問への回答：回答3 画面 HTMLエスケープ処理をして出力する。 4.3.3. 採用情報 日付はYYYY/MM/DD、日時はYYYY/MM/DD hh:mm形式で表示する。 値が保存されていない場合は項目ごと表示しない。 出力項目 出力先 説明 採用ステータス（会員） 画面 保存された値に対応するラベル名を表示する。 面接日時 画面 採用ステータス（企業）が「未登録」の場合のみ、保存された値を表示する。 面接日時補足 画面 採用ステータス（企業）が「未登録」の場合のみ、保存された値をHTMLエスケープして表示する。 採用決定日 画面 採用ステータス（企業）が「採用」の場合のみ、保存された値を表示する。 研修初日 画面 採用ステータス（企業）が「採用」の場合のみ、保存された値を表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はログイン画面にリダイレクトする。 URL文字列から入力された求人番号文字列を取得し、求人番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 求人番号文字列を元にデータベースから 【FIX】応募情報 を取得する。対象の求人番号のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の商品データが存在したら、出力の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read application detail. application_number={応募番号} {URI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709328897 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "704643090",
  "parentTitle": "090_■応募履歴管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704249879/092_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-02-03T06:16:48.951Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータ1件を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが利用することができる。 本機能は会員に紐づく 【FIX】応募情報 に記載の項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 本ページの 「要件定義」-..."
}