{
  "id": "704315421",
  "title": "062_【FIX】メッセージスレッド詳細閲覧機能",
  "content": "目次 概要 本機能は、1つのメッセージスレッドについて登録済みの 【FIX】応募メッセージ情報 を 全て 閲覧するための機能です。 要求事項 サービスサイトにログインできる会員のみが利用できる。 本機能は 【FIX】応募メッセージ情報 に記載の項目について、 1URL=1つのメッセージスレッド、で 保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 1つの応募に紐づく複数のメッセージはまとめて1つのスレッドとして扱う。 本ページには、以下を表示する 応募先情報 本ページの 「要件定義」-「出力」-「応募先情報」 欄で出力先として「画面」が定義されている項目 受信済み・送信済みの メッセージ一覧 本ページの 「要件定義」-「出力」-「メッセージスレッド」 欄で出力先として「画面」が定義されている項目 送信時間が古い順に上から表示し、閉じたアコーディオンとして各メッセージを表示する。ただし送信時間が最も新しいメッセージ（＝一番下に表示されているメッセージ）はアコーディオンを開いた状態をデフォルトとする。各メッセージを押下することでアコーディオンの開閉を切り替えることができる。 受信したメッセージと送信したメッセージは背景色を異なる色とし違いを目立たせる。 下書き 本ページの 「要件定義」-「出力」-「下書き」 欄 で出力先として「画面」が定義されている項目 下書きを押下することで 064_【FIX】メッセージ返信・保存機能 に遷移する。 メッセージ返信ボタン 下書きも含めた最新のメッセージの下に メッセージスレッドのうち、最も新しい受信メッセージの中に 表示される。 押下することで 064_【FIX】メッセージ返信・保存機能 に遷移する。 一覧に戻るボタン 押下することで 061_【FIX】メッセージスレッド一覧閲覧機能 に遷移することができる。 存在しないメッセージスレッドが指定された場合は対象URLのページが存在しないように振る舞う。 企業側から送信された未読のメッセージをクリックまたはページ表示によりアコーディオンを開いた場合、 【FIX】応募メッセージ情報 の既読日時にその処理時間を登録する。 権限 サービスサイトにログインできる会員のみ 帳票 060_■メッセージ管理機能 の記載と同じ メールテンプレート なし ワークフロー 060_■メッセージ管理機能 の記載と同じ 要件定義 ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=125194-111041&amp;mode=design&amp;t=lr71CjBa6vlqiLKj-4 入力 説明は帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 応募番号 URLパラメータ メッセージスレッドを一意に指定するためのID 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 出力 説明は帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 応募先情報 出力項目 出力先 説明 応募先の教室名 画面 応募番号に紐づく応募先の教室グループ名を適切にHTMLエスケープ処理を施して出力する。 応募先の教室名 画面 応募番号に紐づく応募先の教室名を適切にHTMLエスケープ処理を施して出力する。 応募先の求人タイトル 画面 応募番号に紐づく応募先の求人タイトルを適切にHTMLエスケープ処理を施して出力する。「求人詳細へ」というテキストリンクを設置し押下すると 012_【FIX】求人詳細閲覧機能 へ遷移する。 メッセージスレッド 出力項目 出力先 説明 メッセージ情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出したメッセージ情報レコードの配列をアコーディオン形式でページ上に表示する。各レコードの表示データは以下「メッセージ情報：」プレフィックスで始まる出力項目として説明する。 メッセージ情報配列：アイコン 画面 会員が送信したメッセージと会員が受信したメッセージとで異なる2種類のアイコンを表示する。 メッセージ情報配列：件名 画面 保存された「件数」を適切にHTMLエスケープ処理を施して出力する。 メッセージ情報配列：本文 画面 保存された「本文」を適切にHTMLエスケープ処理を施して出力する。アコーディオンが開いている時のみ表示する。 メッセージ情報配列：送信時間 画面 保存された「送信時間」をYYYY/MM/DD hh：mm形式で出力する。 メッセージ情報配列：既読フラグ 画面 会員が受信したメッセージを会員が未読だった場合、「未読」ラベルを出力する。 下書き 出力項目 出力先 説明 下書きメッセージ情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した下書きメッセージ情報レコードの配列をアコーディオン形式でページ上に表示する。各レコードの表示データは以下「下書きメッセージ情報：」プレフィックスで始まる出力項目として説明する。 下書きメッセージ情報配列：アイコン 画面 下書きのアイコンを表示する。 下書きメッセージ情報配列：件名 画面 保存された「件数」を適切にHTMLエスケープ処理を施して出力する。 下書きメッセージ情報配列：本文 画面 保存された「本文」を適切にHTMLエスケープ処理を施して出力する。アコーディオンが開いている時のみ表示する。 処理 エラー処理 ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read message list. application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 制限事項 最後に閲覧していた 061_【FIX】メッセージスレッド一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "703561879",
  "parentTitle": "060_■メッセージ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704315421/062_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-04-19T04:29:12.260Z",
  "author": "isamu saito",
  "excerpt": "目次 概要 本機能は、1つのメッセージスレッドについて登録済みの 【FIX】応募メッセージ情報 を 全て 閲覧するための機能です。 要求事項 サービスサイトにログインできる会員のみが利用できる。 本機能は 【FIX】応募メッセージ情報 に記載の項目について、 1URL=1つのメッセージスレッド、で 保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 1つの応募に紐づく複数のメ..."
}