{
  "id": "704577901",
  "title": "273_【FIX】請求詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 の登録済みのデータ1件と、それに紐づく 【FIX】企業：基本情報 【FIX】請求：請求書PDF を閲覧するための機能です。 3. 要求事項 全体管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが利用できる。 本機能は 【修正中】請求：基本情報 に記載の全ての項目、およびそれに紐づく複数の 【FIX】請求：請求明細 【FIX】請求：請求書PDF の一部の項目について、 【修正中】請求：基本情報 に対して 1URL=1レコード で保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 請求一覧に戻るボタン 押下すると 271_【FIX】請求一覧閲覧・検索機能 に遷移する。 編集ボタン 押下すると 274_【FIX】請求情報編集機能 に遷移する。 削除ボタン 押下すると 275_【FIX】請求情報削除機能 を実行する。 PDF発行ボタン 押下すると 303_【FIX】請求書PDF発行機能 を実行する。 請求明細のレコードがない場合、または、請求明細の合計金額が0円 以下 未満（マイナス） である場合は、非活性として発行できないものとする。 PDF手動アップロードボタン 押下すると 306_【作成中】請求書PDF手動アップロード機能 を実行する。 本ページの「要件定義」-「出力」欄（ 103_【FIX】商品詳細閲覧機能 ）で出力先として「画面」が定義されている項目 請求明細一覧は 281_【作成中】請求書明細一覧閲覧機能 を参照。 採用者一覧ボタン 押下すると 291_【FIX】請求管理 - 採用者一覧閲覧機能 に遷移する。 請求書PDF一覧は 301-2_【機能不要のため削除】全請求書PDF一覧閲覧機能 を参照。 存在しない請求が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、請求番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 要求の記載に従う。 3.2. 帳票 概要の記載に従う。 3.3. メールテンプレート なし 3.4. ワークフロー 270_■請求管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース （画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=77634-51318&amp;mode=design&amp;t=BXuk7AUgA2tAbRMd-0 4.2. 入力 変数名、説明、バリデーションは帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 また本ページ内の個別機能については、各機能の要求定義に記載に従い、本ページでは重ねて記載しない。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 請求番号 URLパラメータ 【修正中】請求：基本情報 記載の一意の数値をURL文字列から取得する 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力 変数名、説明、バリデーションは帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 また本ページ内の個別機能については、各機能の要求定義に記載に従い、本ページでは重ねて記載しない。 項目名 出力先 説明 1 請求番号 画面 保存されている値をそのまま出力する。 2 対象企業 画面 登録されている請求先・振込先マスタ番号から、該当する 【FIX】企業：請求先・振込先マスタ から「企業番号」とそれに紐づく「企業名」をアンダースコアで繋げて表示する。 テキストリンクとし、押下すると 125_【FIX】企業詳細閲覧機能 に遷移する。 3 請求先・振込先 マスタ 画面 登録されている請求先・振込先マスタ番号から、該当する 【FIX】企業：請求先・振込先マスタ から「請求先・振込先マスタ番号_名称」をHTMLエスケープをして表示し、テキストリンクとして押下すると 473_【FIX】請求先マスタ編集機能 に遷移する。 1行下に、「請求先：企業名」と「請求先：担当部署」と「請求先：担当者名」を表示する。 4 請求金額（税込） 画面 【修正中】請求：基本情報 の「請求金額（税込）」を文頭に「&yen;」をつけた上で、3桁カンマ区切りにして出力する。例） &yen;1,000,000 そのうち消費税の金額も「税率」をもとに計算し、同様に表示する。 5 請求対象年月 画面 【修正中】請求：基本情報 の「請求対象年月：年」と「請求対象年月：月」を合わせてYYYY年MM月の形式で出力する。 6 支払い期限日 画面 【修正中】請求：基本情報 の請求対象年月と、 【FIX】企業：請求先・振込先マスタ の回収サイクルおよび入金締日から計算し、YYYY年MM月DD日の形式の文字列で出力する。 7 ステータス 画面 【修正中】請求：基本情報 の「PDFファイルダウンロード日時」にデータが登録されていれば「ダウンロード済み」と表示する。 1が満たされず、かつ 【修正中】請求：基本情報 の「発行通知日時」にデータが登録されていれば「発行通知済み」と表示する。 2が満たされず、かつ 【修正中】請求：基本情報 の「承認日時」にデータが登録されていれば「承認済み」と表示する。 3が満たされなければ「未承認」と表示する。 8 備考 画面 【修正中】請求：基本情報 の同名の項目を、入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 9 請求に関してのお知らせ 画面 【修正中】請求：基本情報 の同名の項目を、入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 10 管理メモ 画面 【修正中】請求：基本情報 の同名の項目を、入力された改行を維持したまま表示されるようにHTMLエスケープ処理をして出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 URL文字列から入力された請求番号文字列を取得し、請求番号文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 請求番号文字列を元にデータベースからの 【修正中】請求：基本情報 【FIX】企業：基本情報 【FIX】請求：請求書PDF を取得する。対象の請求番号のデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の企業データが存在したら、「出力」の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read invoice detail. invoice_number={請求番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 特になし",
  "parentId": "704414005",
  "parentTitle": "270_■請求管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704577901/273_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-06T02:10:57.782Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【修正中】請求：基本情報 の登録済みのデータ1件と、それに紐づく 【FIX】企業：基本情報 【FIX】請求：請求書PDF を閲覧するための機能です。 3. 要求事項 全体管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが利用できる。 本機能は 【修正中】請求：基本情報 に記載の全ての項目、およびそれに紐づく複数の 【FIX】請求：請求明細 【F..."
}