{
  "id": "704512018",
  "title": "064_【FIX】メッセージ返信・保存機能",
  "content": "目次 概要 本機能は 【FIX】応募メッセージ情報 のデータを1件新規 追加・編集 するための機能です。 要求事項 サービスサイトにログインできる会員のみが、 【FIX】応募メッセージ情報 データを新規登録および編集することができる。 062_【FIX】メッセージスレッド詳細閲覧機能 にて「メッセージ返信」ボタンを押下すると、すでに下書きが1件ある場合は下書き新規作成確認モーダルを表示する。モーダル内で「作成中のメッセージを開く」ボタンを押下した場合は、下書きの内容が反映された入力フォームを表示する。「新規作成」ボタンを押下した場合、またはまだ下書きがない場合は、何も入力されていない入力フォームを表示する。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの 「要件定義」-「入力」 欄で入力元が「入力フォーム」と定義されている項目 本ページの 「要件定義」-「出力」 欄で出力先として「画面」が定義されている項目 送信するボタン 保存するボタン メッセージ一覧に戻るボタン 送信するボタンを押下すると 421_【作成中】NGワード管理機能 のチェックを行い、 入力項目に問題なければ 、 「メッセージを送信します。記載内容間違いがないかご確認ください。」と表示された送信確認モーダルを表示する。モーダルには「送信する」「修正する」の選択肢とし、「修正する」を押下すると送信はせずにモーダルを閉じる。 「送信する」を押下すると データベース にレコードを保存し、 メッセージ受信通知メール（クライアント企業管理者宛） を送信する 。またメッセージが送信したことを示すポップアップを表示する。ポップアップ内の閉じるボタンを押下するとポップアップを閉じる。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 下書き保存するボタン を押下すると 必須バリデーションを除外し、 入力項目に問題がなければ 、データベースにレコードを保存し、保存したことを示すポップアップを表示する。ポップアップ内の閉じるボタンを押下するとポップアップを閉じる。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 メッセージ一覧に戻るボタンを押下すると、メッセージの編集中でない場合は 061_【FIX】メッセージスレッド一覧閲覧機能 に遷移する。メッセージの編集中の場合はメッセージの編集を続けるかを尋ねる モーダル を表示し、 「編集を続ける」ボタンを押下すると画面遷移はせずにモーダルを閉じる。 「下書き保存して一覧に戻る」ボタンを押下すると下書き保存をし 061_【FIX】メッセージスレッド一覧閲覧機能 に遷移する。 「 メッセージ一覧に戻る 保存しないで一覧に戻る 」ボタンを押下すると編集中のメッセージを保存せずに 061_【FIX】メッセージスレッド一覧閲覧機能 に遷移する。 メッセージの送信・下書き保存に成功または失敗した場合、以下の情報が入ったログを出力する。 応募メッセージ番号、日時、ユーザー番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 権限 要求に従う。 帳票 概要に従う。 メールテンプレート メッセージ受信通知メール（クライアント企業管理者宛） ワークフロー 【FIX】オファー・応募・選考・採用フロー 要件定義 ユーザーインターフェース（画面） 返信入力画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=121136-121323&amp;mode=design&amp;t=1fnM9Vegs3orRk8u-4 メッセージ送信完了ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=44129-30248&amp;mode=design&amp;t=Uvto9wx82Ks8cnRb-4 編集中に一覧に戻る際の確認モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=44129-30262&amp;mode=design&amp;t=Uvto9wx82Ks8cnRb-4 下書き保存完了ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=44129-30255&amp;mode=design&amp;t=Uvto9wx82Ks8cnRb-4 下書き新規作成確認モーダル https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=44129-30274&amp;mode=design&amp;t=Uvto9wx82Ks8cnRb-4 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限 1 ユーザー番号 &nbsp; 入力フォーム 隠しフォーム 編集する対象の会員の 【FIX】会員：アカウント情報 におけるユーザー番号 必須 2 件名 入力フォーム 初期値 下書きの編集を続ける場合は下書きの「件名」を表示する そうでない場合はなし 50文字以下とする。 必須 3 本文 入力フォーム 初期値 下書きの編集を続ける場合は下書きの「本文」を表示する そうでない場合はなし 1000文字以下とする。 必須 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 応募先情報 出力項目 出力先 説明 応募先の教室グループ名 画面 応募番号に紐づく応募先の教室グループ名を適切にHTMLエスケープ処理を施して出力する。 応募先の教室名 画面 応募番号に紐づく応募先の教室名を適切にHTMLエスケープ処理を施して出力する。 応募先の求人タイトル 画面 応募番号に紐づく応募先の求人タイトルを適切にHTMLエスケープ処理を施して出力する。「求人詳細へ」というテキストリンクを設置し押下すると 012_【FIX】求人詳細閲覧機能 へ遷移する。 返信メッセージ 項目名 出力先 説明 1 件名 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 2 ユーザー番号 データベース 会員のユーザー番号を保存する。 3 本文 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 4 送信時間 データベース メッセージが保存ではなく送信された場合に、送信時間を記録する。 5 応募番号 データベース 紐づく応募番号を保存する。 処理 エラー処理 ログ 新規登録処理（メール送信処理）を実行した場合に下記フォーマットでログを出力する。 データベースへの登録に成功した場合 User {ユーザー番号} created message for company. message_number={メッセージ番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} データベースへの登録に失敗した場合 User {ユーザー番号} failed to create message for company. application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} メール送信に成功した場合 User {ユーザー番号} sent email for company. message_number={メッセージ番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} メール送信に失敗した場合 User {ユーザー番号} failed to send email for company. message_number={メッセージ番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 下書き保存処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {ユーザー番号} created draft for company. message_number={メッセージ番号} application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {ユーザー番号} failed to create draft for company. application_number={応募番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} スコープ外・制限事項 なし",
  "parentId": "703561879",
  "parentTitle": "060_■メッセージ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704512018/064_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-12T08:26:08.876Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "目次 概要 本機能は 【FIX】応募メッセージ情報 のデータを1件新規 追加・編集 するための機能です。 要求事項 サービスサイトにログインできる会員のみが、 【FIX】応募メッセージ情報 データを新規登録および編集することができる。 062_【FIX】メッセージスレッド詳細閲覧機能 にて「メッセージ返信」ボタンを押下すると、すでに下書きが1件ある場合は下書き新規作成確認モーダルを表示する。モーダ..."
}