{
  "id": "704545017",
  "title": "322_【作成中】口コミ新規登録機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 帳票をリストアップする の登録済みのデータを1件新規追加するための機能です。 3. 要求事項 権限者のみ が、 帳票をリストアップする データを新規登録することができる。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの「要件定義」-「入力」欄で入力元が「入力フォーム」と定義されている項目 登録するボタン キャンセルボタン 登録するボタンを押下すると入力項目に問題なければ、データベースにレコードを保存し、作成したことを示す 画面を表示する(ポップアップや完了画面。Figmaなどを参照。) 。ポップアップには閉じるボタンを表示し、閉じるボタンを押下すると 戻る先のページのリンク、大抵は詳細ページや一覧ページ に遷移する。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 キャンセルボタンを押下すると 遷移先のページのリンク、大抵は詳細ページや一覧ページ に遷移する。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号など、帳票にある項目名をで記載する )、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 権限者のみ 3.2. 帳票 親ページと同じなら親ページのリンクを貼る 記載と同じ 3.3. メールテンプレート あればテンプレートページへのリンクを貼る 3.4. ワークフロー 親ページと同じなら親ページのリンクを貼る 記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） Figmaのリンクを貼る 4.2. 入力 変数名、説明、バリデーションは、 帳票の各ページ の記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限 1 項目名 &nbsp; 入力フォーム 初期値なし 必須 2 項目名 &nbsp; 入力フォーム 初期値なし &nbsp; 3 項目名 &nbsp; 入力フォーム 初期値＝ ▼選択してください 必須 4 項目名 &nbsp; 入力フォーム 初期値＝ 1000 必須 5 項目名 &nbsp; 入力フォーム 初期値＝ 出力する 必須 6 項目名 &nbsp; 入力フォーム 初期値＝ 利用不可 必須 4.3. 出力 説明は 帳票の各ページ の記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 出力先 説明 1 項目名 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 2 項目名 データベース/画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 なし",
  "parentId": "703660217",
  "parentTitle": "320_■口コミ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704545017/322_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-11-10T05:11:17.329Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 帳票をリストアップする の登録済みのデータを1件新規追加するための機能です。 3. 要求事項 権限者のみ が、 帳票をリストアップする データを新規登録することができる。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの「要件定義」-「入力」欄で入力元が「入力フォーム」と定義されている項目 登..."
}