{
  "id": "704610764",
  "title": "382_【機能統合により削除】バナー新規作成機能",
  "content": "1. 目次 2. 概要 本機能は 【作成中】バナー情報 の新規データを1件を新規登録するための機能です。 3. 要求事項 3.1. 権限 全体管理画面 にログインすることができる全体管理者のみが、 【作成中】バナー情報 のデータを新規登録することができる。 新規登録にあたって入力フォームに表示する項目は、 【作成中】バナー情報 に記載された項目のうち、画像、タイトル、文言、遷移先URLバナー番号、 遷移先URL と、「登録する」ボタンとする。 「登録する」ボタンを押下すると入力項目に問題なければ、データベースにレコードを保存し、「 381_バナー一覧閲覧機能 」ページへ遷移して、保存したことが利用者にわかるメッセージを表示する。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.2. 帳票 【作成中】バナー情報 3.3. メールテンプレート 本機能で扱うメールテンプレートページへのリンクです ※親ページの定義に包含される場合は、親ページへのリンクを記載します 3.4. ワークフロー 3.4.1. 本機能 【作成中】 バナー登録・編集・削除フロー 3.4.2. 関連 （本機能の利用シーンそのものではないが）本機能に関連するワークフローへのリンクです 4. 要件定義 4.1. ユーザーインターフェース（画面） 該当するワイヤフレーム定義ページへのリンクです 4.2. 入力 本機能の入力情報です ※画面上の入力フォームだけでなく、URL、データベース、設定ファイルなどすべての入力元からの入力情報を記載します 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 例：商品ID ※帳票で定義されている項目の場合、基本的に帳票と同じになります。 &nbsp; 例：productid ※帳票の定義とは異なる場合があります。 例：入力フォーム ※入力フォーム、URLパラメータなど。 例：編集する対象の商品を一意に指定する。 ※入力する目的の補足説明です。 ※初期値がある場合、ここで示します。 例：項目XXがYYの場合に必須 ※帳票としての制限はここでは再度記載せず、本機能で行う制限のみ記載します。 2 &hellip; &hellip; &hellip; &hellip; &hellip; 4.3. 出力 本機能の出力情報です ※画面上だけでなく、URL、データベースなどすべての出力先への出力情報を記載します 出力項目 出力先 説明 1 例：商品ID 例：画面 ※画面、データベース 例：HTMLエスケープ処理をして出力する。 ※出力方法の説明です。（出力時に行う処理、選択肢のIDorラベルのどちらを出力するか、などを説明します） 2 &hellip; &hellip; &hellip; 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "704577945",
  "parentTitle": "380_バナー管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/704610764/382_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-04-27T00:26:53.270Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【作成中】バナー情報 の新規データを1件を新規登録するための機能です。 3. 要求事項 3.1. 権限 全体管理画面 にログインすることができる全体管理者のみが、 【作成中】バナー情報 のデータを新規登録することができる。 新規登録にあたって入力フォームに表示する項目は、 【作成中】バナー情報 に記載された項目のうち、画像、タイトル、文言、遷移先URLバナー番号、..."
}