{
  "id": "705069106",
  "title": "673_【FIX】全アカウント管理 - アカウント編集",
  "content": "1. 目次 2. 概要 登録したクライアント企業管理者情報を、クライアント企業向け管理画面の 673_【要求FIX】全アカウント管理 - アカウント編集 で編集するための機能。 3. 要求事項 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 ページの編集する用ボタンを押下すると、本ページへ へ遷移する 。 クライアント企業管理者情報を編集し、更新する用ボタンを押下することで、変更を保存することができる。 クライアント企業管理者情報編集用ページで閲覧/編集できる情報は以下とする。尚、以下の他は 【FIX】クライアント企業管理者 に記載の内容に準ずる。 本ページの「要件定義」-「入力」 （ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705069106#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目 メールアドレス 変更用ボタンを押下すると、 683_メールアドレス変更機能 へ遷移する。 更新する用ボタンを押下すると入力項目に問題なければ、更新されたことが分かる表示がされると同時に、 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 へ遷移する。問題があればエラーメッセージが表示される。（入力規制は要件定義で定義する。） 3.1. 権限 クライアント企業管理者 のみ が、クライアント企業管理者情報を編集することができる。 3.2. 帳票 【FIX】クライアント企業管理者 【FIX】クライアント企業管理者-企業紐付け 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. クライアント企業管理者情報編集画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29668-42065&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.1.2. クライアント企業管理者情報更新完了画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=29668-42119&amp;mode=design&amp;t=dcUX7Li77qccTDRE-4 4.2. 入力 明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 ユーザー番号：クライアント企業管理者 &nbsp; 入力フォーム 隠しフォーム 編集する対象のクライアント企業管理者の 【FIX】クライアント企業管理者 におけるユーザー番号：クライアント企業管理者 必須 2 氏名 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 必須 3 担当者電話番号 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 必須 4 掲載担当 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 5 採用確認担当 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 6 請求担当 &nbsp; 入力フォーム 初期状態：データベースから読み込んだ値 掲載担当、採用確認担当、請求担当から1つ以上選択することが必須 対象の企業管理者がその企業で唯一の請求担当である場合、ここが偽だとエラーとする。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 ユーザー番号：クライアント企業管理者 画面 HTMLエスケープ処理をして出力する。 2 氏名 データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 3 メールアドレス 画面 HTMLエスケープ処理をして出力する。また 683_メールアドレス変更機能 へのリンクも表示する。 4 担当者電話番号 データベース/画面 画面の対象フォーム内にHTMLエスケープ処理をして出力、入力エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 5 掲載担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 6 採用確認担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 7 請求担当 データベース/画面 保存された値をチェックボックスで出力する。入力エラーがない場合はデータベースに保存する。 8 更新者 データベース 【作成中】帳票共通項目 に従う。 9 更新 日時 データベース 【作成中】帳票共通項目 に従う。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はクライアント企業管理者画面のログイン画面にリダイレクトする。 隠しフォーム入力からユーザー番号：クライアント企業管理者文字列を取得し、入力がない場合/自然数ではない場合はレスポンスステータス404 not foundを出力して処理を終了する。 指定されたユーザー番号：クライアント企業管理者でデータベースから該当するレコードを抽出する。 該当するレコードがデータベース上に存在しない場合はレスポンスステータス404 not foundを出力して処理を終了する。 4.4.1. 編集フォーム画面表示処理 該当するレコードが見つかったら、「出力」（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705069106/673+FIX+-#4.3.-%E5%87%BA%E5%8A%9B ） に記載の通り、表示項目と入力可能項目に項目値を反映させて画面を出力し処理を終了する。 4.4.2. 編集処理 該当するレコードが見つかったら、「入力」（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705069106/673+FIX+-#4.2.-%E5%85%A5%E5%8A%9B ） に記載の入力項目値の妥当性検査を行う。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で編集フォーム画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、更新日時を操作している現在時刻とし、操作を行なっているクライアント企業管理者のユーザー番号を更新者に設定した上でデータベースの該当レコードを更新する。 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 へリダイレクトし処理を終了する。 4.5. エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 編集画面に遷移した場合に下記フォーマットでログを出力する User {クライアント企業管理者のユーザー番号} started to update company_user. company_number={企業番号} company_user={編集対象のクライアント企業管理者のユーザー番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 編集処理を実行した場合に下記フォーマットでログを出力する 成功の場合 User {クライアント企業管理者のユーザー番号} updated company_user. company_number={企業番号} company_user={編集対象のクライアント企業管理者のユーザー番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗の場合 User {クライアント企業管理者のユーザー番号} failed to update company_user. company_number={企業番号} company_user={編集対象のクライアント企業管理者のユーザー番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。 同時編集に対する明示的な対策は施さない。 同時に編集が実行された際は後勝ちとし、後から保存ボタンを押して実行した時の編集値が適用される。 編集画面において他のユーザーまたは他のウィンドウ・タブが本機能にアクセスしたことをアプリケーションは検知しない。",
  "parentId": "705265754",
  "parentTitle": "670_【FIX】全アカウント管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705069106/673_+FIX+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-09-21T02:47:33.299Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 登録したクライアント企業管理者情報を、クライアント企業向け管理画面の 673_【要求FIX】全アカウント管理 - アカウント編集 で編集するための機能。 3. 要求事項 671_【FIX】全アカウント管理 - 担当者一覧閲覧機能 ページの編集する用ボタンを押下すると、本ページへ へ遷移する 。 クライアント企業管理者情報を編集し、更新する用ボタンを押下することで、変更を保存..."
}