{
  "id": "705396737",
  "title": "591_【FIX】応募管理 - 詳細 - プロフィール閲覧機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】応募情報 1件と、それに紐づく 【FIX】会員：プロフィール情報 の登録済みのデータ の一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が利用することができる。 本機能は 【FIX】応募情報 とそれに紐づく 【FIX】会員：プロフィール情報 に記載の項目について、1URL=1レコードで保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 メッセージタブを押下 すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429505 へ、採用情報編集タブを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/933626149 遷移する。 本ページには、以下を表示する 応募詳細画面の各タブ共通内容 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429505#4.3.1.-%E5%90%84%E3%82%BF%E3%83%96%E5%85%B1%E9%80%9A%E5%86%85%E5%AE%B9 を表示する。 一覧に戻るボタン 押下することで https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833 に遷移することができる。 本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目 存在しない応募が指定された場合は対象URLのページが存在しないように振る舞う。 詳細ページを閲覧した場合、以下の情報が入ったログを出力する。 日時、管理者番号、応募番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 要求に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース （画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=100658-41211&amp;mode=design&amp;t=MicOmiNhPBsOfUcZ-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 応募番号 &nbsp; URLパラメータ 閲覧する応募を一意に指定するための応募番号 入力がない、または、自然数ではない、またはデータベースに存在しない場合 エラーメッセージは出力せずレスポンスステータスを404 not foundとする 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 本タブ出力内容 出力項目 出力先 説明 会員番号 画面 保存された値を出力する。 生年月日 画面 保存された値を出力する。 住所 画面 郵便番号、都道府県、市区町村を、適切にHTMLエスケープ処理をして出力する。 最寄り駅 画面 保存された値が指し示す選択肢のラベルを出力する。 電話番号 画面 適切にHTMLエスケープ処理をして出力する。 メールアドレス 画面 適切にHTMLエスケープ処理をして出力する。 現在の職業 画面 適切にHTMLエスケープ処理をして出力する。 希望雇用形態 画面 適切にHTMLエスケープ処理をして出力する。 希望職種 画面 適切にHTMLエスケープ処理をして出力する。 希望勤務地 画面 適切にHTMLエスケープ処理をして出力する。 学歴情報 画面 最終学歴が「大学・大学院」の場合は、 大学情報が入力されている場合は、 学校名、文理、学部名、学科名、学年、入学年月を連結して表示する。 海外の大学の場合は、学校名の後に「国名」を表示する。 それぞれ文字列で登録されているものはHTMLエスケープを、選択式で保存されているものは保存された値が指し示す選択肢のラベルを出力する。 受験経験 画面 高校・中学の受験経験が登録されている場合は、それそれ表示する。 応募番号 画面 保存された値を出力する。 雇用形態 画面 保存された値を出力する。 指導形態 画面 保存された値が指し示す選択肢のラベルを出力する。 応募日時 画面 保存された値を出力する。 職歴・自己PR 画面 適切にHTMLエスケープ処理をして出力する。 勤務可能期間 画面 【レビュー中】会員：設定情報（希望条件） より 小学生 画面 保存された複数の値が指し示す選択肢のラベルを、「、」区切りで全て出力する。 中学生 画面 保存された複数の値が指し示す選択肢のラベルを、「、」区切りで全て出力する。 高校生 画面 保存された複数の値が指し示す選択肢のラベルを、「、」区切りで全て出力する。 その他 画面 保存された複数の値が指し示す選択肢のラベルを、「、」区切りで全て出力する。 指導経験（家庭教師を含む） 画面 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/833093645 の同項目の説明に従う。 その他の説明 画面 「指導科目：その他：その他」を適切にHTMLエスケープ処理をして出力する。 質問1 画面 適切にHTMLエスケープ処理をして出力する。 塾からの質問への回答：質問1 画面 適切にHTMLエスケープ処理をして出力する。 質問2 画面 適切にHTMLエスケープ処理をして出力する。 塾からの質問への回答：質問2 画面 適切にHTMLエスケープ処理をして出力する。 質問3 画面 適切にHTMLエスケープ処理をして出力する。 塾からの質問への回答：質問3 画面 適切にHTMLエスケープ処理をして出力する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は企業管理者画面のログイン画面にリダイレクトする。 URL文字列から入力されたID文字列を取得し、ID文字列が自然数に変換できない場合、レスポンスステータス404 not foundを出力して処理を終了する。 ID文字列を元にデータベースからデータを取得する。対象のIDのデータが存在しない場合、レスポンスステータス404 not foundを出力して処理を終了する。 対象の応募データが存在したら、出力の記載の通り、値に適切な変換処理を行ったのちに画面を出力し処理を終了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント管理者のユーザー番号} read application detail. company_number={企業番号} application_number={応募番号} {URI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項 最後に閲覧していた https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/885260833 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "705036289",
  "parentTitle": "590_■応募管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705396737/591_+FIX+-+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-03-14T03:08:48.529Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】応募情報 1件と、それに紐づく 【FIX】会員：プロフィール情報 の登録済みのデータ の一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が利用することができる。 本機能は 【FIX】応募情報 とそれに紐づく 【FIX】会員：プロフィール情報 に記載..."
}