{
  "id": "705462380",
  "title": "621_【FIX】契約一覧閲覧・検索機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業管理画面にログインすることができるクライアント企業管理者のみが、登録されている 【FIX】契約情報（統合版） を一覧で閲覧することができる。 ただし、「対象サイト」「有効期間：終了日時」が同じ基本契約が複数ある場合、は下記の通りとする。 それらがすべて単価が0円であれば、その内で、契約番号が最も小さい基本契約のみを一覧に表示し、それ以外は 非表示 とする。 単価が0円でない基本契約が１つでもあるのでれあば、単価が0円の基本契約はすべて非表示とする。 また、条件によらず、課金形態契約は非表示とし、オプション契約は表示する。 一覧ページ上部には、以下の要素を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数 契約更新ボタン（ステーション、キャリアそれぞれ） 対象サイトそれぞれにおいて、契約更新可能なレコードが存在する場合のみ活性化する。 押下すると、契約更新可能なレコードの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429584 へ遷移する。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 絞り込み 押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、「該当する契約情報が見つかりませんでした」と表示する。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705462380#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 締結日の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードには以下の項目を表示する。 本ページの「要件定義」-「出力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705462380#4.3.-%E5%87%BA%E5%8A%9B ）で出力先として「画面」が定義されている項目のうち、契約情報レコードとして定義されている項目 更新ボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429584 へ遷移する。 次契約（前契約として該当の契約を紐づけている契約）が紐づけられている契約については、更新ボタンは表示しない。 一覧に表示される契約の中で、グループ、対象サイトが同じ契約が複数ある場合、それらの内「契約開始日時が最も新しい契約」以外の契約については、更新ボタンは表示しない。 契約終了日が25日後より後（＝26日後以降）の契約については、更新ボタンは表示しない。 3.1. 権限 要求事項の記述に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【作成中】契約関連全体フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=108472-7826&amp;mode=design&amp;t=CpCpvwWykw0UdlfN-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 商品概要 service_detail_type URLパラメータ／入力フォーム フィルター項目 契約に紐づく商品の「課金形態種別」「オプション種別」で絞り込みを行う。 単一選択のセレクトボックス。 「商品詳細種別」フォームに下記を表示し、初期状態は「すべて」が選択されているものとする。 「すべて」 「なし （基本商品） 」 「更新料」 課金形態種別およびオプション種別が登録されていないレコードのこと。 必然的に基本商品になるため、この名称とする。 「課金形態」 【FIX】商品マスタ（統合版） の「課金形態種別」に記載されている、「応募課金」「登録課金」「採用課金」「掲載課金」のいずれかで登録されている契約を「課金形態」としてまとめて表示する。 「課金形態」を選択して検索したときは、 【FIX】商品マスタ（統合版） の「課金形態種別」に記載されている「応募課金」「登録課金」「採用課金」「掲載課金」のいずれかで登録されている契約を表示する。 レコードでの表示名は「応募課金」「登録課金」「採用課金」「掲載課金」のいずれかで登録されている名称で表示する。 【FIX】商品マスタ（統合版） の「オプション種別」の選択肢 「新オプション」は、表示名を「その他オプション」とする。 選択肢内の並び順は、「すべて」を最上部に表示し、それ以外は商品帳票の定義順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 2 対象サイト site URLパラメータ／入力フォーム フィルター項目 契約に紐づく商品の「対象サイト」で絞り込みを行う。 単一選択のセレクトボックス。 【FIX】商品マスタ（統合版） の「対象サイト」に記載されている選択肢と「すべて」を選択肢に表示し、初期状態は「すべて」が選択されているものとする。 選択肢内の並び順は、「すべて」を最上部に表示し、それ以降はステーション、キャリアの順とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 3 有効期限 end_date URLパラメータ／入力フォーム フィルター項目 契約の「有効期間：終了日時」の年月が該当するレコードを絞り込む。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/666927437#%E5%80%8B%E5%88%A5%E4%BA%8B%E9%A0%85 の年月日の仕様に準ずる。 任意項目。入力されていない場合はフィルタリングはおこなわない。 4 無効な契約も表示 URLパラメータ／入力フォーム フィルター項目 チェックが入っていれば有効期限切れの契約も表示する。 任意項目。チェックされていない場合はFalseとして表示する。 5 ページ番号 page URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 商品概要 画面 フィルター項目。 入力された「商品種別」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「商品種別」のセレクトボックスで初期選択状態とする。 5 対象サイト 画面 フィルター項目。 入力された「対象サイト」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「対象サイト」のセレクトボックスで初期選択状態とする。 6 有効期限 画面 フィルター項目。 入力された「有効期限」を入力処理にて変換した値を、フィルター用コンポーネント内の「有効期限」のセレクトボックスに表示する。 変換処理及び表示処理はライブラリの仕様に任せる。 7 無効な契約も表示 画面 フィルター項目。 入力された「無効な契約も表示」を入力処理にて変換した値を、フィルター用コンポーネント内の「無効な契約も表示」のチェックボックスに表示する。 8 契約情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した契約情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「契約情報：」プレフィックスで始まる出力項目として説明する。 9 契約情報：契約番号 画面 データベースから取得した契約情報1レコードの「契約番号」。登録された「契約番号」をそのまま表示し、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705593409 へのリンクとする。詳細は 【FIX】契約情報（統合版） を参照。 10 契約情報：対象教室グループ名 画面 データベースから取得した契約情報1レコードの「教室グループ番号」をもとに「対象教室グループ名」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 11 契約情報： サービス種別 画面 データベースから取得した契約情報1レコードから商品を参照し「対象サイト」の対応するラベル名を表示する。詳細は 【FIX】契約情報（統合版） を参照。 12 契約情報： 契約種別 画面 データベースから取得した契約情報1レコードの「商品種別」を、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 13 契約情報：商品名称 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「表示名称」を取得し、適切にHTMLエスケープして表示する。詳細は 【FIX】契約情報（統合版） を参照。 14 契約情報：商品概要 画面 データベースから取得した契約情報1レコードの「商品番号」をもとに「課金形態種別」または「オプション種別」を取得し、設定ファイルから取得した商品種別選択肢のラベルで表示する。 なお基本契約の場合は「更新料」と表示する。 詳細は 【FIX】契約情報（統合版） を参照。 商品概要のフィルター項目で「課金形態」が選択された場合は、 【FIX】商品マスタ（統合版） の「課金形態種別」に記載されている「応募課金」「登録課金」「採用課金」「掲載課金」のいずれかで登録されている契約を表示する。 15 契約情報： 総額 画面 データベースから取得した契約情報1レコード の「単価」&times;「数量」 について、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705429584 と同じ計算式で計算し、 を3桁ずつでコンマで切り、先頭に「&yen;」を付ける形で出力する。詳細は 【FIX】契約情報（統合版） を参照。 ただし、該当の契約の「無料フラグ」が有効な場合、「&yen;0（無料期間）」と表示する。 16 契約情報：開始日 画面 データベースから取得した契約情報1レコードの「有効期間：開始日」を「yyyy/mm/dd」の形式で表示する。詳細は 【FIX】商品マスタ（統合版） を参照。 17 契約情報：有効期限 画面 データベースから取得した契約情報1レコードの「有効期間：終了日」を「yyyy/mm/dd」の形式で表示する。詳細は 【FIX】商品マスタ（統合版） を参照。 18 契約情報：無効化日時 画面 データベースから取得した契約情報1レコードの「無効化日時」。NULLではない場合のみ網掛けありの状態でレコード行を表示する。詳細は 【FIX】契約情報（統合版） を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はクライアント管理者画面のログイン画面にリダイレクトする。 入力欄に記載の項目（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/705462380#4.2.-%E5%85%A5%E5%8A%9B ）の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が20,000を超えていた場合、20,000件を超えるレコードは無視し、以降は総件数を20,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の商品データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき商品情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント企業管理者のユーザー番号} read contract list. company_number={企業番号} page={ページ番号} billing_type= {課金形態種別 } option_type={オプション種別} site={対象サイト} end_date={有効期限} includes_invalid={true/false} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "705265775",
  "parentTitle": "620_■契約管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/705462380/621_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-12-10T02:54:17.469Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】契約情報（統合版） の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業管理画面にログインすることができるクライアント企業管理者のみが、登録されている 【FIX】契約情報（統合版） を一覧で閲覧することができる。 ただし、「対象サイト」「有効期間：終了日時」が同じ基本契約が複数ある場合、は下記の通りとする。 それらがすべて..."
}