{
  "id": "709066775",
  "title": "061_【FIX】メッセージスレッド一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募メッセージ情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員が登録されている 【FIX】応募メッセージ情報 を一覧で閲覧することができる。 １ページあたりの表示数を10件とし、表示対象のレコードが11件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 1つの応募に紐づくメッセージスレッドを1単位とし、1スレッドを1レコードとして表示する。 一覧の各レコードには、それぞれのメッセージスレッドのうち最も送信時間が新しいものについて次の項目を表示する 本ページの 「要件定義」-「出力」 欄で出力先として「画面」が定義されている項目の内、メッセージ情報配列として定義されている項目 一覧 の並び順は、それぞれのメッセージスレッドのうち最も送信時間が新しいものの送信日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧の各レコードはリンクとし、押下するとそれぞれのメッセージスレッドの 062_【作成中】メッセージスレッド詳細閲覧機能 に 遷移する 。 3.1. 権限 要求に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=122795-106617&amp;mode=design&amp;t=9pQWjFGJw1VXdO11-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション ページ番号 &hellip; URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 メッセージ情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出したメッセージ情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「メッセージ情報：」プレフィックスで始まる出力項目として説明する。 メッセージ情報：送受信のアイコン 画面 会員が送信したメッセージである場合は送信アイコンを、受信したメッセージである場合は受信アイコンを表示する。 メッセージ情報：未読数 画面 スレッドのうち、送信者がクライアント管理者であり、かつ既読フラグが「未読」のものの総数をメッセージに右上端に未読マークで表示する。 メッセージ情報： 教室名 画面 データベースから取得したメッセージ情報1レコードの「応募番号」に紐づく教室グループ名を適切にHTMLエスケープして表示する。 メッセージ情報：件名 画面 データベースから取得したメッセージ情報1レコードの「件名」を適切にHTMLエスケープして、太字で表示する。 メッセージ情報：送信時間 画面 データベースから取得したメッセージ情報1レコードの「 送信時間 」をYYYY/MM/DD hh：mm形式で表示する。 ただしSP画面ではYYYY/MM/DD形式とする。 4.4. 処理 4.5. エラー処理 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read message list. page={ページ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。",
  "parentId": "703561879",
  "parentTitle": "060_■メッセージ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709066775/061_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-06T09:20:15.462Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募メッセージ情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員が登録されている 【FIX】応募メッセージ情報 を一覧で閲覧することができる。 １ページあたりの表示数を10件とし、表示対象のレコードが11件以上の場合は、ページネーション（ページ移動のためのコンポーネント）と現在のページ数、総ページ..."
}