{
  "id": "709328897",
  "title": "091_【FIX】応募履歴一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが、概要で挙げた帳票に登録されたデータのうち会員に紐づくものを一覧で閲覧することができる。 1ページあたりの表示数を10件とし 、表示対象のレコードが11件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 作成日時 の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルターの上に次のボタンを表示する 「採用お祝い申請の流れ」ボタン 押下すると採用お祝い申請の流れを解説する ポップアップが表示される 。 採用お祝い申請の流れを解説するポップアップには以下を表示する。 ポップアップには「詳しい申請方法はこちら」ボタンを配置し、ボタンを押下すると採用お祝い金の申請の流れを解説したページ （ https://www.juku.st/campaign ） へ別タブで遷移する。 ポップアップには閉じるボタンを配置し、ボタンを押下するとポップアップを閉じる。 一覧の各レコードには以下の項目を表示する。 本ページの 「要件定義」-「出力」欄 で出力先として「画面」が定義されている項目のうち、応募情報レコードとして定義されている項目 採用ボタン 採用ステータスが「応募中」の場合にのみ活性とする。 押下すると確認モーダルを表示する。 確認モーダル内で確認ボタンを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/840564943 にて 【FIX】応募情報 の「採用ステータス（会員）」を「採用」とし、 採用ステータス変更通知モーダルを表示する 。採用ステータス変更通知モーダル内には https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703693168 への導線と 閉じるボタンを表示し、閉じるボタンを押下するとモーダルを閉じる。 確認モーダル内でキャンセルボタンを押下すると何も処理せずに確認モーダルを閉じる。 不採用ボタン 採用ステータスが「応募中」の場合にのみ活性とする。 押下すると 確認モーダル を表示する。 確認モーダル内で確認ボタンを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/840564943 にて 【FIX】応募情報 の「採用ステータス（会員）」を「不採用」とし、採用ステータス変更通知モーダルを表示する。採用ステータス変更通知モーダルには閉じるボタンを表示し、閉じるボタンを押下するとモーダルを閉じる。 確認モーダル内でキャンセルボタンを押下すると何も処理せずに確認モーダルを閉じる。 辞退ボタン 採用ステータスが「応募中」の場合にのみ活性とする。 押下すると確認モーダルを表示する。 確認モーダル内で確認ボタンを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/840564943 にて 【FIX】応募情報 の「採用ステータス（会員）」を「辞退」とし、採用ステータス変更通知モーダルを表示する。採用ステータス変更通知モーダルには閉じるボタンを表示し、閉じるボタンを押下するとモーダルを閉じる。 確認モーダル内でキャンセルボタンを押下すると何も処理せずに確認モーダルを閉じる。 「採用お祝い申請画面へ」ボタン 次の条件の場合に表示する 採用ステータスが「採用」である 採用お祝いを申請していない 応募から180日以内である スポットプランおよびライトプランの教室の求人に応募した場合は非表示とする 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703693168 に遷移する。 「申請内容修正」ボタン 次の条件の場合に表示する 採用ステータスが「採用」である 採用お祝いを申請している 承認ステータスが「未承認」である（「否認」の場合は条件を満たさない） 応募から180日以内である 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704544799 に遷移する。 「勤務アンケート回答」ボタン 次の条件の場合に表示する 採用ステータスが「採用」である 採用お祝い金の進呈処理が完了した日を起点に 180日を超えている 正式指導開始日の6ヶ月後同日の翌日以降であり、かつ正式指導開始日の1年以内である 勤務アンケートに回答していない 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704643083 に遷移する。 採用お祝い申請済み表示 次の条件の場合に表示する 採用ステータスが「採用」である 採用お祝いを 申請した 採用お祝い金の 進呈処理が完了 しており、かつ完了した日を起点に180日未満である 採用お祝い申請期限切れ表示 次の条件の場合に表示する 採用ステータスが「採用」である 採用お祝いを申請していない 応募から180日を超えている 3.1. 権限 サービスサイトにログインできる会員のみ 3.2. 帳票 【FIX】応募情報 3.3. メールテンプレート なし 3.4. ワークフロー 3.4.1. 本機能 【FIX】オファー・応募・選考・採用フロー 3.4.2. 関連 【FIX】採用お祝い/口コミ確認・公開フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 応募一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=40097-27326&amp;mode=design&amp;t=xNvIe6YKjakgbPz9-4 採用ステータス変更確認ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=40532-46579&amp;mode=design&amp;t=9lGF6ZScsDY8OGlJ-4 採用ステータス変更完了ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=40532-46597&amp;mode=design&amp;t=9lGF6ZScsDY8OGlJ-4 4.2. 入力 各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 ユーザー番号 &nbsp; 入力フォーム Cookieのセッションからユーザー番号を割り出す 閲覧している会員の 【FIX】会員：アカウント情報 におけるユーザー番号 必須 2 ページ番号 URLパラメータ 4.3. 出力 各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり 50件 10件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 応募情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した応募情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「応募情報：」プレフィックスで始まる出力項目として説明する。 5 応募情報：求人タイトル 画面 データベースから取得した応募情報1レコードの「求人タイトル」を適切にHTMLエスケープして表示する。詳細は 【FIX】求人：基本情報 を参照。 6 応募情報：教室名 画面 データベースから取得した応募情報1レコードの「教室名」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 7 応募情報：応募先電話番号 画面 データベースから取得した応募情報1レコードの「応募後連絡先電話番号」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 を参照。 8 応募情報： 応募日 画面 データベースから取得した応募情報1レコードの「作成日時」を適切にHTMLエスケープし、「YYYY年MM月DD日」の形式で表示する。詳細は 【FIX】応募情報 を参照。 9 応募情報：申請期限までの日数 画面 ページ閲覧現在の時間から、データベースから取得した応募情報1レコードの「作成日時」を引いて日数を 計算し 表示する。 また残り日数が12時間など1日未満の場合でも、（0日ではなく）1日と表示する。 10 応募情報：応募中 画面 データベースから取得した応募情報1レコードの「採用ステータス（会員）」が「応募中」の場合、チェックマークを表示する。詳細は 【FIX】応募情報 を参照。 11 応募情報：採用 画面 データベースから取得した応募情報1レコードの「採用ステータス（会員）」が「採用」の場合、チェックマークを表示する。詳細は 【FIX】応募情報 を参照。 12 応募情報：不採用 画面 データベースから取得した応募情報1レコードの「採用ステータス（会員）」が「不採用」の場合、チェックマークを表示する。詳細は 【FIX】応募情報 を参照。 13 応募情報：辞退 画面 データベースから取得した応募情報1レコードの「採用ステータス（会員）」が「辞退」の場合、チェックマークを表示する。詳細は 【FIX】応募情報 を参照。 4.4.処理 ログイン状態を確認し、ログイン認証されていない場合はサービスサイトのログイン画面にリダイレクトする。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が2,000を超えていた場合、以降は総件数を2,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の応募履歴情報データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき応募履歴情報10件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5.エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6.ログ 一覧を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read job application list. page={ページ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。 最後に閲覧していた https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/709328897 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "704643090",
  "parentTitle": "090_■応募履歴管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/709328897/091_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-17T05:37:31.866Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが、概要で挙げた帳票に登録されたデータのうち会員に紐づくものを一覧で閲覧することができる。 1ページあたりの表示数を10件とし 、表示対象のレコードが11件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、..."
}