{
  "id": "713392142",
  "title": "241_【FIX】採用お祝い申請一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【レビュー中】採用お祝い申請 について、採用直後に申請する採用お祝い金申請1stと、その6ヶ月後に申請できる採用お祝い金申請2ndの両方の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、表示可能なレコードの総数を表示する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713392142#4.2.1.-%E6%A4%9C%E7%B4%A2%E3%83%95%E3%82%A3%E3%83%AB%E3%82%BF%E3%83%BC%E3%83%BB%E3%83%9A%E3%83%BC%E3%82%B8%E3%83%8D%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3 で入力元として「入力フォーム：フィルター」が定義されている項目 検索ボタン 押下するとフィルター項目での一覧絞り込みを実行する。検索結果が1件もなかった場合は、 「検索結果が見つかりません。」 と表示する。 CSVダウンロード 押下すると 一覧の各レコードには本ページの「要件定義」-「出力」欄で出力先として「画面」が定義されている項目項目を表示する 採用お祝い金申請2ndに紐づくレコードである場合は、レコードの背景色をピンク色とする。 3.1. 権限 要求に同じ。 3.2. 帳票 概要に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=102982-49400&amp;mode=design&amp;t=uMcQ22bm7ygtgrjd-4 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. 検索フィルター・ページネーション 項目名 変数名 入力元 説明 バリデーション ページ番号 URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 企業名／企業番号 URLパラメータ／ 入力フォーム：フィルター フィルター項目 112_【FIX】契約新規追加機能 と同じとする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室番号（応募時） URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】応募情報 の「求人番号」に紐づく教室番号を完全一致でフィルタリングする。 最大文字数は 30 文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の 30 文字で検索をかける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室名（応募時） URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室名」を部分一致でフィルタリングする。 最大文字数は 30 文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の 30 文字で検索をかける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室番号（採用） URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】応募情報 の「採用された教室番号」を完全一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室名（採用） URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室名」を部分一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の30文字で検索をかける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 会員番号 URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】会員：アカウント情報 の「 ユーザー番号 会員ID 」を完全一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 応募番号 URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】応募情報 の「応募番号」を完全一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 氏名 URLパラメータ／ 入力フォーム：フィルター フィルター項目 1行テキストボックスで入力し、 【FIX】会員：プロフィール情報 の「氏名」を部分一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の30文字で検索をかける。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 承認ステータス URLパラメータ／ 入力フォーム：フィルター フィルター項目 ラジオボタンとし、 【レビュー中】採用お祝い申請 の「承認ステータス」に記載されている選択肢と「すべて」から選択することができる。デフォルトは「すべて」。 初期状態は最後に入力したものを選択された選択肢として表示する。前に入力されたものがない場合はプレースホルダーを表示する。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 申請種別 URLパラメータ／ 入力フォーム：フィルター フィルター項目 ラジオボタンとし、選択肢は「すべて」と 【レビュー中】採用お祝い申請 の選択肢とする。 初期状態は最後に入力したものを選択された選択肢として表示する。前に入力されたものがない場合はプレースホルダーを表示する。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 投稿日 URLパラメータ／ 入力フォーム：フィルター フィルター項目 【レビュー中】採用お祝い申請 の作成日で絞り込む。 検索期間の開始日時と終了日時について、それぞれデートピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付を対象期間に入力する。 クリアボタンについては、「開始」ボタンを押下すると開始日を初期値に戻す。「終了」ボタンを押下すると終了日を初期値に戻す。「両方」ボタンを押下すると開始日と終了日を初期値に戻す。 初期状態は最後に入力したものを表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 応募日 URLパラメータ／ 入力フォーム：フィルター フィルター項目 検索期間の開始日時と終了日時について、それぞれデートピッカーで入力し、それぞれの入力規制は 共通要件 に従う。 「本日分」ボタンを押下すると、押下した日付を対象期間とする。 クリアボタンについては、「開始」ボタンを押下すると開始日を初期値に戻す。「終了」ボタンを押下すると終了日を初期値に戻す。「両方」ボタンを押下すると開始日と終了日を初期値に戻す。 初期状態は最後に入力したものを表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 検索フィルター・ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 企業名／企業番号 画面 入力された「企業名／企業番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「企業番号」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室番号（応募時） 画面 入力された「教室番号（応募時）」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室番号（応募時）」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室名（応募時） 画面 入力された「教室名（応募時）」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室名（応募時）」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室番号（採用） 画面 入力された「教室番号（採用）」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室番号（採用）」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室名（採用） 画面 入力された「教室名（採用）」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室名（採用）」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 会員番号 画面 入力された「会員番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「会員番号」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 応募番号 画面 入力された「応募番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「応募番号」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 氏名 画面 入力された「氏名」を入力処理にて変換した値を、フィルター用コンポーネント内の「氏名」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 承認ステータス 画面 入力された「承認ステータス」を入力処理にて変換した値を、フィルター用コンポーネント内の「承認ステータス」のセレクトボックス内にて対応するラベル名を表示する。 申請種別 画面 入力された「申請種別」を入力処理にて変換した値を、フィルター用コンポーネント内の「申請種別」のセレクトボックス内にて対応するラベル名を表示する。 投稿日時 画面 検索期間の開始日と終了日について、それぞれのデートピッカーで入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートピッカーで初期選択状態とする。 応募日時 画面 検索期間の開始日時と終了日時について、それぞれのデートピッカーで入力された値を入力処理にて変換した値を利用し、フィルター用コンポーネント内のそれぞれのデートピッカーで初期選択状態とする。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 採用お祝い番号 画面 データベースから取得した採用お祝い申請情報1レコードの「採用お祝い番号」を表示する。 テキストリンクとし、押下すると 242_【FIX】採用お祝い申請詳細閲覧・編集機能 または 252_【FIX】採用お祝い金申請2nd詳細閲覧機能 に遷移する。 氏名 画面 データベースから取得した採用お祝い申請情報1レコードの「氏名」を適切にHTMLエスケープして表示する。 承認ステータス 画面 データベースから取得した採用お祝い申請情報1レコードの「承認ステータス」。保存された値が指し示す選択肢のラベルを出力する。 教室名（採用） 画面 データベースから取得した採用お祝い申請情報1レコードの「教室名（採用）」を適切にHTMLエスケープして表示する。 申請種別 画面 【レビュー中】採用お祝い申請 のアンケート番号が1であれば「1st」を、3であれば「2nd」を表示する。 投稿日時 画面 データベースから取得した採用お祝い申請情報1レコードの「作成日時」をYYYY/MM/DD hh:mm:ss形式で表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 入力で定義した検索コンポーネントの入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が200,000を超えていた場合、以降は総件数を200,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の採用お祝い申請情報データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき採用お祝い申請情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read gift requests list. page={ページ番号} company_number={企業番号} classroom_number_application={教室番号（応募時）} classroom_name_application={教室名（応募時）} classroom_number_hired={教室番号（採用）} classroom_name_hired={教室名（採用）} user_number={会員番号} application_id={応募番号} user_name={氏名} approval_status={承認ステータス} gift_request_type={申請種別} post_date={投稿日} application_date={応募日} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "703561955",
  "parentTitle": "240_■採用お祝い申請管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713392142/241_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-14T09:28:15.678Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能は 【レビュー中】採用お祝い申請 について、採用直後に申請する採用お祝い金申請1stと、その6ヶ月後に申請できる採用お祝い金申請2ndの両方の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインすることができるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を利用することができる。 一覧ページ上部には、一覧フィルター用..."
}