{
  "id": "713523232",
  "title": "221_【FIX】企業別採用一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 および 【レビュー中】採用お祝い申請 の登録済みのデータの一覧を企業別に閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、採用状況集計表、表示可能なレコードの総数を表示する。 一覧フィルター用コンポーネントの表示項目はWFを参照しつつ、特記が必要なものは以下に記載する。なお検索するボタンを押下しても検索結果が1件もなかった場合は、「該当のデータがありません。」と表示する 。 企業番号／企業名 コンボボックスとする。 トモノカイ要確認データ 「あり」で指定すると、提出ステータスが「提出中」の応募がある企業をフィルターする。 提出期限超過（ 前月 ） 「あり」で指定すると、処理時点で提出期限が超過しており、かつ提出ステータスが「未提出」の応募がある企業をフィルターする。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 登録日時 の降順で表示し、並べ替えを行うことはできなくて良い。 採用状況集計表には次の項目を表示する 当月請求確定者数 全ての 【FIX】応募情報 のうち、請求確定日が当月であるものの総数を表示する。 未登録者数 全ての 【FIX】応募情報 のうち、採用ステータス（企業）が「未登録」のものの総数を表示する。 また月初時点での同条件のものの総数も表示する。 前月保留者数 全ての 【FIX】応募情報 のうち、採用ステータス（企業）が「保留」 で、かつ提出期限が前月 のものを表示する。 トモノカイ要確認数 全ての 【FIX】応募情報 のうち、提出ステータスが「提出中」のものの総数を表示する。 研修未定者数 全ての 【FIX】応募情報 のうち、採用ステータス（企業）が「採用」で、研修初日が登録されていないものの総数を表示する。 前月提出期限超過数 全ての 【FIX】応募情報 のうち、 処理時点で提出期限が超過しており 、かつ提出ステータスが「未提出」の総数を表示する。 クライアント要確認数 全ての 【FIX】応募情報 のうち、提出ステータスが「未提出」「差し戻し」のものの総数を表示する。 在籍確認待ち数 全ての 【FIX】応募情報 のうち、採用ステータス（企業）が「採用」で、研修初日が登録されており、かつ在籍確認が登録されていないものの総数を表示する。 追加確認数 全ての 【FIX】応募情報 のうち、提出ステータスが「差し戻し」で、かつ追加確認理由が登録されているものの総数を表示する。 一覧の各レコードには次の項目を表示する。各カラムの集計条件は、それぞれのレコードの企業に対して、採用状況集計表の条件の通りとし、特記すべきものだけ記載する。 企業名(企業番号) テキストリンクとし、押下すると 125_【FIX】企業詳細閲覧機能 に別タブで遷移する。 クライアント要確認数 前月保留者数 追加確認数 在籍確認待ち数 前月提出期限超過数 不一致確認数 不一致の条件は 763_【FIX】採用お祝い自動承認・関連メール送信バッチ のDと同じとする。 最終提出日時 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/681214046?focusedCommentId=970555528 を参照する。 背景色 レコード毎に背景を白と薄い青色を交互に表示する 3.1. 権限 要求定義の記載に従う。 3.2. 帳票 概要の記載に従う。 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】採用後在籍確認フロー 【FIX】オファー・応募・選考・採用フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=51539-79632&amp;mode=design&amp;t=oJozDqIhE6BAjzwo-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 画面を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read company hiring check list. page={ページ番号} company_number={企業番号} due_this_month_unsubmitted={当月提出期限の未提出データ} admin_check_requeired={トモノカイ要確認データ} overdue_last_month={提出期限超過（前月）} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "704151814",
  "parentTitle": "220_■企業別採用管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713523232/221_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-10T07:47:06.635Z",
  "author": "kotake_jin",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 および 【レビュー中】採用お祝い申請 の登録済みのデータの一覧を企業別に閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 一覧ページ上部には、一覧フィルター用コンポーネント、採用状況集計表、表示可能なレ..."
}