{
  "id": "713687237",
  "title": "501_【FIX】教室一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能はクライアント企業管理画面にて 【FIX】教室：基本情報／所在地 の登録済みのデータの一覧を閲覧するための機能です。 ステーションに紐づく教室だけを一覧するページとキャリアに紐づく教室だけを一覧するページの2つのパターンに分ける。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 ただし自身の企業に紐づかない教室は閲覧できない。 クライアント企業管理画面のサイドバーで「教室求人管理（ステーション）」から遷移してきた場合は、ステーションに紐づく教室の一覧を表示し、サイドバーの「教室求人管理（キャリア）」から遷移してきた場合は、キャリアに紐づく教室の一覧を表示する。 ただしステーション又はキャリアの親契約が無い場合は、親契約の無い教室一覧ページでは掲載の操作や教室編集や削除、求人編集、教室複製はできず（各機能は非活性）レコードの閲覧のみとする。 ステーション又はキャリアの親契約が1つも無い場合は、新規作成ボタンは非活性とする。 一覧ページ上部には、以下を表示する。 一覧フィルター用コンポーネント 表示可能なレコードの総数、新規登録ボタン、「掲載設定の一括更新はこちら」テキストリンクを表示する。 キャリアの契約が無い場合は 、「キャリアのご契約が無いため教室の追加や募集ができません。新規ご契約いただくか、契約の更新をお願い致します。」とアラートメッセージを表示する。ステーションの契約がない場合は、「ステーションのご契約が無いため教室の追加や募集ができません。新規ご契約いただくか、契約の更新をお願い致します。」とアラートメッセージを表示する。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーションと現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 更新日時の降順で表示し、並べ替えを行うことはできなくて良い。 レコード一覧の上に次のボタンを表示する 新規登録ボタン 押下すると 502_【FIX】教室新規登録機能 に遷移する。 「掲載設定の一括更新はこちら」テキストリンク 押下すると 516_【FIX】教室管理-一括更新機能 に遷移する。 一覧フィルター用コンポーネントの表示項目は下記の通りで全てAND結合とし、「検索」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713687237#4.2.1.-%E6%A4%9C%E7%B4%A2%E3%83%95%E3%82%A3%E3%83%AB%E3%82%BF%E3%83%BC%E3%83%BB%E3%83%9A%E3%83%BC%E3%82%B8%E3%83%8D%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3 で入力元として「入力フォーム：フィルター」が定義されている項目 検索ボタン 押下するとフィルター項目での一覧絞り込みを実行する。検索結果が1件もなかった場合は、 「該当する 教室情報がありません。 」 「該当する教室が見つかりませんでした。」 と表示する。 リセットボタン 押下すると一覧フィルター用コンポーネントの全ての入力項目を初期状態に戻す。 一覧の各レコードには本ページの 「要件定義」-「出力」欄 で出力先として「画面」が定義されている項目の内、教室情報レコードとして定義されている項目を表示する。 対象サイトが 「キャリア」の場合 、レコードの背景色をピンクとする。 3.1. 権限 クライアント企業向け管理画面にログインできるクライアント企業管理者のみ 3.2. 帳票 概要で挙げた帳票 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】教室登録・公開・削除フロー 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=56089-51595&amp;mode=design&amp;t=e5h5WScUfgCcFw1U-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.2.1. 検索フィルター・ページネーション 項目名 変数名 入力元 説明 バリデーション 教室番号 classroom_number URLパラメータ／入力フォーム １行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室番号」を 完全一致 でフィルタリングする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室グループ名 brand_number URLパラメータ／入力フォーム 初期値はなし。 コンボボックスによる単一選択。 151-2_【FIX】教室グループ検索API を使い、テキストエリアに入力された文字列との中間一致で検索して抽出した教室グループを選択肢として表示し、表示された選択肢から選択することで「教室グループ番号」が入力される。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室名 name URLパラメータ／入力フォーム １行テキストボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室名」を部分一致でフィルタリングする。 任意項目。入力されていない場合はフィルタリングをおこなわない。 都道府県 prefecture_id URLパラメータ／入力フォーム 初期値はなし。 コンボボックスによる複数選択。 任意項目。入力されていない場合はフィルタリングをおこなわない。 教室プラン URLパラメータ／入力フォーム 初期値は「すべて」。 セレクトボックスとし、選択肢は「すべて」と 【FIX】教室：基本情報／所在地 の「教室プラン」の選択肢とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 雇用形態 URLパラメータ／入力フォーム キャリアに紐づく教室一覧を表示しているときだけ使用・表示するフィルター項目とする。 初期値は「すべて」。 セレクトボックスとし、選択肢は「すべて」と 【FIX】求人：基本情報 の「雇用形態」の選択肢とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 掲載状態 URLパラメータ／入力フォーム 初期値は「すべて」。 セレクトボックスとし、選択肢は「すべて」「掲載」「非掲載」とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 ページ番号 &nbsp;page URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 検索フィルター・ページネーション 出力項目 出力先 説明 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して1ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 教室番号 画面 入力された「教室番号」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室番号」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室グループ名 画面 入力された「教室グループ名」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室グループ名」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室名 画面 入力された「教室名」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室名」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 教室プラン 画面 入力された「教室プラン」を入力処理にて変換した値を、フィルター用コンポーネント内の「教室プラン」のセレクトボックス内にて対応するラベル名を表示する。 都道府県 画面 入力された「都道府県」を入力処理にて変換した値を、フィルター用コンポーネント内の「都道府県」のセレクトボックス内にて対応するラベル名を全て表示する。 掲載状態 画面 入力された「掲載状態」を入力処理にて変換した値を、フィルター用コンポーネント内の「掲載状態」のセレクトボックス内にて対応するラベル名を表示する。 4.3.2. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 教室情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した教室情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「 教室 情報：」プレフィックスで始まる出力項目として説明する。 教室情報：教室番号 画面 データベースから取得した教室情報1レコードの「教室番号」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 教室情報：教室名 画面 データベースから取得した教室情報1レコードの「教室名」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 教室情報：教室プラン 画面 データベースから取得した教室情報1レコードの「教室プラン」を適切にHTMLエスケープして表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 教室情報：更新日時 画面 データベースから取得した教室情報1レコードの「更新日時」を「yyyy/mm/dd」形式で表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 教室情報：求人（ステーション）ボタン 画面 押下することで、対象教室の 511_【FIX】教室管理-求人一覧閲覧機能 へ遷移し、対象サイトが塾講師ステーションである求人のみ表示される仕様とする。 教室情報：求人（キャリア）ボタン 画面 押下することで、対象教室の 511_【FIX】教室管理-求人一覧閲覧機能 へ遷移し、対象サイトが塾講師ステーションキャリアである求人のみ表示される仕様とする。 教室情報：求人ボタン 画面 押下することで、対象教室の 511_【FIX】教室管理-求人一覧閲覧機能 へ遷移する。 教室情報：複製ボタン 画面 押下することで、対象教室の 515_【作成中】教室管理-教室コピー機能 へ遷移する。 教室情報：編集ボタン 画面 押下することで、対象教室の 504_【FIX】教室編集機能 へ基本情報/所在地タブへ遷移する。 教室情報：削除ボタン 画面 押下することで、対象教室の 164_【FIX】教室削除機能 を実行する。 教室情報：公開フラグ 画面 データベースから取得した教室情報1レコードの「公開フラグ」を設定ファイルから取得した公開フラグ選択肢のラベルで表示する。 公開トグルを切り替えると 507_【使用しない機能のため削除】教室公開フラグ切り替え機能 を実行する。 教室情報：掲載フラグ 画面 データベースから取得した教室情報1レコードの「掲載フラグ」を設定ファイルから取得した公開フラグ選択肢のラベルで表示する。詳細は 【FIX】教室：基本情報／所在地 を参照。 公開非公開トグルの表示条件は、レコードの有無ではなく、必須項目に値が入力されているかどうかに基づいて判定する。 編集項目で登録されていな い 場合は、掲載フラグの欄に、登録されていない項目のラベルを表示する。 掲載トグルを切り替えると 506_【FIX】教室掲載フラグ切り替え機能 を実行する。 教室情報：急募 画面 該当教室配下の求人に紐づく有効な急募が1件でも存在する場合「急募中」と表示し、それ以外の場合は空白とする。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はクライアント企業管理者画面のログイン画面にリダイレクトする。 入力欄に記載の項目の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が 2,000 を超えていた場合、2,000件を超えるレコードは無視し、以降は総件数を2,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の教室データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして教室番号の降順に並べて、指定されたページ番号に表示すべき教室情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {クライアント企業管理者のユーザー番号} read classroom list. page={ページ番号} company_number={企業番号} classroom_number={教室番号} brand_number={教室グループ番号} classroom_name={教室名} classroom_ plan= {教室プラン} prefecture_id={都道府県} published_flag={掲載状態} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。",
  "parentId": "704184702",
  "parentTitle": "500_■教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713687237/501_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-31T08:26:33.676Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能はクライアント企業管理画面にて 【FIX】教室：基本情報／所在地 の登録済みのデータの一覧を閲覧するための機能です。 ステーションに紐づく教室だけを一覧するページとキャリアに紐づく教室だけを一覧するページの2つのパターンに分ける。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧する..."
}