{
  "id": "713818177",
  "title": "441_【FIX】管理者一覧閲覧機能",
  "content": "1. 目次 2. 概要 本機能は 【FIX】全体管理者登録情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 デフォルトでは システム管理者、塾講師ステーション管理者、 ゲスト管理者 、記事管理者、記事担当者、ギフト券担当者の順に 登録日時の降順に表示し、並べ替えを行うことはできなくて良い。 1ページ50件の管理者を表示する。 ページネーションは51件以上で表示し、Laravelの仕様に準ずる。 一覧ページ上部には、下記を配置する。 一覧フィルター用コンポーネント 一覧フィルター用コンポーネントの表示項目は下記の通りで、全てAND結合とし、検索ボタンを押下するまでフィルター項目の変更は適用されないものとする。 本ページの「要件定義」-「入力」 欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713818177#4.2.-%E5%85%A5%E5%8A%9B ）で入力元として「入力フォーム」が定義されている項目の内、「フィルター項目」として定義されている項目 検索ボタン 検索ボタンを押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、「該当する管理者が見つかりませんでした」と表示する。 表示可能なレコードの総数 招待ボタン 押下すると 442_【FIX】管理者招待・登録機能 を実行する。 一覧の各レコードには以下の項目を表示する。 本ページの「要件定義」-「出力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713818177#4.3.-%E5%87%BA%E5%8A%9B ）で出力先として「画面」が定義されている項目のうち、管理者情報レコードとして定義されている項目 編集ボタン 押下すると 444_【FIX】管理者情報編集機能 に遷移する。 削除ボタン 押下すると 445_【FIX】管理者削除機能 へ遷移する。 3.1. 権限 管理画面にログインすることができる システム管理者 のみが、登録されている全体 管理者 を一覧で閲覧することができる。 3.2. 帳票 【FIX】全体管理者登録情報 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】全体管理者登録・削除フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=1806%3A28718&amp;t=r3IqqflxoqksJqnt-1 4.2. 入力 【FIX】全体管理者登録情報 に記載の共通入力・取得項目は省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 管理者種別 type 入力フォーム／URLパラメータ フィルター項目 単一選択のセレクトボックスで入力し 【FIX】全体管理者登録情報 の「管理者種別」に記載されている選択肢を選択することができる。 デフォルトは「 すべて 」 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 【FIX】全体管理者登録情報 の「管理者種別」に記載されている選択肢以外が入力された場合は「すべて」と判定し、どんな値が入力されてもエラーは発生させない。 2 氏名 入力フォーム／URLパラメータ フィルター項目 テキストボックスで入力する。デフォルトは空欄。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 中間一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の30文字で検索を行う。 3 メールアドレス 入力フォーム／URLパラメータ フィルター項目 テキストボックスで入力する。デフォルトは空欄。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 中間一致でフィルタリングする。 最大文字数は30文字、単一入力のみ受け付ける。最大文字数を超えた検索の場合は最初の30文字で検索を行う。 4 ページ番号 page URLパラメータ 一覧のページネーションで表示するページを指定するページ番号。自然数の数字で指定する。 入力がない場合、自然数に変換不可能な文字列が入力された場合、存在しないページ番号が指定された場合はいずれもページ番号を1として処理を行う。 自然数以外が入力された場合は1として処理しエラーは発生させない。 存在しないページ番号が指定された場合は1として処理しエラーは発生させない。 4.3. 出力 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 管理者種別 画面 入力された「 管理者種別 」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「管理者種別種別」のセレクトボックスで初期選択状態とする。 5 氏名 画面 入力された「氏名」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「氏名またはメールアドレス」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 6 メールアドレス 画面 入力された「 メールアドレス 」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「氏名またはメールアドレス」のテキストボックスに適切なHTMLエスケープ処理を施して表示する。 7 管理者情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した管理者情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「管理者情報：」プレフィックスで始まる出力項目として説明する。 8 管理者情報：ユーザー番号 画面 データベースから取得した管理者情報1レコードの「ユーザー番号」を適切にHTMLエスケープして表示する。詳細は 【FIX】全体管理者登録情報 を参照。 9 管理者情報：氏名 画面 データベースから取得した管理者情報1レコードの「氏名」を適切にHTMLエスケープして表示する。詳細は 【FIX】全体管理者登録情報 を参照。 10 管理者情報：管理者種別 画面 データベースから取得した管理者情報1レコードの「管理者種別」を設定ファイルから取得した管理者種別選択肢のラベルで表示する。詳細は 【FIX】全体管理者登録情報 を参照。 11 管理者情報：メールアドレス 画面 データベースから取得した管理者情報1レコードの「メールアドレス」を適切にHTMLエスケープして表示する。詳細は 【FIX】全体管理者登録情報 を参照。 12 管理者情報：登録日時 画面 データベースから取得した管理者情報1レコードの「管理者種別」を適切にHTMLエスケープして「yyyy/mm/dd hh:mm:ss」の形式で表示する。詳細は 【FIX】全体管理者登録情報 を参照。 13 管理者情報： 最終ログイン日時 画面 データベースから取得した管理者情報1レコードの「管理者種別」を適切にHTMLエスケープして「yyyy/mm/dd hh:mm:ss」の形式で表示する。詳細は 【FIX】全体管理者登録情報 を参照。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「管理者種別」「氏名」「メールアドレス」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が1000を超えていた場合、以降は総件数を1000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の管理者データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき管理者情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {操作を実行した全体管理者のユーザー番号} read administrator list. type={管理者種別} name={氏名} email={匿名化処理したメールアドレス} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} メールアドレスの匿名化処理は 共通要件 の記載に従う。 5. スコープ外・制限事項 最後に閲覧していた https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=713818177 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "703791312",
  "parentTitle": "440_【FIX】管理者管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/713818177/441_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-12-19T09:22:13.753Z",
  "author": "feng_xiaomeng (Unlicensed)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】全体管理者登録情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者のみが、概要で挙げた帳票に登録されたデータを一覧で閲覧することができる。 デフォルトでは システム管理者、塾講師ステーション管理者、 ゲスト管理者 、記事管理者、記事担当者、ギフト券担当者の順に 登録日時の降順に表示し、並べ替えを..."
}