{
  "id": "714375220",
  "title": "167_【不要のため削除】教室プレビュー機能",
  "content": "※リニューアルにより教室ページ自体が無くなるため不要。 1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 の登録済みのデータがサービスサイトにどのように表示されるのかをプレビューすることができる機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、塾講師ステーション担当者が、 【FIX】教室：基本情報／所在地 のプレビューを確認することができる。 ギフト券担当者、記事管理者、記事担当者は 【FIX】教室：基本情報／所在地 の公開ステータスを変更することができない。 本機能は 161_【作成中】教室一覧閲覧機能 画面上に表示されている項目とする。 本機能は 【FIX】教室：基本情報／所在地 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 に記載の全ての項目について、1URL=1レコードで保存された値を表示して閲覧することができる。 存在しない教室が指定された場合は対象URLのページが存在しないように振る舞う。 【FIX】全体管理者登録情報 の管理者種別によって、入力フォームに表示し入力可能とする項目は、本ページの「要件定義」-「入力」欄で入力元が「入力フォーム」と定義されている項目とする。 3.1. 権限 160_【作成中】■教室管理機能 3.2. 帳票 160_【作成中】■教室管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 160_【作成中】■教室管理機能 の記載と同じ 3.4.1. 本機能 本機能の利用シーンを示しているワークフローへのリンクです 3.4.2. 関連 （本機能の利用シーンそのものではないが）本機能に関連するワークフローへのリンクです 4. 要件定義 4.1. ユーザーインターフェース（画面） 該当するワイヤフレーム定義ページへのリンクです 4.2. 入力 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 教室番号 &nbsp; 入力フォーム 公開する対象の教室の教室番号を一つのみ入力することができる。 入力がない、または、要素が自然数ではない、または指定番号の教室レコードがデータベースに存在しない場合 エラーメッセージは出力せず、正しい番号に対してのみ処理を実行する。 2 プレビュー表示ボタン 入力フォーム プレビューボタンは「PC」と「スマホ」の2つを表示する。 それぞれのボタンを押下することで、対象の教室情報を実際のサービスサイトのプレビュー画面にて確認することができる。 4.3. 出力 出力項目 出力先 説明 1 PC プレビュー画面 画面 対象の 【FIX】教室：基本情報／所在地 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 に記載の全ての項目について、PC版のプレビュー画面で表示する。 2 スマホ プレビュー画面 画面 対象の 【FIX】教室：基本情報／所在地 【FIX】教室：応募情報転送連絡先／応募後連絡先電話番号 【FIX】教室：塾チャート 【FIX】教室：ロゴ・スライド画像 に記載の全ての項目について、スマホ版のプレビュー画面で表示する。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "704053435",
  "parentTitle": "160_【FIX】教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/714375220/167_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-07-25T08:16:21.714Z",
  "author": "ejiri_yusuke",
  "excerpt": "※リニューアルにより教室ページ自体が無くなるため不要。 1. 目次 2. 概要 本機能は 【FIX】教室：基本情報／所在地 の登録済みのデータがサービスサイトにどのように表示されるのかをプレビューすることができる機能です。 3. 要求事項 全体管理画面にログインすることができる全体管理者、塾講師ステーション管理者、塾講師ステーション担当者が、 【FIX】教室：基本情報／所在地 のプレビューを確認す..."
}