{
  "id": "716243019",
  "title": "031_【FIX】 口コミ一覧閲覧機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】口コミ の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 エンドユーザーとログインしているユーザーが概要で挙げた帳票に登録されている情報を閲覧できる。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（ご意見）」を表示する場合の質問内容のテキストは、同じ 【FIX】口コミグループ に紐づく 【FIX】口コミ の「カテゴリ」で選択されたテキストを表示する。（例：「勤務塾への応募動機」） 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている企業の口コミは表示しない。 紐づくすべての企業（ 【FIX】企業：設定情報（クライアント企業向け） ）の「Station口コミ表示」が無効に設定されているブランドの、ブランド名（検索窓の選択肢）および該当ブランドの口コミへの導線（ランキングや注目塾のカード・リンク）は表示しない。 ランキングセクション、注目の学習塾の口コミセクションは、キャッシュで保存した値を表示する。 閲覧できる項目はWFに従い、特記すべき内容のみ下に続ける。 画面上部には以下の項目を表示する 「塾ブランドを検索」 テキストを入力すると 部分 一致するブランド名を検索窓の下に連ねる。 1つ1つは押下すると検索窓にテキストを入れ、 検索ボタンを押すと https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/999620722 へ遷移する。 「 塾講師ステーション で求人を検索する」 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/938377236 に遷移する。 テキストリンクを羅列し、それぞれを押下すると以下のセットを表示する。 総合評価 デフォルトではこの内容をページ表示する。 それぞれのカードを押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/999620722 へ遷移する。 総合評価の高い大手学習塾ランキング 該当ブランドに紐づく掲載状態の求人が100件以上かつ公開ステータスの 口コミ 件数が1000件以上あるブランドが大手塾ブランドに該当する そのうち総合評価の高い ブランド を5件表示する。 総合評価の高い地域密着塾ランキング 該当ブランドに紐づく掲載状態の求人が100件未満かつ口コミが公開ステータスで300件以上あるブランドが地域密着塾ブランドに該当する そのうち総合評価の高いブランドを5件表示する。 カテゴリ カテゴリ別評価の高いブランドランキング カテゴリ別に評価の高い塾ブランドを10件表示する。なおカテゴリは以下とする。 応募・選考についての口コミ（1st） 選考までの段取り 面接・説明会や筆記試験 研修 応募 動機 塾の雰囲気や当初のイメージと違ったこと 指導で気をつけていること 実際に働いてみての口コミ（ 2nd ） 給与 勤務環境 プライベートとの両立 自分が成長できたこと 塾講師のやりがい 注目の学習塾の口コミ 「掲載されている求人が100件以上」かつ「公開ステータスの口コミ件数が1000件以上」の条件でランダムで5ブランドを抽出する。 各ブランドの中で最も登録日時の新しい口コミを表示す る 。 新着求人から塾講師バイトを探す 更新日時が最も新しい新着求人を4つ表示する。なお教室が被らないように抽出する。 急募求人から塾講師バイトを探す 更新日時が最も新しい急募求人を4つ表示する。なお教室が被らないように抽出する。 ページを閲覧した場合、以下の情報が入ったログを出力する。 日時、ユーザー番号、アクセスURI、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 3.2. 帳票 3.3. メールテンプレート 3.4. ワークフロー 【FIX】オシゴトQ＆A登録・回答・公開・編集・非公開・評価フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/design/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?node-id=141294-47164&amp;t=vBplIQV3YardDmND-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 上記以外で発生したエラー/例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 本画面を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read review list. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. 制限事項",
  "parentId": "703693175",
  "parentTitle": "030_■口コミ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/716243019/031_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-05-27T00:58:32.948Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】口コミ の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 エンドユーザーとログインしているユーザーが概要で挙げた帳票に登録されている情報を閲覧できる。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（ご意見）」を表示..."
}