{
  "id": "717521020",
  "title": "033_ 【FIX】教室口コミ詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能はエンドユーザーが、登録済みの 【FIX】口コミ を教室単位で閲覧するための機能です。 3. 要求事項 本ページで 表示する口コミ は、 【FIX】口コミ にて公開フラグが「公開」になっていて公開日が処理時点の同日か前のもののみとする。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（ご意見）」を表示する場合の質問内容のテキストは、同じ 【FIX】口コミグループ に紐づく 【FIX】口コミ の「カテゴリ」で選択されたテキストを表示する。（例：「勤務塾への応募動機」） 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている 企業の口コミは表示しない。 場合、下記の通りとする。 本ページをnoinedxとする。 総合満足度セクション、口コミ一覧セクションを非表示とし、代わりに「口コミの掲載がございません」と表示する。 表示する内容はデザインを基本とし、特記が必要なものを以下に記載する。 ページ全体を通じて、口コミ投稿者のユーザープロフィールは 012_【FIX】求人詳細閲覧機能 と同じ条件とする。 教室の口コミチャート は 012_【FIX】求人詳細閲覧機能 と同じ条件とする。また 塾ブランドの口コミ評価も表示する。 一覧フィルター用コンポーネント（応募・選考についての口コミ・実際に働いてみての口コミ） カテゴリー ごとに口コミの件数とともに ボタンとして表示する 。 デフォルトは「すべて」が押下されているものとする。 すべてを選択すると「すべて」以外も押下された状態とし、すべてを外すと「すべて」以外も押下されていない状態とする。 「すべて」以外のボタンが選択されているときはチャートを非表示にする。 各カテゴリーはチェックボックスとし、押下するとそのカテゴリーの口コミのみを絞り込んだ同ページを表示する。 そのカテゴリーの口コミが0件の場合もタイトルは表示するがチェックボックスを非活性とする。 口コミ一覧 1ページあたりの表示数を10件とし、表示対象のレコードが11件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 ログインしていない場合は、上位3件のみ完全表示し、それ以降は回答部分をマスキングした上でボタンを表示する。ボタン中、「ログインはこちら」を押下すると 042_【FIX】会員ログイン・ログアウト機能 に遷移し、それ以外の部分を押下すると 041_【FIX】会員新規登録機能 に遷移する。 口コミの内容は全文表示する。 該当教室の求人 表示項目はデザインを参照する。 同じエリアのバイト評判・口コミはこちら・同じ最寄り駅のバイト評判・口コミはこちら 表示している教室と同じ市区町村または最寄り駅にある教室から、ランダムに3つ教室を選び表示する。ただし同一ブランドから2つ以上は選ばないようにする。 塾ブランド 教室の口コミチャート は 012_【FIX】求人詳細閲覧機能 と同じ条件とする。 それぞれの教室から最も 登録日時 の新しい口コミを1件表示する。 この塾ブランド全体の評判・口コミを見る、を押下するとその塾ブランドの 034_ 【FIX】口コミブランド詳細閲覧機能 に遷移する。 この教室の口コミをもっと見る、を押下するとその教室の 033_ 【FIX】教室口コミ詳細閲覧機能 に遷移する。 ページにアクセスした際、次の情報が入ったログを出力する 日時、ユーザー番号、教室番号、アクセス元IPアドレス、ユーザーエージェント 3.1. 権限 3.2. 帳票 3.3. メールテンプレート なし 3.4. ワークフロー 3.4.1. 本機能 なし 3.4.2. 関連 【FIX】採用お祝い/口コミ確認・公開フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=137359-85818&amp;mode=design&amp;t=JeCE7j06P1QN3II9-0 4.2. 入力 4.3. 出力 4.4. 処理 4.5. エラー処理 4.6. ログ 詳細画面を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read classroom review detail. classroom_number={教室番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "703693175",
  "parentTitle": "030_■口コミ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/717521020/033_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-04T02:01:22.726Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能はエンドユーザーが、登録済みの 【FIX】口コミ を教室単位で閲覧するための機能です。 3. 要求事項 本ページで 表示する口コミ は、 【FIX】口コミ にて公開フラグが「公開」になっていて公開日が処理時点の同日か前のもののみとする。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（ご意..."
}