{
  "id": "718307540",
  "title": "282_【FIX】請求書明細新規作成機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】請求：請求明細 の登録済みのデータを1件新規追加するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが、上記の帳票データを新規登録することができる。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの「要件定義」-「入力」欄（ https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/718307540#4.2.-%E5%85%A5%E5%8A%9B ）で入力元が「入力フォーム」と定義されている項目 追加するボタン 請求詳細に戻るボタン 追加するボタン を押下すると入力項目に問題なければ、データベースにレコードを保存し、以下の処理を行う。 もし紐づく 【FIX】請求：請求明細 が50件あれば、「登録できる明細の最大数に達しました。」 というエラーメッセージを表示する。 紐づく 【修正中】請求：基本情報 の「請求金額」「税額」を再計算して更新する。 紐づく 【修正中】請求：基本情報 の「承認日時」「発行通知日時」「PDFファイルダウンロード日時」をNullに変更する。 全てエラーなく追加処理が完了したら、作成したことを示すポップアップを表示する。ポップアップには閉じるボタンを表示し、閉じるボタンを押下すると 273_【FIX】請求詳細閲覧機能 に遷移する。 入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 請求詳細に戻るボタンを押下すると 273_【FIX】請求詳細閲覧機能 に遷移する。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、管理者ID( 【FIX】全体管理者登録情報 のユーザー番号)、請求書明細番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 要求事項の記述に同じ 3.2. 帳票 概要の記述に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 270_■請求管理機能 の記載と同じ 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 新規登録画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=75804-20131&amp;mode=design&amp;t=Uql8fO42XzyB2pzQ-0 4.1.2. 新規登録完了ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=75751-19372&amp;mode=design&amp;t=LwpebP8I5JFGl7Od-0 4.2. 入力 変数名、説明、バリデーションは、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限 1 取引日 入力フォーム 必須 デートインプットとして入力できる。 2 請求対象商品 入力フォーム コンボボックスとする。 選択肢 は、 【FIX】商品マスタ（統合版） の各商品を「商品ID＿表示名称」の形式で表示したものとする。 3 請求項目名 入力フォーム 必須 「請求対象商品」が入力されている時は、該当商品の商品名が自動で設定される。その場合はフォームは非活性となる。 「請求対象商品」が入力されていない場合は入力できる。 4 単価 （税込） 入力フォーム 必須 「請求対象商品」が入力されている時は、該当商品の単価と税区分をもとに、税込の金額が 自動で設定される 。その場合はフォームは非活性となる。 「請求対象商品」が入力されていない場合は入力できる。 マイナスの金額も許容する（請求の合計額を調整するために）。 -19,999,999〜19,999,999とする。 5 税区分 入力フォーム 必須 デフォルトは「内税」が選択されている。 「外税」「内税」から選択する。 「請求対象商品」が入力されている時は、該当商品の税区分が自動で設定される。その場合はフォームは非活性となる。 「請求対象商品」が入力されていない場合は入力できる。 6 税率 入力フォーム 必須 デフォルトで「10」が入っている。 編集も可能である。 7 数量 入力フォーム 必須 8 単位 入力フォーム 必須 「請求対象商品」が入力されている時は、該当商品の単位が自動で設定される。その場合はフォームは非活性となる。 「請求対象商品」が入力されていない場合は「件」を設定し、非活性とする。 9 【作成中】帳票共通項目 で定める項目を持つ。 10 【作成中】帳票共通項目 で定める項目を持つ。 11 【作成中】帳票共通項目 で定める項目を持つ。 12 【作成中】帳票共通項目 で定める項目を持つ。 13 【作成中】帳票共通項目 で定める項目を持つ。 14 【作成中】帳票共通項目 で定める項目を持つ。 4.3. 出力 説明は帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 金額を表示するときは、文頭に&yen;をつけ3桁区切りのコンマ表示でテキスト表示する。 項目名 出力先 説明 1 請求書明細番号 データベース システムで自動発行する。 2 請求対象商品 画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。 3 請求番号 データベース 紐づく 【修正中】請求：基本情報 の請求番号を登録する。 4 商品番号 データベース 請求対象商品をもとに紐づく 【FIX】商品マスタ（統合版） の商品番号を登録する。 5 取引日 データベース／画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が入力された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 6 請求項目名 データベース／画面 請求対象商品が指定されている場合は自動で紐づく商品名を出力する。 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 7 単価 データベース／画面 請求対象商品が指定されている場合は自動で紐づく単価を出力する。 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 8 税区分 データベース／画面 請求対象商品が指定されている場合は自動で紐づく税区分を出力する。 「請求対象商品」が入力されていない場合は「内税」を設定する。 入力妥当性検査によるエラー発生時は画面の対象フォーム内に、入力された値が指し示す選択肢が選択された状態で表示する。エラーがない場合は入力された値にSQLインジェクション対策をしてデータベースに保存する。 9 税率 データベース／画面 請求対象商品が指定されている場合は自動で紐づく税率を出力する。 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 10 数量 データベース／画面 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 11 単位 データベース／画面 請求対象商品が指定されている場合は自動で紐づく単位を出力する。 「請求対象商品」が入力されていない場合は「件」を設定する。 入力妥当性検査によるエラー発生時は画面の対象フォーム内にHTMLエスケープ処理をして出力、エラーがない場合はSQLインジェクション対策をしてデータベースに保存する。 12 合計金額 データベース／画面 単価と数量から自動計算する。自動で設定した値をデータベースで登録する。 13 内消費税 データベース／ 画面 合計金額と税率から自動計算する。自動で計算した値をデータベースで登録する。 14 請求金額（税込） データベース 明細の新規追加に伴い、紐づく 【修正中】請求：基本情報 の同項目を更新する。 15 請求金額：税額 データベース 明細の新規追加に伴い、紐づく 【修正中】請求：基本情報 の同項目を更新する。 16 承認日時 データベース 明細の新規追加に伴い、紐づく 【修正中】請求：基本情報 の同項目をNullに変更する。 17 発行通知日時 データベース 明細の新規追加に伴い、紐づく 【修正中】請求：基本情報 の同項目をNullに変更する。 18 PDFファイルダウンロード日時 データベース 明細の新規追加に伴い、紐づく 【修正中】請求：基本情報 の同項目をNullに変更する。 19 作成者 データベース 【作成中】帳票共通項目 に従う。 20 作成日時 データベース 【作成中】帳票共通項目 に従う。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 4.4.1. 入力画面表示処理 本ページの「入力」に記載の全ての項目の入力フォームと登録ボタンを配置した画面を表示する。 4.4.2. 新規登録処理 入力フォームからのデータを受け取り、「入力」の定義にしたがって値の妥当性検査をおこなう。 入力項目値の妥当性に問題があった場合は、どの項目にどのような問題が発生したかわかるようにエラーメッセージを表示し、入力された値を入力フォーム内に表示・選択された状態で画面を出力して処理を終了する。 入力項目値の妥当性に問題がない場合は、入力された項目値と、作成日時、更新日時を操作している現在時刻とし、操作を行なっている全体管理者のユーザー番号を作成者/更新者に設定した上でデータベースに新規レコードとして挿入する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/906690562#1.1.-%E8%AB%8B%E6%B1%82%E9%9B%86%E8%A8%88%E5%87%A6%E7%90%86 の通り、 紐づく 【修正中】請求：基本情報 を更新する。 紐づく 【修正中】請求：基本情報 の「承認日時」「発行通知日時」「PDFファイルダウンロード日時」をNullに変更する。 273_【FIX】請求詳細閲覧機能 ページへリダイレクトし、新規データ登録が完了したことがわかるように以下のメッセージを表示し、処理を完了する。 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 新規登録画面を表示した場合に下記フォーマットでログを出力する。 User {全体管理者のユーザー番号} started to create invoice billing item. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 新規登録処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {全体管理者のユーザー番号} created invoice billing item. invoice_billing_item_number={請求書明細番号} invoice_number={請求番号} recalculation_target={再計算の対象として請求書明細番号をカンマ区切りで出力} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 レコード作成に失敗した場合 User {全体管理者のユーザー番号} failed to create invoice billing item. invoice_number={請求番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 基本情報の更新に失敗した場合 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/906690562#1.3.-%E3%83%AD%E3%82%B0 に従う。 5. スコープ外・制限事項 なし",
  "parentId": "718798916",
  "parentTitle": "280_■請求書明細管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/718307540/282_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-06T01:33:28.885Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【FIX】請求：請求明細 の登録済みのデータを1件新規追加するための機能です。 3. 要求事項 管理画面にログインできるシステム管理者、塾講師ステーション管理者のみが、上記の帳票データを新規登録することができる。 新規登録にあたって入力フォームに表示し入力可能な項目は以下の通り。 本ページの「要件定義」-「入力」欄（ ht..."
}