{
  "id": "719290510",
  "title": "【FIX】001_全体トップ",
  "content": "1. 目次 2. 概要 塾講師ステーションのTOPページである。 3. 要求事項 エンドユーザーおよび会員がログイン状態に関わらず使用することができる。 このページで扱う求人は、すべて塾ステーションの求人とする。 3.1ヘッダー 005_【FIX】ヘッダー・フッター・ハンバーガーメニュー 参照 3.2メインコンテンツ ファーストビューメイン検索エリア 求人数 選択した検索項目によって表示される該当求人数をつど切り替える。 サイトに掲載されている全ての求人の合計を表示する。 集計結果はキャッシュし、更新期間は1日とする。 以下、 3つの条件 を 検索モーダルから選択できる 。検索モーダルについては 011_【作成中】求人一覧閲覧・検索機能 で定義している。 勤務地 駅・路線 指導形態 給与 「検索する」ボタンを押下することで、絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 「詳しい条件で探す」テキストリンクを押下すると、 絞り込み条件なしでそのまま 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 前回使った条件で探す 前回使った条件を押下することで、該当の条件で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移することができる。 表示数は最新のものから順に最大5件とする。 保存期間は30日とする。 複数選択した項目の表示の掛け合わせは最大で 5つとし、6つ以上ある場合は6つ目以降を「...」で表 示する。 キーワードから探す 検索したいキーワードを入力し検索するボタンを押下することで、 入力したキーワードで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移することができる。 検索窓下部に 求人検索ページのキーワード候補 が表示され 、押下すると該当のキーワードで絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 に遷移する。キーワード候補は次の3つ 私服OK 週1日からOK 急募中の塾 社員やプロ講師求人を探す 押下すると 002_【FIX】キャリアトップ に遷移する。 新着求人から塾講師バイトを探す 新着の条件は次の通りである 掲載日時が7日前 より後で、かつ非掲載日時がないか非掲載日時から7日以上経っている。 急募求人設定がされている場合は、急募求人表示が優先される。 更新日時 が最も新しいものを2件、更新日時の降順で表示する。更新日時が同一の場合は作成時間の降順とする。 求人コンポーネントに表示する内容は 次のものとする 。 スライド画像 指導形態 作成日 更新日 教室タイトル 求人タイトル 求人コンポーネントをリンクとし、押下すると該当の 012_【FIX】求人詳細閲覧機能 に遷移する。 「一覧を見る」 テキストリンクを押下すると 、新着順に並べられた状態の 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 急募求人 から塾講師バイトを探す 急募の条件は次の通りである。 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在する場合 更新日時が最も新しいものを2件、更新日時の降順で表示する。更新日時が同一の場合は作成時間の降順とする。 求人コンポーネントに表示する内容は 次のものとする 。 スライド画像 指導形態 都道府県 教室タイトル 求人タイトル 求人コンポーネント全体をリンクとし、押下すると該当の​ 012_【FIX】求人詳細閲覧機能 に遷移する。 「一覧を見る」 テキストリンクを押下すると 、急募求人の中から新着順に並べられた状態の 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 指導形態から塾講師バイトを探す 【FIX】求人：基本情報 の指導形態をテキストリンクとして表示する。 各キーワードテキストリンクを押下すると 、 該当のキーワードで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 シフトから塾講師バイトを探す 【FIX】求人：勤務条件・指導科目 の「勤務条件」をテキストリンクとして表示する。 各キーワードテキストリンクを押下すると 、該当のキーワードで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 「そのほかの特徴から探す」ボタン 押下すると 011_【作成中】求人一覧閲覧・検索機能 に遷移し、 特徴から検索モーダルを開く 。 塾講師バイトの口コミ プランが「プレミアム/デラックス/グレードアップ」のプランに該当する求人の口コミを、新着順で 15 教室分 件表示する 。 抽出条件は以下の通りとする 企業が有効な契約を持っている 企業の 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が有効である 下の条件を満たす教室をランダムで15件表示抽出し、それぞれの教室の中からランダムで1つ口コミを表示する プランがプレミアム、デラックス、またはグレードアップ 掲載設定が「掲載」かつ公開設定が「公開」 1つの教室グループからは1つの教室のみ表示し、同じ教室グループに属する教室を2つ以上表示しない 口コミコンポーネントの表示内容は以下の通り。 教室のロゴ 教室名 口コミ数値 の平均値 の星表示（小数点第2位まで計算し、星半分刻みでの表示とする） 教室に紐づく総口コミ数 口コミの質問内容 口コミの回答 塾講師バイトの口コミコンポーネント全体をリンクとし、押下すると 033_ 【FIX】教室口コミ詳細閲覧機能 遷移する。 教室数を100の位以降 を切り捨て、口コミ数は1000の位以降を切り捨ててバナー内にテキスト表示する 。 「口コミから探す」ボタンを押下すると、 031_【FIX】 口コミ一覧閲覧機能 に遷移する。 人気の学習塾 380_バナー管理機能 で登録・指定したもの 6つ が表示される。 人気の学習塾コンポーネント全体をリンクとし、 押下すると 380_バナー管理機能 で登録した遷移先へ遷移する。 各コンポーネントに表示する内容は以下とする。 教室のロゴ 教室名 テキスト 380_バナー管理機能 で登録したテキスト。 注目の学習塾 380_バナー管理機能 で登録・指定したものが 4つ以下の条件で 表示される。 デラックスプランを4件表示する。 その下にグレードアップを表示し、カルーセル形式でスライドできる形とする。 380_バナー管理機能 で登録・指定したものからランダムで 15件を選択して表示し、 カルーセルで表に一度に表示される件数は6件とする。 人気の学習塾コンポーネント全体をリンクとし、 押下すると 380_バナー管理機能 で登録した遷移先へ遷移する。 各コンポーネントに表示する内容は以下とする。 教室のロゴ 教室名 テキスト 380_バナー管理機能 で登録したテキスト。 「学習塾一覧へ」を押下すると 016_ 【FIX】教室グループ一覧閲覧機能 へ遷移する。 学習塾を徹底解剖！人気の塾ブランド紹介 330_■記事管理機能 で設定した 人気の塾ブランド紹介記事を 一覧形式で見ることができる。 表示順は 330_■記事管理機能 で 設定した順番とする。 表示した記事コンポーネントを押下すると 022_ 【FIX】記事詳細閲覧機能 に遷移する。 「一覧を見る」テキストリンクを押すと、人気の塾ブランド紹介記事に絞り込まれた 021_【FIX】記事一覧閲覧／検索機能 に遷移する。 大学別おすすめ塾紹介 330_■記事管理機能 で設定した 大学別おすすめ塾紹介記事を 一覧形式で見ることができる。 更新日時の降順で3件並べ、更新日時が同一の場合は作成時間の降順とする。 記事コンポーネントを押下すると 022_ 【FIX】記事詳細閲覧機能 に遷移する。 「一覧を見る」テキストリンクを押すと、大学別おすすめ塾紹介記事に絞り込まれた 021_【FIX】記事一覧閲覧／検索機能 に遷移する。 お役立ち情報 バナーを押下すると 021_【FIX】記事一覧閲覧／検索機能 に遷移する。 はじめて塾講師をする方へ 塾講師マニュアル 以下の3つの記事をこの順番で左から順に表示し、押下するとそれぞれのページへ遷移する。 塾講師バイトの志望動機例文7選｜書き方・答え方・NG例も解説 URL： https://www.juku.st/info/entry/2668 塾講師バイトの自己PR例文や注意点を解説！ URL： https://www.juku.st/info/entry/2669 塾講師バイトの採用テスト・筆記試験対策を徹底解説 URL： https://www.juku.st/info/entry/227 各コンポーネントの表示項目は次の通りとする。 タイトル画像 記事タイトル 一覧下部に タイトルの右側に 「もっと見る」テキストリンクを表示する。押下すると、塾講師マニュアル記事に絞り込まれた 021_【FIX】記事一覧閲覧／検索機能 に遷移する。 塾講師ってどんなオシゴト？ 以下の3つの記事をこの順番で左から順に表示し、押下するとそれぞれのページへ遷移する。 塾講師バイトが語るやりがい5選！ URL： https://www.juku.st/info/entry/2687 大学生が塾講師バイトをする前に知っておきたいこと7選 URL： https://www.juku.st/info/entry/1760 「塾講師」or「家庭教師」あなたはどっち派？ URL： https://www.juku.st/info/entry/1129 各コンポーネントの表示項目は次の通りとする。 タイトル画像 記事タイトル 一覧下部に タイトルの右側に 「もっと見る」テキストリンクを表示する。押下すると、塾講師ってどんなオシゴト？で絞り込まれた 021_【FIX】記事一覧閲覧／検索機能 に遷移する。 FAQセクション 塾講師アルバイトに関するよくある質問 下記のカテゴリごとに、見出しを分けて順に表示される。 「塾講師アルバイトに関するよくある質問」 「塾講師バイトが初めての方」 「塾講師バイトの応募・面接対策」 各QAはアコーディオンメニューになっており、各質問文章全体が開閉リンクになっている。各質問の文章リンクを押下することで、回答が表示され閲覧することができる。 QAに付与される記事へのリンクは、テキストリンク形式で表示される。 すべての質問においてFAQPageの構造化マークアップを行う。 各QAの内容は 以下 全体トップFAQコンテンツ の通りである。 見出し：塾講師バイトの時給はどのくらい？ 本文：塾講師バイトの時給は、指導形態によって相場が変わってきます。集団指導の場合平均時給2,000円前後、高くて3,000円、個別指導の場合平均1,200円前後、高くて2,000円です。 飲食業界が平均1,100円前後であるため、いずれの指導形態も時給は高めであると言えます。 リンク：時給アップの方法など詳しく知りたい方はこちら&rarr; https://www.juku.st/info/entry/2653 見出し：塾講師バイトに学歴は求められる？ 本文：原則、応募要項に記載されている要件さえ満たしていれば、基本的に誰でも問題なく応募可能です。 アルバイトの場合、大抵は「大学生以上」と規定されていますので、その条件をクリアしていれば問題ありません。 リンク：塾講師バイトに必要とされる能力など詳しく知りたい方はこちら&rarr; https://www.juku.st/info/entry/449 見出し：塾講師バイトの面接対策はどうすればいい？ 本文：塾講師バイトになるためには、多くの場合面接とテストの2つの選考を突破する必要があります。 面接では、自己紹介・志望動機・自己PR・長所/短所・シフトなど基本的な項目に加え、得意科目・専攻科目や受験の経験有無についてなど教育系アルバイト特有の質問が課されることもあります。 面接対策のコツなど詳しく知りたい方はこちら&rarr; https://www.juku.st/info/entry/230 見出し：塾講師バイトの仕事内容とは？ 本文：主に生徒の学習指導・授業の準備や採点、質問対応が中心となります。 また、塾によっては学習・進路に関するアドバイスや塾運営に関わる事務業務を行うこともあり、それらの業務に対し事務手当てが支給されることもあります。 詳しく知りたい方はこちら&rarr; https://www.juku.st/info/entry/2709 見出し：応募から採用されるまでの流れは？ 本文：応募から採用までの流れは、基本的には①面接日程の連絡②選考までの準備③面接＆試験④結果通知の4つのステップになります。 詳しく知りたい方はこちら&rarr; https://www.juku.st/info/entry/579 都道府県から塾講師アルバイトを探す 都道府県を地域ごとにグルーピングして、各都道府県名をテキストリンクとする。 テキストリンクを押下すると、該当の都道府県 （または 海外 ） で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 政令指定都市 から塾講師アルバイトを探す 政令指定都市を地域ごとにグルーピングして、各政令指定都市名をテキストリンクとする。 テキストリンクを押下すると、該当の市で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 人気 の市区町村のリンク 人気のある市区町村がテキストリンクとして表示される 。抽出条件は 011_【作成中】求人一覧閲覧・検索機能 を参照することとする。 表示個数は8件とし、 並び順は 011_【作成中】求人一覧閲覧・検索機能 を参照すること とする 。 テキストリンクを押下すると、該当のエリアで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 人気の路線 リンク 人気のある路線が表示される。抽出条件は 011_【作成中】求人一覧閲覧・検索機能 を参照することとする。 表示個数は8件とし、 並び順は 011_【作成中】求人一覧閲覧・検索機能 を参照すること とする 。 テキストリンクを押下すると、該当の路線で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 人気の駅リンク 人気のある駅がテキストリンクとして表示される 。抽出条件は 011_【作成中】求人一覧閲覧・検索機能 を参照することとする。 表示個数は8件とし、 並び順は 011_【作成中】求人一覧閲覧・検索機能 を参照すること とする 。 テキストリンクを押下すると、該当の駅で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 フッター上の特徴タグ SEO対策として、以下の特徴で検索するページへのURLを含むタグを表示する。 交通費支給 服装自由 未経験歓迎 オンライン指導 中学生指導 研修充実 高校生指導 大学生歓迎 茶髪OK 中学受験指導 塾講師ステーションに掲載しませんか 「詳しくはこちら」ボタンを押下すると、 https://www.juku.st/info/entry/364 へ 遷移する。 3.3フッター 005_【FIX】ヘッダー・フッター・ハンバーガーメニュー 参照 3.4ハンバーガーメニュー 005_【FIX】ヘッダー・フッター・ハンバーガーメニュー 参照 3.2. 権限 要求の通り。 3.3. 帳票 概要および要求の通り。 3.4. メールテンプレート なし 3.5. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=7993-63603&amp;mode=design&amp;t=NeyMplMtJrc8gDU1-4 4.2. 入力 本機能の入力情報です 4.3. 出力 本機能の出力情報です 4.4. 処理 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.4.1. XXX処理 4.4.2. YYY処理 4.5. エラー処理 上記以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 画面を表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read station top. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "721092728",
  "parentTitle": "000_■全体・共通",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/719290510/FIX+001_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-07-10T08:51:11.347Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 塾講師ステーションのTOPページである。 3. 要求事項 エンドユーザーおよび会員がログイン状態に関わらず使用することができる。 このページで扱う求人は、すべて塾ステーションの求人とする。 3.1ヘッダー 005_【FIX】ヘッダー・フッター・ハンバーガーメニュー 参照 3.2メインコンテンツ ファーストビューメイン検索エリア 求人数 選択した検索項目によって表示される該当..."
}