{
  "id": "723812481",
  "title": "【FIX】口コミ",
  "content": "1. 概要 会員が回答した採用お祝いアンケート回答のアンケート項目とアンケート項目値を保存するテーブル サービスサイトの教室ページに口コミとして表示する。 【FIX】口コミグループ に対して 最大50個紐付け可能。 2. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 3. 詳細 項目 変数名 値の形式 制限 説明 1 口コミ番号 数値 自然数 システムで一意に発行する連番 2 口コミグループ番号 数値 自然数 指定の番号の 【FIX】口コミグループ が存在すること 【FIX】口コミグループ 3 口コミ項目番号 &nbsp; 数値 自然数 指定されたアンケート番号に定義済みの口コミ項目番号か 設定ファイルに定義するアンケート番号に対して定義する口コミ項目番号とラベルから選択 なおアンケート番号は、紐 づ く 【FIX】口コミグループ に紐づく 【レビュー中】採用お祝い申請 を参照する 4 口コミ数値 &nbsp; 数値 自然数 口コミ項目の回答形式に適した値であるか 口コミ項目の回答形式が「選択式」「５段階評価」「評価点」もくは「数値」の場合の値を格納する 選択肢は https://giginc.atlassian.net/l/cp/LfkcYjLp を参照 5 口コミ文字列値 &nbsp; 文字列 文字制限は 共通要件 の定義に従う。 10000文字以下 口コミ項目の回答形式が文字列の場合に値を格納する 6 公開フラグ &nbsp; 単一選択 選択肢の中のいずれかの値 ステータスは選択肢から入力してください。 「非公開」「公開」「公開待ち」から選択する。 7 公開日 &nbsp; &nbsp; 日時 年は&nbsp;2008 以上 2045 以下 口コミ情報の公開を開始する年月日を指定する。 公開状態が「公開待ち」の場合に指定した場合に、指定日になると公開状態を「公開」に変更する。 8 【作成中】帳票共通項目 で定める項目を持つ。 9 【作成中】帳票共通項目 で定める項目を持つ。 10 【作成中】帳票共通項目 で定める項目を持つ。 11 【作成中】帳票共通項目 で定める項目を持つ。 12 【作成中】帳票共通項目 で定める項目を持つ。 13 【作成中】帳票共通項目 で定める項目を持つ。 4. 口コミ項目 4.1. アンケート1回目（採用後） 口コミ項目番号 アンケート番号 質問内容 回答形式 説明 サービスサイト上の扱い 口コミ 口コミ：ラベルのテキスト 満足度 満足度：分類 1 1 選考までの段取りについて 文字列 自由記述式テキストエリア ◯ 「選考までの段取り」 ー ー 2 選考までの段取りについての点数 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 段取り 3 応募から最初の連絡までの日数 選択式 「1日」「2日」「3日」「4日」「5日以上」から選ぶ。 ー ー ー ー 4 最初の連絡方法 選択式 「電話」「メール」から選ぶ。 ー ー ー ー 5 面接・説明会や筆記試験について 文字列 ◯ 「面接・試験」 ー ー 6 面接・説明会や筆記試験についての点数 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 面接・説明会 7 研修について 文字列 自由記述式テキストエリア ◯ 「研修」 ー ー 8 研修についての点数 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 研修 9 研修期間 選択式 「なし」「1週間程度」「2週間程度」「1ヶ月程度」「2ヶ月程度」「3ヶ月以上」から選ぶ。 ー ー ー ー 10 塾の雰囲気や当初のイメージと違ったこと 文字列 ◯ 「塾の雰囲気」 ー ー 11 求人と実際の勤務条件は同じでしたか？ 選択式 「同じ」「違う」「覚えていない」から選ぶ。 ー ー ー ー 12 （違うと回答した方のみ）相違点を教えて下さい 文字列 ー ー ー ー 13 カテゴリ 選択式 「勤務塾への 志望 応募 動機」&nbsp;「指導で気をつけていること」から選ぶ。 ー ー ー ー 14 塾について（ご意見） 文字列 ◯ カテゴリ の選択結果に応じてそれぞれ「応募動機」「指導の工夫」 ー ー 15 当サイトへのご意見 文字列 ー ー ー ー 16 口コミ・ランキングは参考になりましたか？ 選択式 「たいへん参考になった」「参考になった」「どちらともいえない」「あまり参考にならなかった」「見ていない」から選ぶ。 ー ー ー ー 17 口コミ・ランキングについて（ご意見） 文字列 ー ー ー ー 4.2. アンケート2回目（6ヶ月後） 口コミ項目番号 アンケート番号 質問内容 回答形式 説明 サービスサイト上の扱い 口コミ 口コミ：ラベルのテキスト 満足度 満足度：分類 1 3 勤務満足度（給料） 選択肢 1、2、3、4、5から選ぶ。 ー ー ◯ 勤務環境 2 勤務満足度（給料コメント） 文字列 自由記述式テキストエリア ◯ 「勤務環境」 「給料」 ー ー 3 勤務満足度（人間関係・上司） 選択肢 1、2、3、4、5から選ぶ。 ー ー ◯ 勤務環境 4 勤務満足度（人間関係・上司コメント） 文字列 自由記述式テキストエリア ◯ 「勤務環境」 ー ー 5 勤務満足度（人間関係・同僚） 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 勤務環境 6 勤務満足度（人間関係・同僚コメント） 文字列 自由記述式テキストエリア ◯ 「勤務環境」 ー ー 7 勤務満足度（システム） 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 勤務環境 8 勤務満足度（システムコメント） 文字列 自由記述式テキストエリア ◯ 「勤務環境」 ー ー 9 プライベートとの両立 選択式 1、2、3、4、5から選ぶ。 ー ー ◯ 勤務環境 10 プライベートとの両立（コメント） 文字列 自由記述式テキストエリア ◯ 「プライベートとの両立」 ー ー 11 授業外業務の給与について 選択式 「コマ給・授業給に含まれている」「固定の事務給がある」「業務時間に応じて給与が発生する」「発生しない」「授業外業務が無い」から選ぶ。 ー ー ー ー 12 自分が成長できたこと 文字列 自由記述式テキストエリア ◯ 「自己成長」 ー ー 13 塾講師のやりがい 文字列 自由記述式テキストエリア ◯ 「塾講師のやりがい」 ー ー 14 他の人に紹介したいか 選択式 「強く思う」「思う」「あまり思わない」「全く思わない」から選ぶ。 ー ー ー ー 15 他の人に紹介したいか（その理由をお書きください） 文字列 自由記述式テキストエリア ー ー ー ー",
  "parentId": "684523528",
  "parentTitle": "【FIX】口コミグループ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/723812481/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-01-14T10:00:33.337Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 概要 会員が回答した採用お祝いアンケート回答のアンケート項目とアンケート項目値を保存するテーブル サービスサイトの教室ページに口コミとして表示する。 【FIX】口コミグループ に対して 最大50個紐付け可能。 2. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 3. 詳細 項目 変数名 値の形式 制限 説明 1 口コミ番号 数値 自然数 システムで一意に発行する連番 2 口コミ..."
}