{
  "id": "724271684",
  "title": "【FIX】求人：応募条件・研修情報",
  "content": "1. 概要 クライアント企業から提供された 求人フォーマット（本システム外） をもとに、全体管理者が全体管理画面の、あるいはクライアント企業管理者がクライアント企業向け管理画面の、それぞれ対象の教室の求人管理ページに登録する求人の付帯情報。 【FIX】求人：基本情報 1件に対して1レコード作成される。 2. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】求人登録・公開・削除フロー 3. 詳細 入力項目 変数名 値の形式 制限 説明 1 求人番号 数値 自然数 指定した番号の 【FIX】求人：基本情報 が存在すること 2 応募資格 複数選択 紐付け先の 【FIX】求人：基本情報 の「教室番号」で指定した 【FIX】教室：基本情報／所在地 の「対象サイト」の設定値によって、設定可能な選択肢が異なるため、説明欄にそれぞれの選択肢を記載する。 「文系限定」と「理系限定」は同時選択不可 「大学生以上」または「大学生限定」と「大卒以上」は同時選択不可 「学歴不問」は、「大学生以上」「経験者限定」「理系限定」「文系限定」「大卒以上」と同時選択不可 紐付け先の教室の「対象サイト」によらず選択可能な選択肢。 「大学生以上」「経験者限定」「理系限定」「文系限定」 「既卒・社会人経験不問」「ブランクＯＫ」 紐付け先の教室の「対象サイト」が「ステーション」の場合のみ選択可能な選択肢。 「 大学生限定 」「 短大生OK 」「 専門学校生OK 」「 留学生OK 」 紐付け先の教室の「対象サイト」が「キャリア」の場合のみ選択可能な選択肢。 「 大卒以上 」「 学生不可 」「 要教育免許 」「プロ講師募集」 「学歴不問」 「雇用形態」が「正社員」「契約社員」の場合のみ選択可能とする。 3 応募資格：補足説明 文字列 100文字以下 共通要件 の定義に従う 4 歓迎 複数選択 「大学生歓迎」「大学１年生歓迎」 「未経験者歓迎」「主婦（主夫）歓迎」 「経験者歓迎」 「理系歓迎」「フリーター歓迎」「帰国子女歓迎」「女性歓迎」「シニア歓迎」「近隣の方歓迎」「中学受験経験者歓迎」「高校受験経験者歓迎」「 推薦型入試経験者歓迎 」 「第二新卒歓迎」 から選択する。 紐付け先の教室の「対象サイト」が「キャリア」（雇用形態問わず）の場合に表示しない選択肢。 「大学生歓迎」「大学１年生歓迎」 雇用形態が「正社員」「契約社員」の場合のみ選択可能な選択肢。 「大学受験経験者歓迎（一般入試）」 選択欄の下部には、「推薦型入試経験者歓迎を選んだ場合、AO入試や学校選抜などの形態の補足をお願いします。」と注意書きを記載する。 5 歓迎：補足説明 文字列 100文字以下 共通要件 の定義に従う 6 こんな方に来てほしい！ 文字列 500文字以下 共通要件 の定義に従う 7 研修期間 文字列 20文字以下 「約1ヶ月、3回」の様な入力を想定する。 8 研修給与単位 単一選択 「時給」「日給」「月給」「授業」「コマ」から選択する。 ただし「月給」は塾講師ステーションに表示する求人には適用しない （ CTJ-1652 0f376871-0459-35fc-b139-2a34c915ec22 System Jira ） 9 研修給与単位：授業、コマ 文字列 半角数字のみ 5文字以下の数値で入力 「授業」または「コマ」を選択された場合、指導時間数の記入が必要。 10 研修給与金額 数値 自然数 共通要件 の定義に従う 入力画面には、最低時給より下の金額は登録できない旨の説明を付与する。 11 研修給与補足：補足説明 文字列 50文字以下 共通要件 の定義に従う 12 研修内容 文字列 500文字以下 共通要件 の定義に従う 13 備考 文字列 150文字以下 共通要件 の定義に従う 14 【作成中】帳票共通項目 で定める項目を持つ。 15 【作成中】帳票共通項目 で定める項目を持つ。 16 【作成中】帳票共通項目 で定める項目を持つ。 17 【作成中】帳票共通項目 で定める項目を持つ。 18 【作成中】帳票共通項目 で定める項目を持つ。 19 【作成中】帳票共通項目 で定める項目を持つ。",
  "parentId": "686129350",
  "parentTitle": "【FIX】求人：基本情報",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/724271684/FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-11T07:59:38.089Z",
  "author": "isamu saito",
  "excerpt": "1. 概要 クライアント企業から提供された 求人フォーマット（本システム外） をもとに、全体管理者が全体管理画面の、あるいはクライアント企業管理者がクライアント企業向け管理画面の、それぞれ対象の教室の求人管理ページに登録する求人の付帯情報。 【FIX】求人：基本情報 1件に対して1レコード作成される。 2. ワークフロー 【FIX】クライアント企業契約・登録・更新・契約終了フロー 【FIX】求人登..."
}