{
  "id": "738526021",
  "title": "185_【FIX】急募新規登録機能",
  "content": "1. 目次 2. 概要 本機能は求人の急募情報（急募契約 【FIX】契約情報（統合版） 1件およびそれに紐づく 【FIX】急募オプション申込付帯情報 複数件）を新規追加するための機能です。 3. 要求事項 全体管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を使用できる。 本機能へは https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/708935738 から特定の企業の急募作成ボタンを押下することで遷移する。 新規登録にあたって入力フォームに表示し入力可能な項目はWFの通りとし、特筆すべき内容のみここで記載する。 適用条件の選択 対象サイト 有効な契約が存在する対象サイトを選択肢として表示する。 教室グループ 有効な契約が存在する教室グループを選択肢として表示する。 掲載 適用 開始日 現在日以降を選択可能とする。 掲載 適用 期間 購入可能な商品で定義されている急募期間の種類をすべて選択肢として表示する。 購入可能な商品は下記を満たすものとする。 「公開フラグ」が「公開」である 「購入可フラグ」が「可」である 現在の月が、「契約可能月」に含まれる 「対象サイトが」本ページで入力した「対象サイト」で選択した対象サイトと一致する。 「オプション種別が」「急募」である。 「急募追加数」が本ページで入力した「まとめ買い」数と一致している。 ただし、まとめ買い」で何も選択していない場合は特に制限しない。 同じ「有効期間：月数」で購入可能な商品が複数あった場合、表示する商品は、商品番号の最も小さい商品とする。 表示名は、 [商品ID]_[商品の表示名称]_[商品の有効期間月数]ヶ月 とする。 まとめ買い 購入可能な商品で定義されている「急募追加数」の内、2以以上のものを選択肢として表示する。 購入可能な商品の定義は「掲載期間」における定義の内、「急募追加数」の定義以外と同様とする。 掲載件数 「求人選択」にて選択した求人数がリアルタイムで反映される。 請求金額 「掲載期間」の選択によって選択された 【FIX】商品マスタ（統合版） の単価に、「掲載件数」をかけた合計金額が表示される。税込金額および税額を表示する。 求人選択 紐づく求人の一覧を表示し、一覧上でチェックボックスにより求人を複数選択できる。 「まとめ買い」で商品を選択した場合、その商品の「急募追加数」を上限として複数求人を選択でき、上限まで達したら他の選択肢は選択不可とする。 求人一覧 は、一覧フィルターコンポーネントで絞り込んで表示できる。 本ページで入力した「対象サイト」「教室グループ」に一致する求人のみが表示され、 最大600件 選択可能とする。 「対象サイト」「教室グループ」「適用開始日」「適用期間」が未入力の場合は、検索ボタンは非活性として絞り込みできないものとする。 一覧フィルター用コンポーネントは以下の通りとする。 表示項目はWFにて定義の通りで全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 選択式のフィルター項目では、何も選択・入力していない状態を初期値とする。 各フィルター項目は基本的にWFを参照する。 「求人番号」と「求人番号以外の項目」は、どちらか一方しか入力できないものとする。（一方を入力したらもう一方は非活性として入力は無効とする） 求人番号はスペース区切りで最大600件入力して、それぞれ完全一致のOR検索で絞り込み可能とする。 求人は登録日時の降順で表示する。 ステーションに紐づく教室の求人である場合はレコードを薄いオレンジにし、キャリアに紐づく教室の求人である場合は薄い青色とする。 契約を追加するボタン 押下すると、入力内容に問題がある場合は、同入力フォームページのフォームに入力された値を表示した状態で、どの入力項目に問題があるかわかるようにエラーメッセージを表示する。 選択した期間における基本契約が存在しない場合のエラーメッセージは「対象期間の契約が存在しないか、契約期間を超えています。先に契約を作成してください。」とする。 エラーチェックで問題がなければ確認用のモーダルを表示する。 モーダル上の実行ボタンを押すと、下記のレコードをデータベースに保存し、作成したことを示すモーダルを表示 し、 【作成中】急募申込完了通知メール（クライアント企業管理者向け） を送信 する。モーダルには閉じるボタンを配置し、 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/713490472 に遷移する。 【FIX】契約情報（統合版） （まとめ買いの選択有無によらず共通 ） 商品：「掲載期間」欄および「まとめ買い」欄で選択した商品の 【FIX】商品マスタ（統合版） の内、最も若い番号の商品が設定される。 対象サイト：本機能で入力した値 教室グループ：本機能で入力した値 有効期間開始日：本機能で入力した「掲載開始日」 有効期間終了日：指定した商品の有効期間が反映された終了日＋1日が設定される。 親基本契約：「対象サイト」「教室グループ」での入力値に一致する有効な基本契約 その他の値は https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558 の定義と同様とする。 【FIX】契約情報（統合版） （まとめ買いを選択した場合 ） 数量：「1」 【FIX】契約情報（統合版） （まとめ買いを選択しなかった場合） 数量：選択した求人数 【FIX】急募オプション申込付帯情報 作成した 【FIX】契約情報（統合版） の契約番号および指定した求人の求人番号を紐づける。 選択した 【FIX】商品マスタ（統合版） の「急募数」&times; 【FIX】契約情報（統合版） の「数量」の数を上限として選択した求人数分の 【FIX】急募オプション申込付帯情報 を作成する。 モーダル上のキャンセルボタンを押すと、レコードは作成せずにモーダルを閉じる。 キャンセルボタン 押下すると https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/708935738 に遷移する。 【FIX】契約情報（統合版） の新規登録に成功した場合、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/714211558 の「3.要求 - 5」に記載の請求データ作成処理を併せて行う。 新規登録で成功または失敗した場合、以下の情報が入ったログを出力する。 日時、クライアント企業管理者ID、契約番号、急募オプション申込付帯情報番号、アクセス元IPアドレス、ユーザーエージェント、アクション（成功or失敗） 3.1. 権限 概要と同じ 3.2. 帳票 概要と同じ 3.3. メールテンプレート なし 3.4. ワークフロー 【FIX】オプション申込・登録・解除フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. 急募申込画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=122548-36164&amp;mode=design&amp;t=f5KE68g9o2vLaGm3-0 4.1.2. 最終確認画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=122548-36147&amp;mode=design&amp;t=f5KE68g9o2vLaGm3-0 4.2. 入力 4.3. 処理 4.4. エラー処理 4.5. ログ 新規登録画面を表示した場合に下記フォーマットでログを出力する。 User {全体管理者のユーザー番号} started to create urgent_option. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 新規登録処理を実行した場合に下記フォーマットでログを出力する。 成功した場合 User {全体管理者のユーザー番号} created urgent_option. contract_number={契約番号} urgent_option_number={急募オプション申込付帯情報番号,,,} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 失敗した場合 User {全体管理者のユーザー番号} failed to create urgent_option. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "704381048",
  "parentTitle": "180_■急募管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/738526021/185_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-04-28T02:57:18.734Z",
  "author": "ejiri_yusuke",
  "excerpt": "1. 目次 2. 概要 本機能は求人の急募情報（急募契約 【FIX】契約情報（統合版） 1件およびそれに紐づく 【FIX】急募オプション申込付帯情報 複数件）を新規追加するための機能です。 3. 要求事項 全体管理画面にログインできるシステム管理者、塾講師ステーション管理者、ゲスト管理者のみが本機能を使用できる。 本機能へは https://giginc.atlassian.net/wiki/sp..."
}