{
  "id": "739115051",
  "title": "337_【不要のため削除】記事承認依頼・承認機能",
  "content": "※ https://gig-inc.slack.com/archives/C04E48QPVC0/p1722303195813099?thread_ts=1721804996.763449&amp;cid=C04E48QPVC0 より機能不要と確認したため削除 1. 目次 2. 概要 本機能は 【作成中】記事 登録済みのデータの承認依頼並びに、承認をするための機能です。 3. 要求事項 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704545028 による記事新規登録時の承認ステータスに関して 記事担当者が記事を作成した場合のみ、記事作成時に承認ステータスが「未」となり、「承認依頼」をする必要がある。 全体管理者、塾講師ステーション管理者、塾講師ステーション担当者、記事管理者が記事を作成した場合、承認依頼をせずとも記事の承認ステータスは「済」で登録されるため、「承認依頼」は不要となる。 承認ステータスの変更のためには https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 に遷移する必要があるため、各記事の「タイトル」テキストリンクを押下する必要がある。 承認ステータスに関しては各記事のステータスによって異なるため、本ページの「要件定義」-「出力」欄で定義されている項目を参照する。 「承認依頼」機能に関して 承認ステータスが「未」の時にのみ表示することができる。 管理画面にログインすることができる全体管理者、塾講師ステーション管理者、記事担当者が「承認依頼」ボタンを押下し、承認を依頼することができる。 記事担当者は 【作成中】記事 が自身のユーザー番号に紐付く記事のみ、承認依頼機能を利用することができる。 全体管理者と、塾講師ステーション管理者、記事担当者が「承認依頼」ボタンを押下すると、塾講師ステーション担当者、記事管理者宛に承認依頼メールが送信される。 塾講師ステーション担当者、記事管理者、 【作成中】記事 が自身のユーザー番号に紐付かない記事担当者は、 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 にて詳細は確認可能だが、画面上に「承認依頼」ボタンは表示されず、承認依頼機能を利用することができない。 ギフト券担当者は承認依頼機能を利用することはできない。 登録されている 【作成中】記事 1件の登録済み情報を閲覧し、本ページの「要件定義」-「入力」欄で定義されている項目を編集することができる。 承認ステータスが「未」の対象記事のタイトルを押下して https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 に遷移し、承認ステータスを変更するためには、下記の対応をする必要がある。 承認ステータスが「未」の記事に対して「承認依頼」ボタンを押下すると「この記事の承認依頼メールを送信しますか？」と記載された確認ダイアログが表示され、確認ダイアログで「OK」ボタンを押下することで承認ステータスを「確認中」に変更することができる。 確認ダイアログに表示された「キャンセル」ボタンを押下すると、承認メールが送信されないまま確認ダイアログが閉じる。 確認ダイアログに表示された「OK」ボタンを押下すると、画面上部に「メールを送信しました。」と表示され、承認ステータスが「確認中」に変更される。また、上部に表示されたテキストリンクが「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「差戻」テキストリンク、「承認」テキストリンクに変更される。 「承認」機能に関して 承認ステータスが「確認中」の時にのみ表示することができる。 管理画面にログインすることができる全体管理者と、塾講師ステーション管理者、塾講師ステーション担当者、記事管理者が承認機能を利用することができる。 記事担当者は、記事を新規登録することは可能だが、承認機能は利用することができない。 ギフト券担当者は承認機能を利用することはできない。 登録されている 【作成中】記事 1件の登録済み情報を閲覧し、本ページの「要件定義」-「入力」欄で定義されている項目を編集することができる。 承認ステータスが「確認中」の記事に表示されている「承認」テキストリンクを押下すると「承認してもよろしいですか？」と記載された確認ダイアログが表示され、確認ダイアログに表示された「OK」ボタンを押下すると、画面上部に「承認しました。」と表示され、承認ステータスが「済」に変更される。 上部に表示されたテキストリンクが「記事を確認」テキストリンク、「編集」テキストリンク、「削除 」テキストリンク、「公開に変更」テキストリンクに変更される。 確認ダイアログに表示された「キャンセル」ボタンを押下すると、承認ステータスは変更しないまま確認ダイアログが閉じる。 「差戻」機能に関して 承認ステータスが「確認中」の時にのみ表示することができる。 管理画面にログインすることができる全体管理者と、塾講師ステーション管理者、塾講師ステーション担当者、記事管理者が差戻機能を利用することができる。 記事担当者は、記事を新規登録することは可能だが、承認機能は利用することができない。 ギフト券担当者は承認機能を利用することはできない。 登録されている 【作成中】記事 1件の登録済み情報を閲覧し、本ページの「要件定義」-「入力」欄で定義されている項目を編集することができる。 承認ステータスが「確認中」の記事に表示されている「差戻」テキストリンクを押下すると「差戻してもよろしいですか？」と記載された確認ダイアログが表示され、確認ダイアログで「OK」ボタンを押下することで承認ステータスを「修正中」に変更することができる。 確認ダイアログに表示された「キャンセル」ボタンを押下すると、承認ステータスは変更しないまま確認ダイアログが閉じる。 確認ダイアログに表示された「OK」ボタンを押下すると、 画面上部に「メールを送信しました。」と表示され 、承認ステータスが「修正中」に変更される。また、上部に表示されたテキストリンクが「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「承認依頼」ボタンに変更される。 3.1. 権限 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703496344 3.2. 帳票 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703496344 3.3. メールテンプレート 本機能で扱うメールテンプレートページへのリンクです ※親ページの定義に包含される場合は、親ページへのリンクを記載します 3.4. ワークフロー 3.4.1. 本機能 【FIX】記事登録・公開・非公開・削除フロー 3.4.2. 関連 【FIX】ピックアップ記事選定フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 該当するワイヤフレーム定義ページへのリンクです 4.2. 入力 変数名、説明、バリデーションは、 【作成中】記事 の記載を前提とし、本ページに固有の特記事項のみ記載する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703496344 に記載の共通入力・取得項目は項目自体を省略する。 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 記事番号 入力フォーム （隠しフォーム） 「承認依頼」「承認」「差戻」する対象の記事の記事番号を一つのみ入力することができる。 入力がない、または、要素が自然数ではない、または指定番号の記事レコードがデータベースに存在しない場合 エラーメッセージは出力せず、正しい番号に対してのみ処理を実行する。 2 承認依頼 入力フォーム テキストリンク 【FIX】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「記事担当者」で、承認ステータスが「未」の記事に対して表示され、操作を行うことができる。 記事担当者は 【作成中】記事 が自身のユーザー番号に紐付く記事のみ表示され、操作を行うことができる。 3 承認 入力フォーム テキストリンク 【FIX】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「塾講師ステーション担当者」「記事管理者」で、承認ステータスが「確認中」の記事に対して表示され、操作を行うことができる。 4 差戻 入力フォーム テキストリンク 【FIX】全体管理者登録情報 の管理者種別が「全体管理者」「塾講師ステーション管理者」「塾講師ステーション担当者」「記事管理者」で、承認ステータスが「確認中」の記事に対して表示され、操作を行うことができる。 4.3. 出力 説明は、 【作成中】記事 の記載を前提とし、本ページに固有の特記事項のみ記載する。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/703496344 に記載の共通出力項目は項目自体を省略する。 出力項目 出力先 説明 1 承認ステータス データベース/画面 承認ステータスは「未」「確認中」「修正中」「済」から表示される。 対象記事の承認ステータスが「未」の場合 記事担当者が https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704545028 によって新規記事を登録した場合のみ、承認ステータスは「未」となる。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 の上部には「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「承認依頼」ボタンを表示する。 対象記事の承認ステータスが「済」の場合 全体管理者、塾講師ステーション管理者、塾講師ステーション担当者、記事管理者が https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704545028 によって記事を登録した場合、承認依頼をせずとも記事の承認ステータスは「済」となる。 記事担当者が記事作成後、「承認依頼」をし「承認」された場合、承認ステータスは「済」となる。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 の上部には「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「公開に変更」テキストリンクを表示する。 対象記事の承認ステータスが「確認中」の場合 承認ステータスが「未」の記事に対して全体管理者、塾講師ステーション管理者、記事担当者が「承認依頼」ボタンを押下すると「この記事の承認依頼メールを送信しますか？」と記載された確認ダイアログが表示され、確認ダイアログで「OK」ボタンを押下することで承認ステータスを「確認中」に変更することができる。 「承認」または「差戻」がされるまで「承認ステータス」は「確認中」のままとなる。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 の上部には「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「承認」テキストリン、「差戻」テキストリンクを表示する。 対象記事の承認ステータスが「修正中」の場合 承認ステータスが「確認中」の記事が全体管理者、塾講師ステーション管理者、塾講師ステーション担当者、記事管理者から「差戻」をされた場合に「修正中」の承認ステータスになる。 https://giginc.atlassian.net/wiki/spaces/CLIENTTOMO/pages/704577796 の上部には「記事を確認」テキストリンク、「編集」テキストリンク、「削除」テキストリンク、「承認依頼」ボタンを表示する。 4.4. 処理 本機能を実行する際にシステム内で行う処理です。複数処理がある場合は配下の階層に分けて記載します。 4.4.1. XXX処理 処理の詳細説明です。 4.4.2. YYY処理 処理の詳細説明です。 4.5. エラー処理 処理を実施した際に行うエラー処理です 4.6. ログ 処理を実施した際にシステム内で出力するログです 5. スコープ外・制限事項 本機能でスコープ外、または制限事項とする内容です",
  "parentId": "703496344",
  "parentTitle": "330_■記事管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/739115051/337_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-07-30T01:45:24.371Z",
  "author": "ejiri_yusuke",
  "excerpt": "※ https://gig-inc.slack.com/archives/C04E48QPVC0/p1722303195813099?thread_ts=1721804996.763449&amp;cid=C04E48QPVC0 より機能不要と確認したため削除 1. 目次 2. 概要 本機能は 【作成中】記事 登録済みのデータの承認依頼並びに、承認をするための機能です。 3. 要求事項 https..."
}