{
  "id": "744423716",
  "title": "751_【FIX】面接日リマインドメール送信バッチ",
  "content": "1. 概要 面接日が近づいた際、会員にリマインド通知を行うもの。 本バッチ処理は毎日10:00 (JST)に自動で以下の処理を行う。 面接日が 翌日 であり 、面接日リマインドメール送信時間が登録されていない応募情報について、応募した会員にリマインドを1回メールで行う。 2. 要求事項 コマンドラインで実行する。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力する。 【FIX】応募情報 から下記条件に当てはまるレコードを抽出し、レコードごとにメール送信処理を行う。 採用ステータス（企業）が「未登録」である。 面接日 が処理時点の翌日である。 「面接日リマインドメール送信日時」が空である。 801_バウンスメール処理バッチ で保存したバウンスしているメールアドレスかどうか確認し、バウンスメールアドレスに該当するならメール送信処理は行わず以下の情報が入ったログを出力する。 実行日時、ユーザー番号、メール送信をスキップしたことがわかる情報 バウンスメールアドレスに該当しない場合、対象の会員のメールアドレスに 【作成中】面接日程リマインドメール（会員宛） を送信し、送信を実行したら以下の情報が入ったログを出力する。 実行日時、ユーザー番号、応募番号、アクション（成功or失敗） メール送信が失敗した場合はリトライ処理を行わない。 連続してメール送信する場合は、各メールごとに 0.1秒間スリープ処理 を行う。 必達終了時間は11:00(JST)とする。処理開始日時から処理終了日時まで1時間以内に完了するようにパフォーマンスを確保する。 上記仕様で問題なく処理を実行できる目安となる件数は1,000件である。1時間以内に最大1,000件の処理を行えるパフォーマンスを確保する。 バッチ処理終了時には、バッチ処理が終了した旨のメッセージと終了日時を含んだログを出力する。 本機能からメールを送信した際、 【作成中】メール送信履歴 を保存する。 2.1. メールテンプレート 【作成中】面接日程リマインドメール（会員宛） 2.2. ワークフロー 【FIX】オファー・応募・選考・採用フロー 3. 要件定義 3.1. 入力 入力項目 変数名 入力方式 説明 バリデーション コマンドラインオプション &nbsp; コマンドライン コマンドラインで実行する際に、 メールを送信をするかどうかをコマンドラインに引数で指定できるように実装する。 &nbsp; メールテンプレート &nbsp; ファイル メールの本文のテンプレート &nbsp; 3.2. 出力 出力項目 出力方式 説明 面接日リマインドメール送信日時 データベース 送信した日時を登録する。 詳細は 【FIX】応募情報 を参照 3.3. 処理 3.4. エラー処理 下記通知先にエラーログ通知を行う。 【FIX】バッチエラー時通知先 3.5. ログ バッチ略称はsend_remind_interview_mail (SRIM) とする。 バッジ処理全体が開始した時と終了した時に以下のログを出力する。 開始時 [751_SRIM] Started at {処理開始日時}. 終了時 [751_SRIM] Finished at {処理終了日時}. メール送信時 成功時 [751_SRIM] Succeeded to send remind interview email for user_number={ユーザー番号} application_number={応募番号} time={現在時刻}. 失敗時 [751_SRIM] Failed to send remind interview email for for user_number={ユーザー番号} application_number={応募番号} time={現在時刻}. バウンスメール対応でメール未送信時 [751_SRIM] Sending pending because of bounce mail for user_number={ユーザー番号（複数時はカンマ区切り）} time={現在時刻}. 4. スコープ外・制限事項 なし",
  "parentId": "743703182",
  "parentTitle": "750_■応募・面接関連バッチ",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/744423716/751_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-14T10:14:26.359Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 概要 面接日が近づいた際、会員にリマインド通知を行うもの。 本バッチ処理は毎日10:00 (JST)に自動で以下の処理を行う。 面接日が 翌日 であり 、面接日リマインドメール送信時間が登録されていない応募情報について、応募した会員にリマインドを1回メールで行う。 2. 要求事項 コマンドラインで実行する。 バッチ処理を開始したらバッチ処理を開始した旨のメッセージと現在日時を含むログを出力す..."
}