{
  "id": "772014210",
  "title": "【レビュー中】レコード削除時の動作一覧",
  "content": "1. 概要 帳票のレコードを削除した際の動作方針を定義する。 ここに記載しきれない、詳細な動作は各要件定義にて定める。 2. 削除時の動作一覧 削除対象 影響先 各画面の変更内容 1 サービスサイト 全体管理画面 2.1.1.1. クライアント企業向け管理画面 2 企業 企業 企業情報が掲載されている各ページ（求人ページなど）の動作に従う 企業の一覧・編集画面は表示しない。また編集・新規紐付けなどの変更操作は不可とする 詳細画面にURLで直接アクセスした場合は表示する クライアント企業管理者はログインできなくなる クライアント企業管理者には通知が送られなくなる 3 クライアント企業管理者 ー クライアント企業管理者の一覧・編集画面は表示しない。また編集・新規紐付けなどの変更操作は不可とする 詳細画面にURLで直接アクセスした場合は表示する 4 教室グループ 残したままとする 残したままとする 特に動作仕様は変更しない（表示・編集変更などの操作は可能） 5 教室 教室名が表示されている、求人ページおよび口コミページが非表示になることに伴い、非表示にする。 教室の一覧・編集画面は表示しない。 また編集・新規紐付けなどの変更操作は不可とする 詳細画面 にURLで直接アクセスした場合は表示する 6 求人 その企業に紐づいていた 求人詳細 ページは、Noindexとし非表示にする。 求人の一覧・編集画面は表示しない。 また編集・新規紐付けなどの変更操作は不可とする 7 口コミ その企業に紐づいていた求人ページ内の口コミ一覧・詳細ページは、Noindexとし非表示にする。 口コミの一覧・編集画面は表示しない。 また編集・新規紐付けなどの変更操作は不可とする 詳細画面にURLで直接アクセスした場合は表示する 8 教室グループ 企業 残したままとする 残したままとする 特に動作仕様は変更しない（表示・編集変更などの操作は可能） 残したままとする 特に動作仕様は変更しない（表示・編集変更などの操作は可能） 9 教室グループ 非表示にする。 教室グループの一覧・編集画面は表示しない。また編集・新規紐付けなどの変更操作は不可とする 詳細画面にURLで直接アクセスした場合は表示する 編集・新規紐付けなどの変更操作は不可とする。 10 教室 影響なし（紐づく教室がある教室グループは削除できないものとする。） 影響なし（紐づく教室がある教室グループは削除できないものとする。） 影響なし（紐づく教室がある教室グループは削除できないものとする。） 11 求人 12 契約 ー 有効な契約 影響なし（紐づく有効な契約がある教室グループは削除できないものとする。） 無効な契約 残したままとする 特に動作仕様は変更しない 有効な契約 影響なし（紐づく有効な契約がある教室グループは削除できないものとする。） 無効な契約 残したままとする 特に動作仕様は変更しない 13 教室 求人 14 求人 求人 非表示にする。 一覧・編集画面は表示しない。また編集・新規紐付けなどの変更操作は不可とする 編集画面 にURLで直接アクセスした場合は、入力フォームをすべてDisabledにして表示する 一覧・編集画面は表示しない。また編集などの変更操作は不可とする。 詳細画面にURLで直接アクセスした場合は表示する 15 教室 残したままとする 残したままとする 特に動作仕様は変更しない 残したままとする 特に動作仕様は変更しない 16 応募 影響なし（採用判断が決まっていない応募がある求人は削除できないものとする。） 影響なし（採用判断が決まっていない応募がある求人は削除できないものとする。） 影響なし（採用判断が決まっていない応募がある求人は削除できないものとする。） 17 全体管理者 全体管理者 ー 全体管理者一覧・編集画面は表示しない。また編集・新規紐付けなどの変更操作は不可とする。 対象の全体管理者の個人情報を削除または匿名化する。 対象の全体管理者はログインできなくなる。 対象の全体管理者には通知が送られなくなる。 ー 18 その他 残したままとする 残したままとする 残したままとする 19 企業管理者 その他 ー ー クライアント企業管理者はログインできなくなる クライアント企業管理者には通知が送られなくなる 20 請求書 請求書 ー 請求の一覧画面には表示しない。 詳細画面にURLで直接アクセスした場合も表示できない。 ー 21 請求書明細 請求書PDF ー 請求明細や請求書PDFの、請求書との編集・新規紐付けなどの変更操作は不可とする。 請求書の詳細画面にURLで直接アクセスした場合も表示できない。 ー 22 採用者一覧 ー 採用者の編集・新規紐付けなどの変更操作は不可とする。 請求書配下の採用者一覧画面にURLで直接アクセスした場合も表示できない。 ー 23 請求書明細 請求書 ー 請求明細の集計によって決まる各項目を再計算し更新する。 「承認日時」「発行通知日時」「PDFファイルダウンロード日時」をNullに設定する。 ー 24 請求書PDF 請求書PDF ー PDFファイルをダウンロードできない 請求一覧画面で、削除済みと表示される。 PDFファイルをダウンロードできない。 25 請求先・振込先マスタ 請求先・振込先マスタ ー 請求書の編集画面にURLで直接アクセスした場合は 表示できる。 編集画面にURLで直接アクセスした場合は、入力フォームをすべてDisabledにして表示する ー 26 そのほか ー 企業や請求との編集・新規紐付けなどの変更操作は不可とする。",
  "parentId": "666927437",
  "parentTitle": "共通要件",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/772014210",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-02-01T07:43:47.894Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 概要 帳票のレコードを削除した際の動作方針を定義する。 ここに記載しきれない、詳細な動作は各要件定義にて定める。 2. 削除時の動作一覧 削除対象 影響先 各画面の変更内容 1 サービスサイト 全体管理画面 2.1.1.1. クライアント企業向け管理画面 2 企業 企業 企業情報が掲載されている各ページ（求人ページなど）の動作に従う 企業の一覧・編集画面は表示しない。また編集・新規紐付けなど..."
}