{
  "id": "799866881",
  "title": "2023-07-12 ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様（途中から参加） GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 各議題についてメモを追加します。 商品の有効期間 基本、オプションは必ず「あり」、課金形態は「なし」（親の基本契約とイコールになる）という考えで良いか。 &rarr;認識OK 契約の期間について、下記のいずれとするか。 月の途中でも締結日からカウントする（例：7/12に契約した場合、7/12〜8/12） カレンダー上の月単位での契約とするか。（例：7/12に契約した場合、7/12〜7/31） 月単位とする場合、日割計算を行うか。 &rarr;月単位（前者） 教室グループ管理の一覧検索項目 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/【共有】トモノカイ様_塾?type=design&amp;node-id=1933%3A33219&amp;mode=design&amp;t=56UBa9cGVpHkgZjI-1 IDでの検索は頻度は高くないが、検索項目として一応残しておきたい ★トモノカイ様内部で確認後回答なさる 管理用メモは昔の名残ではあるが、検索項目としてはほとんど運用していない。工数の削減につながるなら除いて良い。一覧からも除外で良い 追加したい検索項目は特段ない クライアント企業管理者の請求担当について 現状の運用 まずクライアント企業担当者のマスターアカウントを1つ発行する このマスターアカウントが全ての担当が「はい」になっている そのあとはマスターアカウントが実態に応じて担当を変更する 請求担当がいない、という状態を発生させないシステムになっている 各企業につき1人は管理者フラグがOFFの請求担当を登録するとのことですが、現在はシステムでどのように制御されていますか？ 特に新規に企業を登録し、新規にクライアント企業管理者を登録する場合どのように1人以上の請求担当を登録していますか？ リニューアル後、どのように請求担当を確実に登録させるべきでしょうか？ 請求担当がいない状態を発生させないようなシステムを組む予定のため、次のような対応が必要かと思います 最初に招待メールを受け取った人が自動的に請求担当となり、のちに本当の請求担当にその役割を移す リニューアル後もマスターアカウントも招待 ★1人目＝マスターアカウントは全ての担当をチェック入れた状態で作成する（現状の運用と同じ） 最初に作るアカウントは1つだけなので、請求担当が存在しない時間が発生することはない 成果報酬の課金形態の、料金発生のタイミングを固定ではなく選択式にできないかの相談 背景 リニューアルに合わせて値上げを検討している。その反応を和らげるために課金形態のバリエーションを増やしたい 1ヶ月という現状の時間軸より短い／長い時間軸の要望もあるので システムに関わる部分なので共有しておく 現時点の想定では、ステーション側のみの運用で雇用形態の連動はない ★トモノカイ様からこの変更を加えるかは来週火曜日には決定・連絡の予定 ★GIG社内で、来週まで待った場合にスケジュール的にその変更を盛り込めるか内部相談しトモノカイ様にご連絡する スケジュールに影響が出てしまうなら取りやめもやむなしという認識 逆に他を削ってこれを入れるという考えもあるが&rarr;まずこれを追加可能かを考える 今回パスして後付けできるか&rarr;トモノカイ様の方に多少手間がかかるが、可能である &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235746832",
  "parentTitle": "議事録_2023年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/799866881/2023-07-12",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-07-12T07:02:31.134Z",
  "author": "ejiri_yusuke",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( )、池田様( )、片岡様（途中から参加） GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 進捗確認 各議題についてメモを追加します。 商品の有効期間 基本、オプションは必ず「あり」、課金形態は「なし」（親の基本契約とイコールになる）という考えで良いか。 &rarr;認識OK 契約の期間につ..."
}