{
  "id": "823197928",
  "title": "054_【FIX】マイページTOP",
  "content": "1. 目次 2. 概要 本機能は、会員のマイページトップとして、マイページ配下の各ページへの動線や、おすすめ求人や最近見た求人、自分が投稿したオシゴトQ&amp;Aを数件閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが利用することができる。 本機能は 【FIX】会員：プロフィール情報 【作成中】オシゴトQ＆A に記載の項目について、保存された値を表示して閲覧することができる。以下「本ページ」と記載する。 本ページには、以下を表示する 基本情報 本ページの 「要件定義」-「出力」-「基本情報」 欄で出力先として「画面」が定義されている項目 メッセージ管理ボタン 押下すると 061_【FIX】メッセージスレッド一覧閲覧機能 へ遷移する。 ユーザーに紐づく 【FIX】応募メッセージ情報 のうち、既読フラグが「未読」のものの総数をバッチとして表示する。 オファーを確認するボタン 押下すると 071_ 【FIX】オファー一覧閲覧機能 へ遷移する。 キープした求人を見るボタン 押下すると 057_【FIX】キープした求人一覧閲覧機能 へ遷移する。 応募履歴ボタン 押下すると 091_【FIX】応募履歴一覧閲覧機能 へ遷移する。 各種情報ボタン 押下すると 055_【FIX】各種設定 へ遷移する。 塾からのオファーメッセージ 【FIX】オファー履歴 の「開封日時」のデータがないもので、送信時間が新しいものを最大3つ抽出し表示する。 もし1件もない場合は 「未読のオファーを現在ございません。」 と表示する。 各オファーメッセージに表示する内容は以下とする。 本ページの 「要件定義」-「出力」ｰ 「塾からのオファーメッセージ」 欄で出力先として「画面」が定義されている項目 各メッセージ全体を該当の 072_【FIX】 オファー詳細閲覧機能 へのリンクとし、押下すると遷移する。 オファーをもっと見るボタン 押下すると 071_ 【FIX】オファー一覧閲覧機能 へ遷移する。 バナー配置情報 にてマイページに表示と定義されたバナーを6件、カルーセル形式で表示する 。カルーセルは自動で回転するように表示する。 おすすめの求人（最寄り駅） 各おすすめ求人に表示する内容は以下とする。 本ページの 「要件定義」-「出力」ｰ 「おすすめ求人（最寄り駅）」 欄で出力先として「画面」が定義されている項目 会員の最寄り駅を最寄り駅にもつ教室を最大3つランダムで選び 、各教室から更新日時が最も新しい求人（応募済みのものを除く）を1つずつ、最大計 3件表示する。 ただし 会員の最寄り駅を最寄り駅にもつ教室 が1つもない場合は「登録されている最寄駅に求人がございません」と表示する。 この条件で探すボタン（最寄り駅） 押下すると、 ユーザーの最寄り駅を駅・路線の検索条件として 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 おすすめの求人（所属大学） 各おすすめ求人に表示する内容は以下とする。 本ページの 「要件定義」-「出力」ｰ 「おすすめ求人（所属大学）」 欄で出力先として「画面」が定義されている項目 所属大学の市区町村にある教室からランダムに3つ選び 、各教室から更新日時が最も新しい求人（応募済みのものを除く）を1つずつ、計 3件表示する。 この条件で探すボタン（所属大学） 押下すると、 ユーザーの所属大学の所在地の市区町村をエリアの検索条件として 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 最近見た求人 各求人閲覧履歴に表示する内容は以下とする。 本ページの 「要件定義」-「出力」ｰ 「最近見た求人」 欄で出力先として「画面」が定義されている項目 求人閲覧履歴のうち、最新の3件を表示する。 求人閲覧履歴が0件の場合、「求人の閲覧履歴がありません。」と表示する。 一覧を表示するボタン 押下すると 051_【FIX】最近見た求人一覧閲覧機能 へ遷移する。 オシゴトQ＆A 本ページの 「要件定義」-「出力」 ｰ 「オシゴトQ＆A」 欄で出力先として「画面」が定義されている項目 自分が投稿した全てのオシゴトQ&amp;A のうち、回答があるものは回答時間を、回答がないものは質問時間を基準として、全てのオシゴトQ＆Aを基準時間の降順で並び替え、最初の3つを表示する。 オシゴトQ＆Aが0件の場合は「オシゴトQ＆Aが登録されていません。」と表示する。 一覧を見るボタン 押下すると 059_【FIX】投稿済みオシゴトQ&amp;A一覧閲覧機能 へ 遷移する 。 3.1. 権限 サービスサイトにログインできる会員のみ 3.2. 帳票 【FIX】会員：プロフィール情報 【レビュー中】求人閲覧履歴 【作成中】オシゴトQ＆A 3.3. メールテンプレート なし 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. マイページTOP https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=41157-28817&amp;mode=design&amp;t=xCHWmADLiWEevUga-4 4.1.2. オシゴトQ＆Aとは説明ポップアップ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=41827-4499&amp;mode=design&amp;t=xCHWmADLiWEevUga-4 4.2. 入力 説明は、各帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 制限とエラーメッセージ ユーザー番号 Cookie 閲覧している会員の 【FIX】会員：アカウント情報 におけるユーザー番号 4.3. 出力 説明は、各帳票の記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 基本情報 出力項目 出力先 説明 氏名 画面 ログイン中の会員の氏名を、 姓名を連結して 適切なHTMLエスケープ処理を施して表示する。 ユーザー番号 画面 ログイン中の会員のユーザー番号を適切なHTMLエスケープ処理を施して表示する。 未読メッセージ数 画面 ユーザーに紐づく 【FIX】応募メッセージ情報 のうち、既読フラグが「未読」のものの総数を表示する。 4.3.2. 塾からのオファーメッセージ 出力項目 出力先 説明 マッチ・スカウト 画面 【FIX】オファー履歴 の「オファー種別」が「パーソナルオファー」ならば「スカウト」をオレンジ色で、「自動オファー」ならば「マッチ」を〇〇色で表示する。 教室名 画面 データベースから取得したメッセージ情報1レコードの「応募番号」に紐づく教室名を適切にHTMLエスケープして表示する。 件名 画面 データベースから取得したメッセージ情報1レコードの「件名」を適切にHTMLエスケープして表示する。 未読 画面 未読のものだけ抽出しているので、全てのレコードで「未読」と表示する。 送信日時 画面 データベースから取得したメッセージ情報1レコードの「 送信時間 」をYYYY/MM/DD形式で表示する。 4.3.3. おすすめの求人（最寄り駅） 出力項目 出力先 説明 最寄り駅 画面 ユーザーが登録している最寄り駅を適切なHTMLエスケープ処理を施して表示する。 求人情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した求人情報レコードの配列をページ上に表示する。各レコードの表示データは以下「求人情報：」プレフィックスで始まる出力項目として説明する。 検索項目で絞り込んだ求人情報配列を 最大3件 表示する。 求人情報：スライド画像 画面 データベースから取得した 【FIX】教室：ロゴ・スライド画像 の 「 スライド画像 」 を表示する。 求人情報：求人タイトル 画面 データベースから取得した求人情報1レコードの「求人タイトル」を取得し、適切にHTMLエスケープしてテキストリンクとして表示する。押下すると 012_【FIX】求人詳細閲覧機能 に遷移する。 求人情報：教室名 画面 データベースから取得した求人情報1レコードの「教室名」を取得し、適切にHTMLエスケープして表示表示する。 求人情報：給与 画面 データベースから取得した求人情報1レコードの「給与形態」「給与形態：授業、コマ」「給与：最高時給」「給与：最低時給」を適切にHTMLエスケープして、「[給与形態][給与形態：授業、コマ][給与：最低時給]円〜[給与：最高時給]円」形式で表示する。 求人情報：勤務地 画面 データベースから取得した求人情報1レコードの「都道府県」「市区町村」「最寄り駅名：最寄り駅1：駅名」「最寄り駅名：最寄り駅1：移動手段」「最寄り駅名：最寄り駅1：所要時間」を適切にHTMLエスケープして、「[都道府県][市区町村]（[最寄り駅名：最寄り駅1：駅名]より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]）形式で表示する。 求人情報：指導形態 画面 データベースから取得した求人情報1レコードの「指導形態」を取得し、指導形態選択肢のラベルで表示する。 複数登録されていた際は句読点で連結して全て表示する。 求人情報：雇用形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を取得し、雇用形態の選択肢のラベル名を表示する。 求人情報：勤務条件 画面 データベースから取得した教室情報1レコードの「勤務条件」「勤務可能最低日数」を取得し、「[勤務条件]／「勤務可能最低日数」）形式で表示する。 「勤務条件」が複数登録されていた際は 句読点 で連結して全て表示する。 求人情報：勤務時間 画面 データベースから取得した教室情報1レコードの「勤務時間：平日（開始時間）」「勤務時間：平日（終了時間）」「勤務時間：土曜（開始時間）」「勤務時間：土曜（終了時間）」「勤務時間：日曜（開始時間）」「勤務時間：日曜（終了時間）」を取得し、「[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）]、[勤務時間：土曜（開始時間）]〜[勤務時間：土曜（終了時間）]、[勤務時間：日曜（開始時間）]〜[勤務時間：日曜（終了時間）]」形式で表示する。 登録されていない勤務時間は表示しない。 求人情報：求人キープボタン 画面 押下すると 013_【FIX】求人キープ機能 を利用してキープ一覧に保存される。 キープ登録状況に応じて表示を切り替える。 求人情報：求人詳細へ進むボタン 画面 押下すると 014_【FIX】求人応募機能 へ遷移する。 4.3.4. おすすめの求人（所属大学） 出力項目 出力先 説明 所属大学 画面 ユーザーが登録している所属大学を適切なHTMLエスケープ処理を施して表示する。 求人情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した求人情報レコードの配列をページ上に表示する。各レコードの表示データは以下「求人情報：」プレフィックスで始まる出力項目として説明する。 検索項目で絞り込んだ求人情報配列を最大10件表示する。 求人情報：スライド画像 画面 データベースから取得した 【FIX】教室：ロゴ・スライド画像 の 「 スライド画像 」 を表示する。 求人情報：求人タイトル 画面 データベースから取得した求人情報1レコードの「求人タイトル」を取得し、適切にHTMLエスケープしてテキストリンクとして表示する。押下すると 012_【FIX】求人詳細閲覧機能 に遷移する。 求人情報：教室名 画面 データベースから取得した求人情報1レコードの「教室名」を取得し、適切にHTMLエスケープして表示表示する。 求人情報：給与 画面 データベースから取得した求人情報1レコードの「給与形態」「給与形態：授業、コマ」「給与：最高時給」「給与：最低時給」を適切にHTMLエスケープして、「[給与形態][給与形態：授業、コマ][給与：最低時給]円〜[給与：最高時給]円」形式で表示する。 求人情報：勤務地 画面 データベースから取得した求人情報1レコードの「都道府県」「市区町村」「最寄り駅名：最寄り駅1：駅名」「最寄り駅名：最寄り駅1：移動手段」「最寄り駅名：最寄り駅1：所要時間」を適切にHTMLエスケープして、「[都道府県][市区町村]（[最寄り駅名：最寄り駅1：駅名]より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]）形式で表示する。 求人情報：指導形態 画面 データベースから取得した求人情報1レコードの「指導形態」を取得し、指導形態選択肢のラベルで表示する。 複数登録されていた際は句読点で連結して全て表示する。 求人情報：雇用形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を取得し、雇用形態の選択肢のラベル名を表示する。 求人情報：勤務条件 画面 データベースから取得した教室情報1レコードの「勤務条件」「勤務可能最低日数」を取得し、「[勤務条件]／「勤務可能最低日数」）形式で表示する。 「勤務条件」が複数登録されていた際は 句読点 で連結して全て表示する。 求人情報：勤務時間 画面 データベースから取得した教室情報1レコードの「勤務時間：平日（開始時間）」「勤務時間：平日（終了時間）」「勤務時間：土曜（開始時間）」「勤務時間：土曜（終了時間）」「勤務時間：日曜（開始時間）」「勤務時間：日曜（終了時間）」を取得し、「[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）]、[勤務時間：土曜（開始時間）]〜[勤務時間：土曜（終了時間）]、[勤務時間：日曜（開始時間）]〜[勤務時間：日曜（終了時間）]」形式で表示する。 登録されていない勤務時間は表示しない。 求人情報：求人キープボタン 画面 押下すると 013_【FIX】求人キープ機能 を利用してキープ一覧に保存される。 キープ登録状況に応じて表示を切り替える。 求人情報：応募画面へ進むボタン 画面 押下すると 014_【FIX】求人応募機能 へ遷移する。 4.3.5. 最近見た求人 出力項目 出力先 説明 総件数 画面 ログイン中の会員に紐づく求人閲覧履歴の総件数を表示する。 求人情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した求人情報レコードの配列をページ上に表示する。各レコードの表示データは以下「求人情報：」プレフィックスで始まる出力項目として説明する。 検索項目で絞り込んだ求人情報配列を最大10件表示する。 求人情報：スライド画像 画面 データベースから取得した 【FIX】教室：ロゴ・スライド画像 の 「 スライド画像 」 を表示する。 求人情報：求人タイトル 画面 データベースから取得した求人情報1レコードの「求人タイトル」を取得し、適切にHTMLエスケープしてテキストリンクとして表示する。押下すると 012_【FIX】求人詳細閲覧機能 に遷移する。 求人情報：教室名 画面 データベースから取得した求人情報1レコードの「教室名」を取得し、適切にHTMLエスケープして表示表示する。 求人情報：給与 画面 データベースから取得した求人情報1レコードの「給与形態」「給与形態：授業、コマ」「給与：最高時給」「給与：最低時給」を適切にHTMLエスケープして、「[給与形態][給与形態：授業、コマ][給与：最低時給]円〜[給与：最高時給]円」形式で表示する。 求人情報：勤務地 画面 データベースから取得した求人情報1レコードの「都道府県」「市区町村」「最寄り駅名：最寄り駅1：駅名」「最寄り駅名：最寄り駅1：移動手段」「最寄り駅名：最寄り駅1：所要時間」を適切にHTMLエスケープして、「[都道府県][市区町村]（[最寄り駅名：最寄り駅1：駅名]より[最寄り駅名：最寄り駅1：移動手段][最寄り駅名：最寄り駅1：所要時間]）形式で表示する。 求人情報：指導形態 画面 データベースから取得した求人情報1レコードの「指導形態」を取得し、指導形態選択肢のラベルで表示する。 複数登録されていた際は句読点で連結して全て表示する。 求人情報：雇用形態 画面 データベースから取得した求人情報1レコードの「雇用形態」を取得し、雇用形態の選択肢のラベル名を表示する。 求人情報：勤務条件 画面 データベースから取得した教室情報1レコードの「勤務条件」「勤務可能最低日数」を取得し、「[勤務条件]／「勤務可能最低日数」）形式で表示する。 「勤務条件」が複数登録されていた際は 句読点 で連結して全て表示する。 求人情報：勤務時間 画面 データベースから取得した教室情報1レコードの「勤務時間：平日（開始時間）」「勤務時間：平日（終了時間）」「勤務時間：土曜（開始時間）」「勤務時間：土曜（終了時間）」「勤務時間：日曜（開始時間）」「勤務時間：日曜（終了時間）」を取得し、「[勤務時間：平日（開始時間）]〜[勤務時間：平日（終了時間）]、[勤務時間：土曜（開始時間）]〜[勤務時間：土曜（終了時間）]、[勤務時間：日曜（開始時間）]〜[勤務時間：日曜（終了時間）]」形式で表示する。 登録されていない勤務時間は表示しない。 求人情報：求人キープボタン 画面 押下すると 013_【FIX】求人キープ機能 を利用してキープ一覧に保存される。 キープ登録状況に応じて表示を切り替える。 求人情報：応募画面へ進むボタン 画面 押下すると 014_【FIX】求人応募機能 へ遷移する。 4.3.6. オシゴトQ＆A 出力項目 出力先 説明 総件数 画面 ログイン中の会員に紐づくオシゴトQ＆Aの総件数を表示する。 オシゴトQ＆A情報配列 画面 データベースから抽出したオシゴトQ＆A情報レコードの配列をページ上に表示する。各レコードの表示データは以下「オシゴトQ＆A情報：」プレフィックスで始まる出力項目として説明する。 オシゴトQ＆A情報：教室名 画面 Q＆Aに紐づく教室名を適切なHTMLエスケープ処理を施して表示する。 オシゴトQ＆A情報：求人タイトル 画面 Q＆Aに紐づく求人の求人タイトルを適切なHTMLエスケープ処理を施して表示する。 オシゴトQ＆A情報：質問 画面 質問内容を適切なHTMLエスケープ処理を施して表示する。 オシゴトQ＆A情報：質問の日時 画面 質問日時をYYYY/MM/DD形式で表示する。 オシゴトQ＆A情報：回答 画面 回答内容を適切なHTMLエスケープ処理を施して表示する。 オシゴトQ＆A情報：回答の日時 画面 質問日時をYYYY/MM/DD形式で表示する。 オシゴトQ＆A情報：回答者種別 画面 Q＆Aの回答者種別で保存された値に対応するラベル名を表示する。ただし保存された値が「表示しない」の場合は表示しない。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合はログイン画面にリダイレクトする。 データベースから条件に合致した、最近見た求人のレコード（なおここでのレコードとは、 【レビュー中】求人閲覧履歴 のJSONに含まれる「求人番号」と「閲覧日時」の1セットを指しています）、オシゴトQ＆Aの総件数を取得する。 それぞれ、レコードの総件数が100を超えていた場合は以降は総件数を100件として処理を続行する。 それぞれ、レコードの総件数が0件だった場合、データの抽出を実行しないで「求人の閲覧履歴がありません」「オシゴトQ＆Aが登録されていません。」と表示する。 それぞれ、レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべきおすすめ求人情報、最近見た求人閲覧履歴情報、オシゴトQ＆A情報を、それぞれ3件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 本ページを表示した場合に下記フォーマットでログを出力する User {ユーザー番号} read mypage top. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "704577558",
  "parentTitle": "050_■マイページ各種管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/823197928/054_+FIX+TOP",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-05-07T02:11:16.025Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は、会員のマイページトップとして、マイページ配下の各ページへの動線や、おすすめ求人や最近見た求人、自分が投稿したオシゴトQ&amp;Aを数件閲覧するための機能です。 3. 要求事項 サービスサイトにログインできる会員のみが利用することができる。 本機能は 【FIX】会員：プロフィール情報 【作成中】オシゴトQ＆A に記載の項目について、保存された値を表示して閲覧するこ..."
}