{
  "id": "894173186",
  "title": "2023-12-04 確認会ミーティング議事録",
  "content": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( ) GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 クライアント宛の請求書PDFリマインド通知バッチの、目的および現在の処理内容の確認 目的：紙からPDFに変更したのに伴って、PDF発行に気づかない状態を防ぐために、PDF発行の通知を行うもの。 現在の処理内容：PDFを発行してから1週間後に、ダウンロードステータスが「未ダウンロード」の場合に限り、1回通知をする。メールの文面のみによる通知で、PDFファイルの添付などはしていない。発行した旨の通知バッチとは別のもの。 ★メールの文面は追っていただく。 全体管理画面において、請求管理採用者の運用（新規作成・編集・削除）を請求明細で置き換えるご提案 用途の認識は概ねOK。 編集機能の利用シーン 成果報酬が発生するタイミングは、採用後1ヶ月在籍した人なので（例えば1ヶ月経たずに辞めた場合など）急な変更が必要な場面に備えて新規作成・編集・削除機能が存在する。 CSVアップロード後に、変更が発生した場合。 GIG：新規作成・編集・削除は必要か。 請求の修正が発生する。違う教室に採用される場合や（＝変更）、在籍確認後に採用ではなくなった（辞めてしまった）場合（＝削除）。採用情報と、請求情報の２重管理をしている状態。 採用確認一覧でステータスを変更して請求書へ反映される のであれば、OK。また、 採用された教室を変更して請求書へ反映されれば 、OK。 ブランド毎にアカウントを持っている場合、イレギュラー対応として、 応募者を別の企業の求人へ変更できる様にする 必要あり。 また、 「採用」ステータスになってからも全体管理者が変更できる 必要あり。または、アラートを挟むなどでも良い。 一覧の利用シーン 企業様が採用者が誰かを確認できるようにするため。必要。 GIG：採用者一覧を、明細一覧に統合するのはありか？ 現状、100件以上の採用があるクライアントもいるので、現実的でない。 クライアント企業管理画面では、PDFファイルをダウンロードして初めて採用者一覧を見れるようなっている。要望としては、採用者一覧PDFをブラウザ上でも開ける様にしたいとの声もある。 請求書のPDFに採用者一覧はセットに載せることを要望されている。 Amazonギフト券CSVアップロード 機能の目的と現在の処理内容 目的：塾講師ステーションの部署ではなく他の部署が利用している。大量（100件、200件など）に発行する場合（アンケート謝礼など）のために、リストをアップロードし処理するための機能。 Amazonギフト券は会員ではない人にも送る場合もある。Amazonギフト券の配布機能は、会員に送る前提では作成しない。 法人向けAmazonギフト券の発行契約はしている（はず）。 CSVアップロード機能は手動での運用もできなくはないので、自動でできるようにリリース当初からあった方が良いものの、マストではない。 記事管理機能のリリース時点での要否 パターン A：現行の情報局を残してリンクする&rarr;ナシ B：新しい情報局をつくるが、管理側で新規作成、編集はできない C：情報局は一時的になくなる&rarr;コレ 以前の記事と新しい記事との関係は未確定だが、古い記事を残し続ける方針はない ★リニューアル後に古い記事にアクセスした場合の挙動（リダイレクト含め）を決めていただくために、チケットを起票する もしリリース時に情報局の公開が間に合わない場合は、情報局のリンクを画面に表示しない 応募の制限について 応募資格で応募者のバリデーションなどするか 現時点ではバリデーションはない、リニューアル後の要望としてはバリデーションをかけたい バリデーション対象は以下 応募資格の一部（次は除く：OK系、経験者限定、プロ講師募集、要教育免許） 勤務可能期間&rarr;求人帳票にはあるが、応募の帳票にない 週に何日勤務可能か&rarr;求人帳票にはあるが、応募の帳票にない、こちらはバリデーションの要否は相談可能 &nbsp;アクション事項 15 incomplete &nbsp;決定事項 「/decision」と入力してこのミーティングで決定した内容を記録します。: b9455583-fc11-4f6e-a694-f0f5e364eda8 7113baef-b9fe-4a11-a28f-9518f6a1b72a DECIDED",
  "parentId": "1235746832",
  "parentTitle": "議事録_2023年",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/894173186/2023-12-04",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2023-12-04T06:58:26.532Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "&nbsp;日付 &nbsp;参加者 トモノカイ：鈴木様( ) GIG： 資料 スケジュール タスク管理（Jira） &nbsp;議題 項目 プレゼンター メモ 確認内容 クライアント宛の請求書PDFリマインド通知バッチの、目的および現在の処理内容の確認 目的：紙からPDFに変更したのに伴って、PDF発行に気づかない状態を防ぐために、PDF発行の通知を行うもの。 現在の処理内容：PDFを発行してか..."
}