{
  "id": "910983172",
  "title": "472_【FIX】請求先マスタ一覧閲覧機能",
  "content": "1. 目次 1 6 false list false 2. 概要 本機能は 【作成中】企業：請求先・振込先マスタ の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者のみが、1つの 【FIX】企業：基本情報 に紐づく 【作成中】企業：請求先・振込先マスタ を一覧で閲覧することができる。 一覧ページ上部には、 表示可能な レコードの総数 、新規作成ボタンを表示する。 1ページあたりの表示数は最大5件である。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 レコード一覧の上に次のボタンを表示する 新規登録ボタン 押下すると 471_【FIX】請求先マスタ新規作成 に遷移する。 企業詳細へ戻るボタン 押下すると 125_【FIX】企業詳細閲覧機能 に遷移する。 一覧の各レコードには次の項目を表示する 本ページの「 要件定義」-「出力」 欄で出力先として「画面」が定義されている項目の内、各レコード情報として定義されている項目 編集ボタン 押下すると 473_【FIX】請求先マスタ編集機能 へと遷移する。 削除ボタン 押下すると 474_【FIX】請求先マスタ削除機能 へと遷移する。 3.1. 権限 要求の記載に従う。 3.2. 帳票 470_請求先マスタ管理機能 の記載と同じ 3.3. メールテンプレート なし 3.4. ワークフロー なし 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=90649-52922&amp;mode=design&amp;t=RtX5Kz78tSMbtcmp-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 項目名 変数名 入力元 説明 バリデーション 企業番号 URLパラメータ 一覧の担当者を絞り込み表示するために指定する企業番号。自然数の数字で指定する。 自然数以外が入力された場合は404ページを表示する 存在しない企業番号が指定された場合は404ページを表示する。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 4.3.1. 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 請求先・振込先 マスタ番号 画面 【作成中】企業：請求先・振込先マスタ の「請求先・振込先マスタ番号」を適切にHTMLエスケープして表示する。 FM請求集計ID 画面 【作成中】企業：請求先・振込先マスタ の「FM請求集計ID」を適切にHTMLエスケープして表示する。 名称 画面 【作成中】企業：請求先・振込先マスタ の「名称」を適切にHTMLエスケープして表示する。 請求先：担当部署 画面 【作成中】企業：請求先・振込先マスタ の「請求先：担当部署」を適切にHTMLエスケープして表示する。 振込先：支店名 画面 【作成中】企業：請求先・振込先マスタ の「振込先：支店名」を適切にHTMLエスケープして表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「請求先・振込先マスタ番号」「企業番号」「企業名」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が 5件 を超えていた場合、以降は総件数を5件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の請求先マスタデータ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき請求先マスタ情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read company billing account list. page={ページ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 一覧表示された各レコードの並べ替え機能は提供しない",
  "parentId": "910459114",
  "parentTitle": "470_請求先マスタ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/910983172/472_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-01T08:56:55.363Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 1 6 false list false 2. 概要 本機能は 【作成中】企業：請求先・振込先マスタ の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 全体管理画面にログインすることができるシステム管理者、塾講師ステーション管理者のみが、1つの 【FIX】企業：基本情報 に紐づく 【作成中】企業：請求先・振込先マスタ を一覧で閲覧することができる。 一覧ページ上部には..."
}