{
  "id": "938377236",
  "title": "011_【作成中】求人一覧閲覧・検索機能",
  "content": "1. 目次 2. 概要 本機能は帳票に記載の登録済みのデータを、教室が公開で求人が掲載の求人を一覧で閲覧/検索するための機能です。 3. 要求事項 エンドユーザーと会員は、エントリー済みを含む 【FIX】求人：基本情報 に登録された求人のうち、教室が公開で求人が掲載の求人を一覧で閲覧することができる。 表示条件の詳細については 015_【作成中】教室および求人の公開/掲載の条件 を参照。 ステーションサイトではステーション対象の求人のみ、キャリアサイトではキャリア対象の求人のみを表示する。 ステーションサイトではプライマリーカラーをオレンジ、キャリアサイトではプライマリカラーをブルーとする。 なお本ドキュメントでは、急募とは 【FIX】急募オプション申込付帯情報 にてその求人に紐づく有効な契約が存在することを指す。 新着とは 共通要件 を満たす求人を指す。 URLのパスについては以下の条件で以下の設定とする。xxxの部分にはIDなどユニークな値が入る。 都道府県：/area/kanagawa 都道府県名はローマ字表記とする。 市区町村：/area/kanagawa/city/XXXX IDによる番号表記とする。（横浜市など） 駅名：/area/kanagawa/station/XXXX xxxは 駅グループコード 駅コード をID表示する。 指定した駅と同じ駅グループコード、かつ、同じ駅名が最寄駅である教室に紐づく求人を表示する。 指定した駅と同じ駅グループコード、かつ、同じ駅名を持つ駅マスタの中で、最も小さい駅コードのURLを正規URLとしてcanonical設定する。 SEO上の評価集約のため、都道府県の配下に置く。 路線：/line/XXXX 路線コードのID表記 特徴：/feature/em_XXXX XXXにはマスターでの登録番号が入る。 雇用形態などの場合は、「em（employmentの略）」を冒頭に入れることで、どの特徴分かりやすくする。対応表は次のとおり https://docs.google.com/spreadsheets/d/1K0_vwwudpg67b2fkBDrlz21XZ8cFsLLB62K2ZWz0quc/edit#gid=1156134039 。 以下を除いた/featureディレクトリのnoindexを解除する(ST/CA両方) ST：noindexのままにするページ） https://www.juku.st/ca/feature/em_5 CA：noindexのままにするページ） https://www.juku.st/feature/em_1 対象サイト ステーション、キャリアについてそれぞれ https://www.juku.st/ st/ 、 https://www.juku.st/ca/ で始まるURLとする。 塾ブランド 塾ブランド一覧から該当ブランドでの求人一覧に遷移した際は下記に遷移する brand/ ブランドID ブランド絞り込みは、フリーワードに該当ブランドを絞り込みした状態で表示。 1の求人一覧画面から次に検索する際は、 /search/keyword={ブランド名}とする。 ブランドを変更した場合は、フリーワード検索のブランド名を消して、再検索することでブランドをリセットできるようにする。 この画面から地域検索をすると、その地域のその塾ブランドで絞り込まれるようにする 会社 1つの会社に紐づく全求人を表示する。 特集記事などからのみ遷移する。 /company/xxxとする。 この画面から地域検索をすると、その地域のその企業で絞り込まれるようにする 複数の条件で検索した場合のURLの構造は以下とする。 $検索パラメーター名$＝$選択した選択肢のIDをアンダースコアーで連結$を繋げる 検索パラメーターの表示順は固定とする 例：/(ca/)search??prefecture=1_2&amp;city=1_5&amp;employment=1_2&amp;new=1&amp;urgent=1 3.1. 検索コンポーネント（共通内容） 次の条件で検索結果をキャッシュする。 キャッシュのリフレッシュ期間は1日とする。 検索モーダルの各項目単位で検索ヒット数をキャッシュする。 各フィルター項目が選択、変更されたタイミングで、キャッシュから該当件数を取得し検索ボタンのテキストに表示し、検索件数が0件の場合は検索ボタンを非活性にする。また「選択をクリア」を押下すると全ての検索条件をクリアする。 フリーワード検索では以下の項目に対してテキストの部分一致検索を行う。 なお表記揺れに対する 対応表は・・・ とする。ユーザーが入力したテキストが対応表に含まれる場合、正式な表記のテキストを コンボボックスで サジェスト表示する 。 企業名 教室グループ名 教室グループ名カナ 教室名 教室名カナ 住所 最寄駅 指導形態 パンくずリスト ステーションにおける、求人一覧で表示されるパンくずリストは以下のロジックで示す。 └求人検索 - 都道府県：塾講師バイトTOP &gt; ＄都道府県名＄ の塾講師バイト求人 └求人検索 - 市区町村：塾講師バイトTOP &gt; ＄都道府県名＄の塾講師バイト求人 &gt; ＄市区町村名＄の塾講師バイト求人 └求人検索 - 市区町村（政令指定都市）：塾講師バイトTOP＞＄都道府県名＄の塾講師バイト求人＞＄政令指定都市名＄の塾講師バイト求人 └求人検索 - 政令指定都市の区：塾講師バイトTOP &gt; ＄都道府県名＄の塾講師バイト求人 &gt; ＄政令指定都市名＄の塾講師バイト求人 &gt; $政令指定都市名$＄政令指定都市の区＄の塾講師バイト求人 └求人検索 - 東京都の特別区：塾講師バイトTOP &gt; 東京都の塾講師バイト求人 &gt; 東京都＄東京都の特別区＄の塾講師バイト求人 └求人検索 - 路線：塾講師バイトTOP &gt; ＄都道府県名＄の塾講師バイト求人 &gt; ＄路線名＄の塾講師バイト求人 └求人検索 - 駅：塾講師バイトTOP &gt; ＄都道府県名＄の塾講師バイト求人 &gt; ＄市区町村名＄ の塾講師バイト求人 &gt; ＄駅名＄ 駅 の塾講師バイト求人 └求人検索 - 特徴：塾講師バイトTOP &gt; ＄特徴名＄の塾講師バイト求人 └求人検索 - 企業：塾講師バイトTOP &gt; ＄企業名＄の塾講師バイト求人 └求人検索 - ブランド：塾講師バイトTOP &gt; ＄ブランド名＄の塾講師バイト求人 キャリアにおける、求人一覧で表示されるパンくずリストは以下のロジックで示す。 └求人検索 - 都道府県：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; ＄都道府県名＄の塾講師正社員求人 └求人検索 - 市区町村：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt;＄都道府県名＄の塾講師正社員求人 &gt; ＄市区町村名＄の塾講師正社員求人 └求人検索 - 市区町村（政令指定都市）： 塾講師バイトTOP 塾講師ステーションTOP ＞塾講師 の 正社員求人TOP ＞＄都道府県名＄の塾講師 正社員 求人＞＄政令指定都市名＄の塾講師 正社員 求人 └求人検索 - 政令指定都市の区：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; ＄都道府県名＄の塾講師 正社員 求人 &gt; ＄政令指定都市名＄の塾講師 正社員 求人 &gt; ＄政令指定都市名＄＄政令指定都市の区＄の塾講師 正社員 求人 └求人検索 - 東京都の特別区：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; 東京都の塾講師正社員求人 &gt; 東京都＄東京都の特別区＄の塾講師正社員求人 └求人検索 - 路線：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt;＄都道府県名＄の塾講師正社員求人&gt; ＄路線名＄の塾講師正社員求人 └求人検索 - 駅：塾講師ステーションTOP &gt; 塾講師正社員求人TOP &gt;＄都道府県名＄の塾講師正社員求人 &gt; ＄市区町村名＄の塾講師正社員求人 &gt; ＄駅名＄ 駅 の塾講師正社員求人 └求人検索 - 特徴：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; ＄特徴名＄の塾講師正社員求人 └求人検索 - 企業：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; ＄企業名＄の塾講師正社員求人 └求人検索 - ブランド：塾講師ステーションTOP &gt; 塾講師 の 正社員求人TOP &gt; ＄ブランド名＄の塾講師正社員求人 3.2. PC画面 検索コンポーネント（サイドバー） ページ左部には検索フィルター用コンポーネントを表示する。ページスクロールに追従する。 最大縦幅は 600px とし、それを超える縦幅の場合はスクロール対応とする。ただし 検索ボタンとクリアボタンはコンポーネント 下に固定とし、スクロールにより動かさない。 チェックボックスで選択肢をリスト化して表示するタイプのセクションは、検索モーダルでユーザーが選んだ選択肢のみを表示し、その範囲内でチェックの付け外しができる。 それ以外の選択肢をさらに選びたい場合は、各セクションにある「追加」ボタンを押すことで対応するモーダルが開き、その中で選択可能なすべての選択肢から選ぶことができる。 それらの各セクションは、タイトルと追加ボタンを常に表示する。 検索フィルター用コンポーネントで各条件を指定し検索するボタンを押下することで、指定した条件で絞り込みを行い一覧を取得する。 検索フィルター用コンポーネントの表示項目は、下の項目とし、すべてAND検索とする。 勤務地／路線・駅 検索モーダルの勤務地／路線・駅タブで選択した選択肢をチェックボックスでリストアップして表示する。 追加ボタンを押下すると検索モーダルを開く。 雇用形態 キャリアサイトの場合のみ、検索モーダルの雇用形態タブで選択した選択肢をチェックボックスでリストアップして表示する。 職種 検索モーダルの指導形態タブで選択した選択肢をチェックボックスでリストアップして表示する。 給与 検索モーダルの時給タブで選択した選択肢を チェックボックスでリストアップして表示する 。 検索モーダルで選択した給与体系をこのセクションのタイトルとする。 例えば給与体系を「時給」で選ぶとタイトルは「時給」とする。 フリーワード検索 シフト 選択肢は以下の通り。 全て常に表示する。 週1日からOK 週2日～週3日からOK 週4日以上からOK 短期OK 平日のみOK 週末のみOK 曜日固定ナシ 夕方（16時）からの勤務歓迎 夜（18時）からの勤務歓迎 このセクションは追加ボタンを表示しない。 キャリアの場合は、「シフト」で表示している項目を「こだわり条件」に変更して表示する。表示項目に関しては https://docs.google.com/spreadsheets/d/1MXEsQWsbM-9qzesKuPieh9LMmwheVk0XRIpknfnlHEI/edit?gid=1082558947#gid=1082558947 を参照。 勤務期間 「3ヶ月以上」「6ヶ月以上」「1年以上」を選択肢とし、 【FIX】求人：勤務条件・指導科目 の「最低勤務期間」に対して絞り込む。 特徴から選択 追加ボタンを押下すると 特徴から 検索モーダル を開く。 フリーワード検索 新着／急募 ただし「勤務地」「指導形態」 「特徴から選択」 「新着/急募」の内部検索項目はすべてOR検索とする。 「 特徴から選択」の内部検索項目はAND検索とする。 例：こだわり条件内の「私服OK」「茶髪可」が選択された場合はこれらはAND条件となる。 検索ボタンを押下すると再読み込みし、押下するまで再読み込みはしない。 3.3. SP画面検索コンポーネント（ ページ上部に追従 ） こちらのデザイン の検索コンポーネントを画面上部にスティッキーとし、ページスクロールに追従する。 ただしページトップまでスクロールしているときは表示させず、スクロールダウンに伴い検索コンポーネントが見えなくなったタイミングで表示する。 左のボタンにはキープしている求人数を数字表示し、押下すると 057_【FIX】キープした求人一覧閲覧機能 へ遷移する。 表示する項目は以下とする。 エリア/駅 指導形態/給与 特徴 キーワード 右のボタンを押下すると、詳細検索コンポーネントをモーダル形式で表示する。詳細検索コンポーネントモーダルの挙動は各検索モーダルの要件定義に従う。 ただし、指導形態/給与の場合は、指導形態に遷移する。 3.4. 検索モーダル（勤務地・指導形態・給与 ・雇用形態 ） 選択された項目はモーダル下に列挙する。表示領域が足りなくなった場合は、はみ出る分を「・・・」で記載する。 検索モーダルには以下の3つのタブを表示する。 勤務地を選択 路線 ・駅から探す 地域、都道府県、 鉄道会社、 路線、駅の粒度でチェックボックスを表示し選択できる。 SP画面の場合、都道府県エリアと路線名の右横から「プラス・マイナスアイコン」までのエリアと「プラス・マイナスアイコン」をタップするとアコーディオンメニューが開閉（チェックボックスにチェックは入らない）し、チェックボックスをタップするとその項目を含む上の階層の項目にチェックが入る。最下層の駅名では、項目エリア全体とチェックボックスエリアをタップするとそのエリアのチェックボックスのチェックのON/OFFが可能（アコーディオンメニューの開閉はしない）。 エリアから探す 地域、都道府県、市区町村の粒度でチェックボックスを表示し選択できる。 検索モーダルに表示される該当都道府県の市区町村表記を下記のまとまりで表示し、市区町村以下は該当するエリアを表示する。各都道府県直下のエリア（東京都であれば「23区」「23区外」、神奈川県であれば「横浜市」「川崎市」など）は見出しとして表示する。 関東 └東京都：23区、23区外 └神奈川県：横浜市、川崎市、相模原市、その他の市区町村 └埼玉県：さいたま市、その他の市区町村 └千葉県：千葉市、その他の市区町村 関西 └大阪府：大阪市、堺市、その他の市区町村 └兵庫県：神戸市、その他の市区町村 └京都府：京都市、その他の市区町村 東海 └愛知県：名古屋市、その他の市区町村 └静岡県：静岡市、浜松市、その他の市区町村 その他のエリア（政令指定都市） └北海道：札幌市、その他の市区町村 └宮城県：仙台市、その他の市区町村 └新潟県：新潟市、その他の市区町村 └岡山県：岡山市、その他の市区町村 └広島県：広島市、その他の市区町村 └福岡県：福岡市、北九州市、その他の市区町村 └熊本県：熊本市、その他の市区町村 市区町村 エリア を1つでも選択している地域は、「選択中」というバッチを表示する。 SP画面の場合、都道府県エリアと都道府県エリアの直下の階層（23区、横浜市など）ではエリア名の右横から「プラス・マイナスアイコン」までのエリアと「プラス・マイナスアイコン」をタップするとアコーディオンメニューが開閉（チェックボックスにチェックは入らない）し、チェックボックスをタップするとそのエリアを含む上の階層のエリアにチェックが入る。最下層のエリア（千代田区、八王子市など）では、項目エリア全体とチェックボックスエリアをタップするとそのエリアのチェックボックスのチェックのON/OFFが可能（アコーディオンメニューの開閉はしない）。 SP画面の場合、各都道府県の横矢印アイコンを押下すると、その都道府県のみで絞り込んだ 011_【作成中】求人一覧閲覧・検索機能 を表示する。 都道府県を選択肢した場合、以下の挙動をする。 モーダルの下部「○○件を検索」の横に「指導形態を追加」というボタンを表示する。 それを押下すると「指導形態」タブに自動的に切り替える。ただしすでに「指導形態」が選択されている場合はクリアボタンを非表示とする。 なお、「 路線 ・駅から探す」と「エリアから探す」はいずれか一方だけを検索条件とし、両方を組み合わせて検索フィルターをかけることはできない。 指導形態を選択 【FIX】求人：基本情報 の「指導形態」を選択肢とする。 指導形態のいずれかを選択した場合、以下の挙動をする。 モーダルの下部「○○件を検索」の横に「勤務地を追加」というボタンを表示する。 それを押下すると「勤務地」タブに自動的に切り替える。すでに「勤務地」が選択されている場合はクリアボタンを非表示とする。 給与を選択 給与体系のセレクトボックスの選択肢は 【FIX】求人：基本情報 の 給与形態と同じとする。そのため、「月給」はキャリアサイトでのみ表示する。 検索時に指定した金額より、求人の最低給が高い場合のみに表示する。 各給与体系での選択肢は以下とする。 「時給」「コマ給」「授業給」の場合 850円 ～1100円まで50円区切り、1100円～1500円まで100円区切り、 1500円～5000円まで は500円区切りで表示。5000円以上は、「5000円以上」でまとめて表示。すべて「○○円以上」という形で上限は決めない形式。 ※時給で検索時だけ、「コマ給/授業給」についても時給換算して検索対象に含める。 「日給」の場合は、2000円～10000円まで1000円区切りで表示。2000円未満は「2000円未満」と表示。10000円以上は、「10000円以上」とまとめて表示。こちらもすべて「○○円以上」という形で上限は決めない形式。 「月給」の場合 は、「15万未満」 「15万以上」「18万以上」 「20万円以上」、20万以上からは1万円区切りで、29万円まで表示。30万円以上は「30万円以上」とまとめて表示。こちらもすべて「○○円以上」という形で上限は決めない形式。 トモノカイ様作成LP用の検索モーダルURL（勤務地、指導形態、雇用形態）は、 https://docs.google.com/spreadsheets/d/1NBbn6IefE8-b3KVgVkV6r89LlZ705IAn6Oy5rsIOM44/edit?gid=1902383958#gid=1902383958&amp;range=205:208 を参照。 3.5. 検索モーダル（フリーワード・勤務期間・特徴） 選択された項目はモーダル下に列挙する。表示領域が足りなくなった場合は、はみ出る分を「・・・」で記載する。 PC画面では本モーダルは特徴を選択するモーダルとし、SP画面ではフリーワード検索・勤務期間・特徴を選択できるモーダルとする。 フリーワード検索の対象項目は以下とする。 企業名 教室グループ名 教室グループ名カナ 教室名 教室名カナ 住所 駅名検索用（教室編集_基本情報／所在地：最寄り駅1石神井公園駅、最寄り駅2、最寄り駅3） 求人タイトル 仕事内容 指導形態 勤務条件 指導学年 指導科目 服装・髪型 歓迎 トモノカイ様作成LP用の検索モーダルURL（特徴）は、 https://docs.google.com/spreadsheets/d/1NBbn6IefE8-b3KVgVkV6r89LlZ705IAn6Oy5rsIOM44/edit?gid=1902383958#gid=1902383958&amp;range=209:209 を参照。 3.6. 求人カード・教室グループカード一覧 上部 検索条件を羅列したタイトルを表示する 。 ただし4つ以上の条件を掛け合わせた場合は「様々な条件の塾講師バイト・アルバイトの求人一覧」とする。 無条件で検索した場合は、ステーションの場合は「すべての塾講師バイト・アルバイトの求人一覧」、キャリアの場合は「すべての塾講師求人一覧」と表示する。 /brandおよび/companyページにおいて、再検索時にH1タグへそれぞれ[ブランド名]または[企業名]を表示する。 検索条件に基づいた求人総数を表示する。 「塾ブランドごとにまとめて表示」機能 同一の教室グループに紐づく求人は1つの 教室グループのカード の中に表示する。 各求人情報カードには次の項目を表示する。なお 051_【FIX】最近見た求人一覧閲覧機能 の求人カードと同じ内容は記載を省略する。 その教室グループの求人のうち1つをランダムで表示する。 この塾ブランドの評判・口コミをもっと見る︎ 押下すると 034_ 【FIX】口コミブランド詳細閲覧機能 に遷移する。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合は表示しない。 キャリアの場合は表示しない 同ブランドで条件に該当する他の教室も見る 押下すると、同じ条件でそのブランドで絞り込まれた教室の 011_【作成中】求人一覧閲覧・検索機能 を表示する。 チェックボックスにチェックを入れた時に、この機能の処理が動き絞り込んだ結果が表示される。 新着／急募 「塾ブランドごとにまとめて表示」機能の右横に新着、急募の順で表示する。 新着 チェックを入れた場合、既存の検索条件に加え「新着求人」を条件として絞り込みを行い、その結果を非同期で検索し表示する。 急募 チェックを入れた場合、既存の検索条件に加え「急募求人」を条件として絞り込みを行い、その結果を非同期で検索し表示する。 表示件数切替え セレクトボックスとし選択肢は10件、20件、30件とする。デフォルトは10件とする。 新しい値が選択されると、その件数分の検索結果を表示する。 1ページあたりの表示数を選択された件数とし、表示対象のレコードがそれより多い場合は、ページネーションを一覧の下部に表示する。 3.7. 求人カード・教室グループカード一覧 一覧の求人情報カードは以下の条件で並べる。 検索条件に合致する急募求人を1件ランダムで抽出し、最も上に表示する。 検索条件に 合致したそれ以外の求人は次の条件で上から順に表示する。 その企業ー教室ブランドーサイト種別で契約しているプラン をもとに、プレミアム＞デラックス＞グレードアップ＞スタンダード＞スポットバイト＞ライトの優先順とする。 同一教室の求人が複数ある場合、同一教室内での並び順は求人の「表示順」の値を用いて下記の通りとする。 値の昇順とする。 値なしは、最下位とする。 同じ値の場合は、優劣をつけないものとする。 群の優劣に、 S&gt;A&gt;B&gt;C&gt;D&gt;E&gt;F&gt;G&gt;H＞O の順で従う。また群については以下の内容とする 企業の群評価の優劣に従う 企業の群評価が同じ求人があった場合は求人の群評価の優劣に従う それでも同じ順位の求人があった場合は 、 【FIX】教室：基本情報／所在地 の 「最新口コミ公開日」 または job_basic_informationの 更新日時 の新しい方を選び、その新しい順とする。 各求人情報カードには次の項目を表示する。なお 051_【FIX】最近見た求人一覧閲覧機能 の求人カードと同じ内容は記載を省略する。 急募かどうか、新着かどうか 急募に当てはまる場合は「急募」の表示を、急募ではないが新着であれば「 新着 」の表示をする。 教室グループの紹介テキスト 教室PR情報 3行以上になる場合は 「もっと見る」 ボタンでマスキングかけアコーディオンとする。 この塾ブランドの評判・口コミを詳しく見る 押下すると 031_【FIX】 口コミ一覧閲覧機能 に遷移する。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合は表示しない。 キャリアの場合は表示しない Google Mapsで開く 押下するとGoogle Mapsのサイトを別タブで開く。 シフト 以下の項目のみ表示する。 勤務条件 平日のみOK、週末のみOK、夕方（16時）からの勤務歓迎、夜（18時）からの勤務歓迎、曜日固定なし、副業可 最低勤務日数 週1日からOK、週2日〜週3日からOK、週4日以上からOK 特徴 表示する内容 は「勤務条件」「服装・髪型」「歓迎」「PR情報：塾の特徴」のうちその求人に登録されているもの全てとする。 ただし、「勤務条件」は以下の項目のみ表示する。 「平日のみOK」、「週末のみOK」、「夕方（ 16 時）からの勤務歓迎」、「夜（ 18 時）からの勤務歓迎」、「曜日固定なし」、「副業可」 ただし、「最低勤務日数」は以下の項目のみ表示する。 「最低勤務日数：週 1 日から OK」、「週 2 日〜週 3 日から OK」、「週 4 日以上からOK」 SP画面では待遇とタイトルをつけ、デフォルトは閉じたアコーディオンとする。閉じた状態では2つだけ特徴を表示し、アコーディオンを開くと全ての特徴を表示する。 口コミ 表示する内容は 012_【FIX】求人詳細閲覧機能 の口コミと同じとする。 もっと見る を押下すると 031_【FIX】 口コミ一覧閲覧機能 に遷移する。 口コミ本文は画面表示上2行を超える場合は「・・・」と表示し3行にならないようにする。 SP画面では最大1件、PC画面では最大2件表示する。なお登録されていない場合は表示しない。 紐づく 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている場合、本セクション自体を表示しない。 キャリアの場合は表示しない 一覧ページの各カードの間には、以下を表示する。 ステーション／キャリアトップへの導線バナー 求人カード一覧の半ばに 設置する。10件表示の場合は5件目と6件目の間、など。 3.8. 求人カード一覧の下のサブコンテンツ ［地域］の塾講師正社員求人はこちら 都道府県または市区町村で絞り込んでいる場合、 その地域名 を含む ボタン を表示する。 押下すると、その条件で絞り込んだキャリア求人の https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=938377236&amp;draftShareId=46a52493-8591-4b1d-921c-d2c1e6f4af0a が表示される。 バナー（人気の学習塾） プレミアム 380_バナー管理機能 で登録・指定したものが、 PCでは左 上 から、SPでは 上 左 から 3 2 6 つ ランダム 登録順 に表示される。 380_バナー管理機能 で指定した内容が表示される。 バナー全体をリンクとし、押下すると 380_バナー管理機能 で 指定した遷移先へ 遷移する。 デラックス 380_バナー管理機能 で登録・指定したもの 21つ がランダムに表示される。 380_バナー管理機能 で指定した内容が表示される。 バナー全体をリンクとし、押下すると 380_バナー管理機能 で指定した遷移先へ遷移する。 バナー（注目の学習塾） デラックス 380_バナー管理機能 で登録・指定したもの4つが登録順に表示される。SPではカルーセル形式でスライドできる形とし、画面に表示されるバナーは2つとする。 380_バナー管理機能 で指定した内容が表示される。 バナー全体をリンクとし、押下すると 380_バナー管理機能 で指定した遷移先へ遷移する。 地域の特徴・地域の塾講師求人の特徴 表示の出しわけ条件は 出しわけシート を参照し、 表示する内容は以下のCSVファイルや スプレッドシート を参照する 。 ステーション （使用しない旧定義： ） https://docs.google.com/spreadsheets/d/1D-ymctjSa8HGyYi3RJadLjwyUgWA5s5WFl8zIih0clQ/edit#gid=0 政令指定都市での絞り込みの場合は 、 https://docs.google.com/spreadsheets/d/1gT0QWYe7-A9x1fS5v0jPeSW0ckjKXNTw0AUloc95RwQ/edit#gid=0 を参照する。 キャリア 都道府県 https://docs.google.com/spreadsheets/d/1EJYHcsCS35wFLa8qD1FOcE6jAm8hu1M9IDmhmvQWY8c/edit?gid=1543630770#gid=1543630770 政令指定都市 https://docs.google.com/spreadsheets/d/1EJYHcsCS35wFLa8qD1FOcE6jAm8hu1M9IDmhmvQWY8c/edit?gid=1965563859#gid=1965563859 （内部リンクなし） https://docs.google.com/spreadsheets/d/1EJYHcsCS35wFLa8qD1FOcE6jAm8hu1M9IDmhmvQWY8c/edit?gid=268996919#gid=268996919 （内部リンクあり） 市区町村 https://docs.google.com/spreadsheets/d/1EJYHcsCS35wFLa8qD1FOcE6jAm8hu1M9IDmhmvQWY8c/edit?gid=1559039767#gid=1559039767 エリアに位置する大学別おすすめ塾講師バイト 求人一覧 - 「エリアに位置する大学別おすすめ塾講師バイト」内容 の定義通りに表示する。 エリア の指導形態別求人数 表示の出しわけ条件は 出しわけシート を参照。 表示する内容は以下である。 その都道府県の求人のうち、個別指導、集団指導、チューターの求人数をそれぞれ表示する。 エリアの平均給与 表示の出しわけ条件は 出しわけシート を参照。 表示する内容は以下である。 該当するエリアの平均給与を、下記の通り、雇用形態別に表示する。 アルバイト エリア平均給与 のアルバイトの平均時給 正社員 エリア平均給与 の正社員の平均月給 政令指定都市においては、該当する複数の市区町村の平均給与の平均値を下記の通り算出して表示する。 政令指定都市に該当する市区町村を、市区町村1（平均給与1、求人数1）、市区町村2（平均給与2、求人数2）、・・、市区町村n（平均給与n、求人数n）とした場合、以下の計算式で算出する。 政令指定都市の平均給与 = (平均給与1 * 求人数1 + 平均給与2 * 求人数2 + ・・ + 平均給与n * 求人数n) / (求人数1 + 求人数2 + ・・ + 求人数n) 表示する値が存在しない場合は、「このエリアには該当する求人がありません」という文言を表示する。 塾の仕事内容 表示の出しわけ条件は 出しわけシート を参照。 表示する内容は以下である。 見出し [ブランド名]の仕事内容 本文 【FIX】教室グループ に登録されている紹介文（アドミン管理画面では仕事内容）として 登録されている内容を表示する 。 テキストリンク など を含む場合 （マークダウン記法でテキストリンクを表現しているテキスト（ [アンカーテキスト](リンク先のURL) ）） は、リンクをクリックできる形態で出力する。 市区町村から探す 表示の出しわけ条件は 出しわけシート を参照。 都道府県で検索した場合はその都道府県の、市区町村で検索した場合はその市区町村を含む都道府県の、配下の市区町村について一覧で表示し、それぞれテキストリンクとし、押下するとその市区町村で絞り込んだ https://giginc.atlassian.net/wiki/pages/resumedraft.action?draftId=938377236&amp;draftShareId=46a52493-8591-4b1d-921c-d2c1e6f4af0a を表示する。 該当のエリアのリンク先に求人がない場合 は、リンクを 非活性 非表示にする。 よくある質問(FAQ) それぞれ、下記の場合に表示する。 ステーション： 都道府県 または 、 市区町村 、政令指定都市、路線、駅 の検索時に表示する。 キャリア：都道府県、市区町村、政令指定都市の検索時に表示する。 こちら（ 求人一覧 - エリアのFAQ内容 ）で定義する４つのFAQを表示する。 下のファイルの条件に従い、ファイルに定義された3つのFAQを表示する。それぞれのFAQの文頭には対象地域の地名を入れてFAQの内容を分かりやすくする。 1つ1つのFAQはアコーディオンとし、デフォルトは閉じている。 塾のよくある質問 出しわけの条件は 出しわけシート を参照する。 検索された教室グループに対して、登録されている全ての 【FIX】教室グループ：質問・回答 をQA形式で表示する。 テキストリンクを含む場合（マークダウン記法でテキストリンクを表現しているテキスト（ [アンカーテキスト](リンク先のURL) ））は、リンクをクリックできる形態で出力する。 質問項目の冒頭に「塾名」をつける。 例）{●●塾の}給与は？ 都道府県から塾講師バイトを探す 「塾講師ステーションキャリア」の場合は、見出しを「{都道府県名}の正社員塾講師求人を探す」と表示する。 出しわけの条件は 出しわけシート を参照する。 リンク先に公開されている求人が１件もない場合、リンクを非活性化して表示する。 検索している都道府県が含まれる地域の中の、都道府県と 市区町村 で絞り込むリンクを設置する。表示するリンクは以下のファイルに従う。 政令指定都市から塾講師アルバイトを探す。出しわけは https://docs.google.com/spreadsheets/d/1OCw7BzqHuY2ZmHiRlyJIialKOK5bHB0GNwosf-jMuA8/edit#gid=0 に従う。 政令指定都市を地域ごとにグルーピングして、各政令指定都市名をテキストリンクとする。 テキストリンクを押下すると、該当の市で絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に遷移する。 人気のエリア／駅／路線／ブランド 出しわけは https://docs.google.com/spreadsheets/d/1OCw7BzqHuY2ZmHiRlyJIialKOK5bHB0GNwosf-jMuA8/edit#gid=0 に従い、各項目で表示するテキストはリンクとし、押下するとその条件で絞り込まれた求人一覧画面へ遷移する。 リンク先に公開されている求人が１件もない場合、リンクを非活性化して表示する。 エリア 検索対象のエリア と同一エリアのうち、以下の条件で上位 10件 を表示する。ただし市区町村で検索した場合はその市区町村が含まれる都道府県で表示するものと同じものを表示する。 第一ソート：応募数（降順） 第二ソート：教室数（降順） 第三ソート：市区町村テーブルのID（昇順） 駅 検索対象のエリアと同一エリアにある駅のうち、以下の条件で上位5件を表示する。ただし市区町村で検索した場合はその市区町村が含まれる都道府県で表示するものと同じものを表示する。 第一ソート：応募数（降順） 第二ソート：教室数（降順） 第三ソート： 駅テーブルのID （昇順） 路線 検索対象のエリアと同一エリアにある路線のうち、以下の条件で上位5件を表示する。ただし市区町村で検索した場合はその市区町村が含まれる都道府県で表示するものと同じものを表示する。 第一ソート：応募数（降順） 第二ソート：教室数（降順） 第三ソート： 路線テーブルのID （昇順） ブランド 検索対象のエリアと同一エリアにある教室グループのうち、以下の条件で上位5件を表示する。 第一ソート：応募数（降順） 第二ソート：教室数（降順） 第三ソート：教室グループ のID （昇順） 近隣の地域/駅/路線から探す。出しわけは https://docs.google.com/spreadsheets/d/1OCw7BzqHuY2ZmHiRlyJIialKOK5bHB0GNwosf-jMuA8/edit#gid=0 に従う。 地域 該当駅の同市区町村のリンクを設置する。 最大表示数は該当駅から近い順に5個とする。 駅 同路線の駅ページのリンクを設置する。 最大表示数は該当駅から近い順に10個とする。 路線 該当駅に通っている路線ページのリンクを設置する。 会員登録バナー 閲覧しているユーザーがログインしていない場合、 会員登録を促すバナー を 表示する 。 押下すると 041_【FIX】会員新規登録機能 へ遷移する。 3.9. 権限 要求の通り。 3.10. 帳票 概要と要求の通り。 3.11. メールテンプレート なし 3.12. ワークフロー 3.12.1. 関連 【FIX】オファー・応募・選考・採用フロー 【FIX】オシゴトQ＆A登録・回答・公開・編集・非公開・評価フロー 4. 要件定義 4.1. ユーザーインターフェース （画面） 4.1.1. 求人検索/一覧画面 https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=19233-1765&amp;mode=design&amp;t=FLIegDWTEG3zK2vm-0 4.1.2. 塾ブランドでまとめる求人カード https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=109849-87140&amp;mode=design&amp;t=ViV9xfqERzD2H5Tp-4 4.1.3. 検索モーダル（エリア・指導形態・時給） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=22085-35331&amp;mode=design&amp;t=ViV9xfqERzD2H5Tp-4 4.1.4. PC検索モーダル（特徴） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=109922-87225&amp;mode=design&amp;t=ViV9xfqERzD2H5Tp-4 4.1.5. SP検索モーダル（フリーワード・勤務期間・特徴） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=110013-7630&amp;mode=design&amp;t=njDs3vt67wPFjHJL-4 4.1.6. SP検索コンポーネント https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=110047-65415&amp;mode=design&amp;t=TkVNAnGF7MJ8Alex-4 4.2. ログ User {ユーザー番号} read job list. {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント}",
  "parentId": "703561854",
  "parentTitle": "010_■求人・教室管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/938377236/011_",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-09-22T06:40:18.103Z",
  "author": "Numbered Headings",
  "excerpt": "1. 目次 2. 概要 本機能は帳票に記載の登録済みのデータを、教室が公開で求人が掲載の求人を一覧で閲覧/検索するための機能です。 3. 要求事項 エンドユーザーと会員は、エントリー済みを含む 【FIX】求人：基本情報 に登録された求人のうち、教室が公開で求人が掲載の求人を一覧で閲覧することができる。 表示条件の詳細については 015_【作成中】教室および求人の公開/掲載の条件 を参照。 ステーシ..."
}