{
  "id": "940769281",
  "title": "コピー596_【不使用】応募管理 - 一覧閲覧機能（バックアップ）",
  "content": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 作成日時の降順で表示し、並べ替えを行うことはできなくて良い。 一覧フィルター用コンポーネントの表示項目は下記の通りで、全てAND結合とし、「絞り込み」ボタンを表示するまでフィルター項目の変更は適用されないものとする。 本ページの 「要件定義」-「入力」 欄で入力元として「入力フォーム：フィルター」が定義されている項目 教室グループ名 教室名 教室番号 氏名 都道府県 教室プラン セレクトボックスを使う 雇用形態 応募年月 応募ID メールアドレス 提出ステータス 採用ステータス 在籍確認 セレクトボックスを使う 提出期限 セレクトボックスを使う 採用確認状況 ラジオボタンを使う 不一致のみ チェックボックスを使う 応募日時 デートピッカーを使う 検索ボタン 「CSVダウンロード」ボタン 検索ボタンを押下することで変更されたフィルター項目の一覧適用を実行する。検索結果が1件もなかった場合は、「該当する応募が見つかりませんでした」と表示する。 CSVダウンロードボタンを押下することで、絞り込んだ内容で 214_【作成中】応募情報CSVダウンロード機能 を実行する。検索結果が1件もなかった場合はダウンロードは実行されず「データがありません」とポップアップを表示する。ポップアップには閉じるボタンを配置し、ボタンを押下するとポップアップを閉じる。 一覧の各レコードには以下の項目を入力する。 採用スタータス セレクトボックスを使う 研修初日 デートピッカーを使う 在籍確認 セレクトボックスを使う メモ テキストボックスを使う 一覧の各レコードには以下の項目を出力する。 本ページの 「要件定義」-「出力」欄 で出力先として「画面」が定義されている項目のうち、応募情報レコードとして定義されている項目 応募番号 応募者氏名 応募先教室 雇用形態/指導形態 応募者情報 応募日 採用ステータス 研修初日 在籍確認 メモ メッセージ確認ボタン 押下すると 592_【FIX】応募管理 - 詳細 - メッセージ - 一覧閲覧機能 へ遷移する。 面接日設定ボタン 押下すると 591_【FIX】応募管理 - 詳細 - プロフィール閲覧機能 へ遷移する。 3.1. 権限 要求事項の記述に同じ。 3.2. 帳票 概要の記述に同じ。 3.3. メールテンプレート なし 3.4. ワークフロー 590_■応募管理機能 の記載と同じ 3.4.1. 本機能 3.4.2. 関連 4. 要件定義 4.1. ユーザーインターフェース（画面） https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=80153-50801&amp;mode=design&amp;t=xlwkBlhDhrI8zNP4-0 4.2. 入力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 検索フィルター・ページネーション 項目名 変数名 入力元 説明 制限とエラーメッセージ 1 ページ番号 &hellip; URLパラメータ &hellip; &hellip; 2 氏名 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、紐づく 【FIX】会員：プロフィール情報 の「氏名」を中間一致でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 3 雇用形態 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】求人：基本情報 の「雇用形態」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 4 教室名 入力フォーム：フィルター、URLパラメータ 1行テキストボックスで入力し、紐づく 【FIX】教室：基本情報／所在地 の「教室名」を中間一致でフィルタリングする。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は空欄を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 5 都道府県 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 対応する帳票のリンクを貼る の「 項目名 」に記載されている選択肢と「すべて」から選択することができる。 初期値は「すべて」とする。 任意項目。入力されていない場合は「すべて」と判定しフィルタリングはおこなわない。 6 教室プラン 入力フォーム：フィルター、URLパラメータ 単一選択のセレクトボックスで入力し、 【FIX】教室：基本情報／所在地 の「教室プラン」に記載されている選択肢と「すべて」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「すべて」を表示する。 任意項目。入力されていない場合はフィルタリングをおこなわない。 7 応募年月／年 入力フォーム：フィルター、URLパラメータ フィルター項目 単一選択のセレクトボックスで入力し、2010年から現在年までの選択肢と「-」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「-」を表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 8 応募年月／月 入力フォーム：フィルター、URLパラメータ フィルター項目 単一選択のセレクトボックスで入力し、1月から12月までの選択肢と「-」から選択することができる。 初期状態は最後に入力したものを表示する。前に入力されたものがない場合は「-」を表示する。 任意項目。入力されていない場合はフィルタリングはおこなわない。 4.3. 出力 説明は、帳票の各ページの記載を前提とし、本ページに固有の特記事項のみ記載する。 検索フィルター・ページネーション 出力項目 出力先 説明 1 件数 画面 指定されたフィルタリングを適用した結果表示可能なデータの総件数をページ上部に表示する。 2 総ページ数 画面 指定されたフィルタリングを適用した結果の件数に対して１ページあたり50件の表示で計算した総ページ数をページ上部に表示する。 3 ページ番号 画面 入力されたページ番号を入力処理にて変換した値をページ上部に表示する。 4 氏名 画面 入力された「氏名」を入力処理にて変換した値を、フィルター用コンポーネント内の「氏名」のテキストボックスに表示する。 5 雇用形態 画面 入力された「雇用形態」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「雇用形態」のセレクトボックスで初期選択状態とする。 6 教室名 画面 入力された「教室名」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「教室名」のテキストボックスで初期選択状態とする。 7 都道府県 画面 入力された「都道府県」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「都道府県」のセレクトボックスで初期選択状態とする。 8 教室プラン 画面 入力された「教室プラン」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「教室プラン」のセレクトボックスで初期選択状態とする。 9 応募年月／年 画面 入力された「応募年月／年」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「応募年月／年」のセレクトボックスで初期選択状態とする。 10 応募年月／月 画面 入力された「応募年月／月」を入力処理にて変換した値を利用し、フィルター用コンポーネント内の「応募年月／月」のセレクトボックスで初期選択状態とする。 各レコード情報 指定されたフィルタリングを適用してデータベースから抽出した商品情報レコードの配列をテーブル組みでページ上に表示する 出力項目 出力先 説明 応募情報配列 画面 指定されたフィルタリングを適用してデータベースから抽出した応募情報レコードの配列をテーブル組みでページ上に表示する。各レコードの表示データは以下「応募情報：」プレフィックスで始まる出力項目として説明する。 応募情報：採用ステータス 画面 データベースから取得した応募情報1レコードの「採用ステータス（クライアント企業）」の保存された値に対応するラベル名を表示する。 応募情報：応募者氏名 画面 データベースから取得した応募情報1レコードの「応募者氏名」を適切にHTMLエスケープして表示する。 応募情報：応募教室 画面 データベースから取得した応募情報1レコードの「教室名」を適切にHTMLエスケープして表示する。 応募情報：指導形態 画面 データベースから取得した応募情報1レコードの「指導形態」の保存された値に対応するラベル名を表示する。 応募情報：属性 画面 応募情報：応募日 画面 データベースから取得した応募情報1レコードの「応募日時」をYYYY/MM/DD 形式で表示する。 4.4. 処理 ログイン状態を確認し、ログイン認証されていない場合は全体管理者画面のログイン画面にリダイレクトし、ログイン認証されているが権限の章に記載した権限を持っていない場合は全体管理者画面のTOP画面にリダイレクトする。 「名前」「会員ID」「メールアドレス」「雇用形態」「企業名」「教室名」「現在の職業」「学年」「教室プラン」「オファー種別」「サービス種別」「応募時間」の入力処理をおこなう。 入力された全ての条件をAND結合してデータベースから条件に合致したレコードの総件数を取得する。 レコードの総件数が200,000を超えていた場合、以降は総件数を200,000件として処理を続行する。 レコードの総件数からページ総数を計算し、「ページ番号」の入力がページ総数を超えていた場合、自然数以外を表す文字列だった場合は以降はページ番号=1として処理をおこなう。 レコードの総件数が0件だった場合、データの抽出を実行しないで0件の応募データ配列を生成する。 レコードの総件数が1件以上だった場合、上記の条件をもとにして登録日時の降順に並べて、指定されたページ番号に表示すべき応募情報50件のデータをデータベースから抽出する。 出力の章に記載した出力項目をページ表示できるよう整形し、ページを出力する。 4.5. エラー処理 入力処理でエラーは発生させない。 それ以外で発生した例外に関してはフレームワークの例外処理に任せる。 4.6. ログ 一覧を表示した場合に下記フォーマットでログを出力する User {全体管理者のユーザー番号} read application list. page={ページ番号} user_id={会員ID} email_address={メールアドレスを匿名化して出力} employment_type={雇用形態} company_name={企業名} classroom_name={教室名} current_job={現在の職業} grade={学年} plan={教室プラン} offer_type={オファー種別} site={サービス種別} application_created_at={応募時間} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 並べ替え(ソート)機能は提供しない。 最後に閲覧していた 211_【FIX】応募一覧閲覧機能 のページに戻るための機能はアプリケーションでは提供しない。",
  "parentId": "705036289",
  "parentTitle": "590_■応募管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/940769281/596_+-",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2024-03-25T07:35:29.157Z",
  "author": "元ユーザー (Deleted)",
  "excerpt": "1. 目次 2. 概要 本機能は 【FIX】応募情報 の登録済みのデータの一覧を閲覧するための機能です。 3. 要求事項 クライアント企業向け管理画面にログインできるクライアント企業管理者が、概要で挙げた帳票に登録されている情報を一覧で閲覧することができる。 1ページあたりの表示数を50件とし、表示対象のレコードが51件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のペー..."
}