{
  "id": "999620722",
  "title": "034_ 【FIX】口コミブランド詳細閲覧機能",
  "content": "1. 目次 2. 概要 本機能はエンドユーザーが、登録済みの 【FIX】口コミ を教室グループ単位で閲覧するための機能です。 3. 要求事項 本ページで表示する口コミは、 【FIX】口コミ にて公開フラグが「公開」になっていて公開日が処理時点の同日か前のもののみとする。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（ご意見）」を表示する場合の質問内容のテキストは、同じ 【FIX】口コミグループ に紐づく 【FIX】口コミ の「カテゴリ」で選択されたテキストを表示する。（例：「応募動機」） 【FIX】企業：設定情報（クライアント企業向け） の「Station口コミ表示」が無効に設定されている企業の口コミは表示しない。 紐づくすべての企業（ 【FIX】企業：設定情報（クライアント企業向け） ）の「Station口コミ表示」が無効に設定されているブランドの場合、下記の通りとする。 本ページをnoinedxとする。 ブランドトップタブ、教室一覧タブ、共に非表示とし、代わりに「口コミの掲載がございません」と表示する。 表示する内容はデザインを基本とし、特記が必要なものを以下に記載する。 ページ全体を通じて、口コミ投稿者のユーザープロフィールは 012_【FIX】求人詳細閲覧機能 と同じ条件とする。 ブランドトップと教室一覧の2つのタブで表示を切り替える。 ページにアクセスした際、次の情報が入ったログを出力する 日時、ユーザー番号、教室番号、アクセス元IPアドレス、ユーザーエージェント 3.1.1. ブランドトップタブ 教室グループの口コミチャートは 012_【FIX】求人詳細閲覧機能 と同じ条件とする。 一覧フィルター用コンポーネント（応募・選考についての口コミ・実際に働いてみての口コミ） 【FIX】口コミ でラベルのテキストが同じカテゴリーは、１つのカテゴリーとして扱い、件数表示とフィルタリングを統合して行う。（例：「勤務環境」は４種類を１つにまとめる） カテゴリーごとに口コミの件数とともにボタンとして表示する。 「すべて」の選択肢は常に非表示とし、 デフォルトは 「すべて」が押下されている 全件が表示されており、カテゴリーごとの選択肢はいずれも押下されていない ものとする。 すべてを選択すると「すべて」以外も押下された状態とし、すべてを外すと「すべて」以外も押下されていない状態とする。 各カテゴリーはチェックボックス （単一選択とし、複数カテゴリーのAND条件での絞り込みは行わない） とし、押下するとそのカテゴリーの口コミのみを絞り込んだ同ページを表示する とともに、絞り込まれた口コミ一覧部分まで自動的にスクロールして表示する 。 「すべて」以外のボタンが選択されているときは、 総合満足度および チャート のセクション を非表示にする。 そのカテゴリーの口コミが0件の場合もタイトルは表示するがチェックボックスを非活性とする。 口コミ一覧 1ページあたりの表示数を10件とし、表示対象のレコードが11件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 登録日時の降順で表示し、並べ替えを行うことはできなくて良い。 ログインしていない場合は、上位3件のみ完全表示し、それ以降は回答部分をマスキングした上でボタンを表示する。ボタン中、「ログインはこちら」を押下すると 042_【FIX】会員ログイン・ログアウト機能 に遷移し、それ以外の部分を押下すると 041_【FIX】会員新規登録機能 に遷移する。 口コミの内容は全文表示する。 この塾ブランドの求人 塾ブランドの求人のうち、更新日時の新しい順に3件表示する。 「ブランドの求人を見る」ボタンを押すと、そのブランドで絞り込まれた 011_【作成中】求人一覧閲覧・検索機能 に 遷移する。 3.1.2. 教室一覧タブ 1教室1カードで表示する。 表示順は口コミ点数の降順とする。同じ点数の場合は、最新口コミ公開日の降順とする。 1ページあたりの表示数を 10件 とし、表示対象のレコードが 11 件以上の場合は、ページネーション(ページ移動のためのコンポーネント）と現在のページ数、総ページ数を一覧の上部と下部に表示する。 存在しないページを指定した場合は1ページ目を表示する。 カード内の項目はデザインを参照し、特記すべき内容のみ下に記載する。 その教室のうち、最も公開日の新しい口コミを1件表示する。 「この教室の求人詳細」を押下すると、教室の求人のうち最も更新の新しいものの 012_【FIX】求人詳細閲覧機能 へ遷移する。 「教室の口コミ詳細」を押下すると 033_ 【FIX】教室口コミ詳細閲覧機能 へ遷移する。 3.1. ワークフロー 【FIX】採用お祝い/口コミ確認・公開フロー 4. 要件定義 4.1. ユーザーインターフェース（画面） 4.1.1. ブランドトップタブ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=153152-119979&amp;mode=design&amp;t=vnkXcm9rtHKAKnp0-4 4.1.2. 教室一覧タブ https://www.figma.com/file/8zITZViFoU0WYNnwig5AKc/%E3%80%90%E5%85%B1%E6%9C%89%E3%80%91%E3%83%88%E3%83%A2%E3%83%8E%E3%82%AB%E3%82%A4%E6%A7%98_%E5%A1%BE?type=design&amp;node-id=153152-119194&amp;mode=design&amp;t=vnkXcm9rtHKAKnp0-4 4.2. ログ 詳細画面を表示した場合に 下記フォーマット でログを出力する User {ユーザー番号} read brand review detail. brand_number ={教室グループ番号} tab={top/classroomsのいずれか} page={ページ番号} {アクセスURI} {日時} {アクセス元IPアドレス} {ユーザーエージェント} 5. スコープ外・制限事項 なし",
  "parentId": "703693175",
  "parentTitle": "030_■口コミ管理機能",
  "labels": [],
  "url": "/spaces/CLIENTTOMO/pages/999620722/034_+FIX",
  "spaceKey": "CLIENTTOMO",
  "lastModified": "2025-06-04T01:57:13.847Z",
  "author": "isamu saito",
  "excerpt": "1. 目次 2. 概要 本機能はエンドユーザーが、登録済みの 【FIX】口コミ を教室グループ単位で閲覧するための機能です。 3. 要求事項 本ページで表示する口コミは、 【FIX】口コミ にて公開フラグが「公開」になっていて公開日が処理時点の同日か前のもののみとする。 ただし、 【FIX】口コミ の「口コミ項目」にて「サービスサイト上での扱い」が定義されていない項目は表示しない。 「塾について（..."
}